ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
                      <description>Do not own the channel 31</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the channel 31</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SECURE</name>
              <description>Description cluster: Request permission for the channels of GPIOTE[n]</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CH_0</name>
                  <description>Channel number</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 0 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 0 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_1</name>
                  <description>Channel number</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 1 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 1 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_2</name>
                  <description>Channel number</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 2 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 2 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_3</name>
                  <description>Channel number</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 3 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 3 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_4</name>
                  <description>Channel number</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 4 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 4 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_5</name>
                  <description>Channel number</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 5 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 5 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_6</name>
                  <description>Channel number</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 6 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 6 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_7</name>
                  <description>Channel number</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 7 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 7 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_8</name>
                  <description>Channel number</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 8 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 8 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_9</name>
                  <description>Channel number</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 9 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 9 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_10</name>
                  <description>Channel number</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 10 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 10 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_11</name>
                  <description>Channel number</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 11 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 11 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_12</name>
                  <description>Channel number</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 12 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 12 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_13</name>
                  <description>Channel number</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 13 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 13 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_14</name>
                  <description>Channel number</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 14 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 14 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_15</name>
                  <description>Channel number</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 15 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 15 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_16</name>
                  <description>Channel number</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 16 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 16 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_17</name>
                  <description>Channel number</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 17 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 17 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_18</name>
                  <description>Channel number</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 18 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 18 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_19</name>
                  <description>Channel number</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 19 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 19 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_20</name>
                  <description>Channel number</description>
                  <lsb>20</lsb>
                  <msb>20</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 20 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 20 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_21</name>
                  <description>Channel number</description>
                  <lsb>21</lsb>
                  <msb>21</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 21 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 21 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_22</name>
                  <description>Channel number</description>
                  <lsb>22</lsb>
                  <msb>22</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 22 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 22 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_23</name>
                  <description>Channel number</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 23 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 23 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_24</name>
                  <description>Channel number</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 24 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 24 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_25</name>
                  <description>Channel number</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 25 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 25 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_26</name>
                  <description>Channel number</description>
                  <lsb>26</lsb>
                  <msb>26</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 26 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 26 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_27</name>
                  <description>Channel number</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 27 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 27 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_28</name>
                  <description>Channel number</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 28 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 28 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_29</name>
                  <description>Channel number</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 29 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The channel 29 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_30</name>
                  <description>Channel number</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The channel 30 is secure</description>
