ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <register>
          <name>PERIPHID3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CUSTOMER_MODIFIED</name>
              <description>Where the component is reusable IP, this value indicates if the customer has modified the behavior of the component. In most cases this field is zero.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVAND</name>
              <description>This field indicates minor errata fixes specific to this design, for example metal fixes after implementation. In most cases this field is zero. It is recommended that component designers ensure this field can be changed by a metal fix if required, for example by driving it from registers that reset to zero.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Contains bits [7:0] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Contains bits [11:8] of the component identification</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CLASS</name>
              <description>Class of the component. E.g. ROM table, CoreSight component etc. Constitutes bits [15:12] of the component identification.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Contains bits [23:16] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPID3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Contains bits [31:24] of the component identification</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_CTI210</name>
      <description>Cross-Trigger Interface control 0</description>
      <baseAddress>0xBF046000</baseAddress>
      <headerStructName>CTI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CTICONTROL</name>
          <description>CTI Control register</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GLBEN</name>
              <description>Enables or disables the CTI.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>All cross-triggering mapping logic functionality is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Cross-triggering mapping logic functionality is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINTACK</name>
          <description>CTI Interrupt Acknowledge register</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTACK_0</name>
              <description>Acknowledges the ctitrigout 0 output.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_1</name>
              <description>Acknowledges the ctitrigout 1 output.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_2</name>
              <description>Acknowledges the ctitrigout 2 output.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_3</name>
              <description>Acknowledges the ctitrigout 3 output.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_4</name>
              <description>Acknowledges the ctitrigout 4 output.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_5</name>
              <description>Acknowledges the ctitrigout 5 output.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_6</name>
              <description>Acknowledges the ctitrigout 6 output.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTACK_7</name>
              <description>Acknowledges the ctitrigout 7 output.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPSET</name>
          <description>CTI Application Trigger Set register</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>APPSET_0</name>
              <description>Application trigger event for channel 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPSET_1</name>
              <description>Application trigger event for channel 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPSET_2</name>
              <description>Application trigger event for channel 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPSET_3</name>
              <description>Application trigger event for channel 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPCLEAR</name>
          <description>CTI Application Trigger Clear register</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>APPCLEAR_0</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPCLEAR_1</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPCLEAR_2</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPCLEAR_3</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPPULSE</name>
          <description>CTI Application Pulse register</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>APPULSE_0</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPULSE_1</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPULSE_2</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPULSE_3</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
