ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210">
      <name>GLOBAL_ATBFUNNEL211</name>
      <description>ATB funnel module 1</description>
      <baseAddress>0xBF04D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210">
      <name>GLOBAL_ATBFUNNEL212</name>
      <description>ATB funnel module 2</description>
      <baseAddress>0xBF04E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBFUNNEL210">
      <name>GLOBAL_ATBFUNNEL213</name>
      <description>ATB funnel module 3</description>
      <baseAddress>0xBF04F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>VPRLMAC</name>
      <description>VPR peripheral registers 0</description>
      <baseAddress>0x48000000</baseAddress>
      <headerStructName>VPR</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VPRLMAC</name>
        <value>0</value>
      </interrupt>
      <groupName>VPR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_TRIGGER[%s]</name>
          <description>Description collection: VPR task [n] register</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_TRIGGER</name>
              <description>VPR task [n] register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_TRIGGER[%s]</name>
          <description>Description collection: Subscribe configuration for task TASKS_TRIGGER[n]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Subscription enable bit (write only)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>Subscription enable bit</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_TRIGGERED[%s]</name>
          <description>Description collection: VPR event [n] register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_TRIGGERED</name>
              <description>VPR event [n] register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_TRIGGERED[%s]</name>
          <description>Description collection: Publish configuration for event EVENTS_TRIGGERED[n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Publication enable bit (write only)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>Publication enable bit</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
