ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>BUSERROR</name>
            <description>Sink bus error status.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUSERROR</name>
                <description>Bus error type</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoError</name>
                    <description>There are no errors.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ReadError</name>
                    <description>Error related to memory when reading joblist.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ReadDecodeError</name>
                    <description>Error related to the joblist address when reading joblist.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WriteError</name>
                    <description>Error related to memory/register when writing data.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WriteDecodeError</name>
                    <description>Error related to the memory/register address when writing data.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDRESS</name>
            <description>Latest address being accessed on the Sink channel. If a bus error occurs, these registers will contain the address that cause the error.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Sink address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>JOBCOUNT</name>
            <description>Number of completed jobs in the current Sink descriptor list. This resets to 0 when a new joblist is started.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Sink job count</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>PCGCS000</name>
      <description>PCGCSlave 0</description>
      <baseAddress>0x48009000</baseAddress>
      <headerStructName>PCGCSLAVE</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PCGCSLAVE</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PENALTY[%s]</name>
          <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty level</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PENALTY0</name>
          <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <alternateRegister>PENALTY[%s]</alternateRegister>
          <size>0x20</size>
          <fields>
            <field>
              <name>PENALTY</name>
              <description>Penalty level</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FORCEOVERRIDE[%s]</name>
          <description>Description collection: Force override of power/clock pair n.</description>
          <addressOffset>0xC80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLOCKFORCINGPRE</name>
              <description>CLOCKFORCINGPRE</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DOFORCECLOCKPRE</name>
              <description>DOFORCECLOCKPRE</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>POWERFORCINGPRE</name>
              <description>POWERFORCINGPRE</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>DOFORCEPOWERPRE</name>
              <description>DOFORCEPOWERPRE</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
