ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>ANTSWC_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>ANTEN</name>
            <description>Override antenna switch (AntSw) output signals</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL_0</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_1</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_2</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_3</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_4</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_5</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_6</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_7</name>
                <description>Override configuration for AntSw. Note only one bit should be set and AntSw will be set to the encoded value of the position of the set bit. Where multiple bits are set the AntSw signal value is set to 0</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Antenna port not selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Antenna port selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PAEN</name>
            <description>Override power amplifier enable (PaEn) output signals</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL_0</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_1</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_2</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_3</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_4</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_5</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_6</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_7</name>
                <description>Override value for the signal PAEn[i]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in PAEn</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in PAEn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LNASW</name>
            <description>Override shared LNA switch (LnaSw) output signals</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL_0</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_1</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_2</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_3</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_4</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_5</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_6</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VAL_7</name>
                <description>Override value for the signal LnaSw[i]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clear the corresponding bit in LnaSw</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Assert the corresponding bit in LnaSw</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>ANTSWC_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
