ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>LB_RX_DCOCRESQ</name>
            <description>Unspecified</description>
            <addressOffset>0x245C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_RX_GAIN</name>
            <description>Unspecified</description>
            <addressOffset>0x2460</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RF_GAIN_READ</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_ENABLE0</name>
            <description>Unspecified</description>
            <addressOffset>0x2464</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXBB_I_FILT_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TXBB_Q_FILT_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LO_IQ_DIV_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MIXER_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>DCOC_ADC_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DCOC_DAC_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RFVDD_POWER_SW</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_ENABLE1</name>
            <description>Unspecified</description>
            <addressOffset>0x2468</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_BIAS_SOURCE_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LO_IQ_DIV_BIAS</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TXBB_FILTER_BIAS</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DCOC_ADC_BIAS</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_DAC_BIAS</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TSSI_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>POWER_DET_DIFF_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>POWER_DET_SE_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_BBFILT</name>
            <description>Unspecified</description>
            <addressOffset>0x246C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXBB_FILT_BW_TUNE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TXBB_FILT_BW_MODE</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DCOC_CURRENT_SEL</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_BIAS0</name>
            <description>Unspecified</description>
            <addressOffset>0x2470</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000AA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_MIRROR_LODIV</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_TXBB</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_ADC</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_DAC</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_BIAS1</name>
            <description>Unspecified</description>
            <addressOffset>0x2474</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_SOURCE</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TX_BIAS_OUT_VREF</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LO_COMMON_V</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_PGADATUNE</name>
            <description>Unspecified</description>
            <addressOffset>0x2478</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000044</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PGA_F_TUNE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DA_F_TUNE</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_PATUNEVCG</name>
            <description>Unspecified</description>
            <addressOffset>0x247C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000044</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_F_TUNE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_GATE_V</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_PGADABIAS</name>
            <description>Unspecified</description>
            <addressOffset>0x2480</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000088</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PGA_BIAS</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DA_BIAS</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_PABIAS</name>
            <description>Unspecified</description>
            <addressOffset>0x2484</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000050</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_BIAS</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TEMPSENS_DC_OFFSET</name>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TEMPSENS_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_PDDPD</name>
            <description>Unspecified</description>
            <addressOffset>0x2488</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000043</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPD_ATTEN</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>POWER_DETECT_ATTEN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_DCOC0</name>
            <description>Unspecified</description>
            <addressOffset>0x248C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DCOC_SOURCE</name>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DCOC_INV_ADC_IN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_LINEAR_SEARCH</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>DCOC_USE_OLD_VAL</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DCOC_IN_PROGRESS</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_DCOC1</name>
            <description>Unspecified</description>
            <addressOffset>0x2490</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000C8</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_MEAS_T</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_NUM_ITERATION</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_DCOCBYPI</name>
            <description>Unspecified</description>
            <addressOffset>0x2494</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_I_START_BYPASS_VAL</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_DCOCBYPQ</name>
            <description>Unspecified</description>
            <addressOffset>0x2498</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_START_BYPASS_VAL</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_PARAMPT</name>
            <description>Unspecified</description>
            <addressOffset>0x249C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000020</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_RAMP_TIME</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_TXPOWER</name>
            <description>Unspecified</description>
            <addressOffset>0x24A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_POWER</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TX_POWER_EXT_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_RXPATUNE</name>
            <description>Unspecified</description>
            <addressOffset>0x24A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_F_TUNE_RX</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_TUNE_SEL</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_SPARE</name>
            <description>Unspecified</description>
            <addressOffset>0x24A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPARE_REG</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_DCOCRESI</name>
            <description>Unspecified</description>
            <addressOffset>0x24AC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_I_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_DCOCRESQ</name>
            <description>Unspecified</description>
            <addressOffset>0x24B0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_RFGAIN</name>
            <description>Unspecified</description>
            <addressOffset>0x24B4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RF_GAIN_READ</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TX_BBGAIN</name>
            <description>Unspecified</description>
            <addressOffset>0x24B8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BB_GAIN_READ</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TRX_ENABLE</name>
            <description>Unspecified</description>
            <addressOffset>0x24BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>HIGH_CURRENT_MODE_TX</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LDO_EN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TX_DIV_BIAS</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>RX_DIV_BIAS</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED1_FOR_LB</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>NOTUSED2_FOR_LB</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TRX_TRIM0</name>
            <description>Unspecified</description>
            <addressOffset>0x24C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LDO_TRIM</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BG_TRIM</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TEST_MODE_1_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>TEST_MODE_2_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TRX_TRIM1</name>
            <description>Unspecified</description>
            <addressOffset>0x24C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LO_BUF_CTAT_BIAS_TUNE</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LO_DIV_CTAT_BIAS_TUNE</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TRX_SPECIAL</name>
            <description>Unspecified</description>
            <addressOffset>0x24C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ARM_THIS_BAND</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LO_DIV_EN_TX</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LO_DIV_EN_RX</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ANTSW_BYPASS</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TRX_ALC0</name>
            <description>Unspecified</description>
            <addressOffset>0x24CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_RESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ALC_SAMPLE</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ALC_BYPASS</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ALC_TUNE_BYPASS_VAL</name>
                <lsb>3</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LB_TRX_ALC1</name>
            <description>Unspecified</description>
            <addressOffset>0x24D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_SETTLING</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ALC_VALID</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ALC_TUNING_VAL</name>
                <lsb>3</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
