ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>LB_TRX_STATUS</name>
            <description>Unspecified</description>
            <addressOffset>0x24D4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LDO_UP</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ALC_AMPLITUDE</name>
                <lsb>1</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_ENABLE0</name>
            <description>Unspecified</description>
            <addressOffset>0x2500</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LNA_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MIXER_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>V2I_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LO_IQ_DIV_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RXBB_FILTER_EN</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>RXBB_FILTER_BIAS</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DCOC_DAC_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_ENABLE1</name>
            <description>Unspecified</description>
            <addressOffset>0x2504</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_ADC_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DPD_PATH_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RSSI_BUF_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RSSI_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>IBIAS_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PTAT_BIAS_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>LARGE_CTAT_BIAS_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_BIASEN</name>
            <description>Unspecified</description>
            <addressOffset>0x2508</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_LODIV_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CTAT_V2I_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CTAT_RSSI_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CTAT_RXBB_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CTAT_DCOC_DAC_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CTAT_DCOC_ADC_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BLE_BUF_BIAS_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>CTAT_RESERVED_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_LNASETS</name>
            <description>Unspecified</description>
            <addressOffset>0x250C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000089</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LNA_CURRENT</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MIXER_GATE_BIAS</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LNA_F_TUNE</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_RSSIAGC</name>
            <description>Unspecified</description>
            <addressOffset>0x2510</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000024</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSI_SLOPE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RSSI_GAIN</name>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RSSI_MONITOR_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RSSI_BW</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>RSSI_AVG_LEN_BIT0</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>GAIN_FROM_AGC_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_GAINPTR</name>
            <description>Unspecified</description>
            <addressOffset>0x2514</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BB_GAIN</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LNA_GAIN</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DACRXBB</name>
            <description>Unspecified</description>
            <addressOffset>0x2518</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000038</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_DAC_I_SEL</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BLE_BUF_BIAS_CTRL</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RXBB_BIAS</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RXBB_SW40M</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_RXBBFRQ</name>
            <description>Unspecified</description>
            <addressOffset>0x251C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000020</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXBB_BW</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>RXBB_FBW_ADJ</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_RXBBSET</name>
            <description>Unspecified</description>
            <addressOffset>0x2520</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000B2</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXBB_COMMON_V</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RXBB_QUALITY_VAL</name>
                <lsb>2</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_CTAT0</name>
            <description>Unspecified</description>
            <addressOffset>0x2524</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000AA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_MIRROR_LODIV</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_V2I</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_RSSI</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_RXBB</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_CTAT1</name>
            <description>Unspecified</description>
            <addressOffset>0x2528</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000AA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_MIRROR_DAC</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_ADC</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_6</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_7</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_PTATCTL</name>
            <description>Unspecified</description>
            <addressOffset>0x252C</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000AA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTAT_BIAS_MIRROR_RSSI</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PTAT_BIAS_SOURCE</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LARGE_CTAT_LNA_MR</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LARGE_CTAT_SOURCE</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_BIASETC</name>
            <description>Unspecified</description>
            <addressOffset>0x2530</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000008A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMCTRL_BIAS_OUT_REF</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>VCM_OUT_VREF_OUT_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BT_CONCURRENT_EN_LB</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>MIXER_GATE_V_MSB</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CTAT_SOURCE</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_OVRDLNA</name>
            <description>Unspecified</description>
            <addressOffset>0x2534</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LNA_OVERRIDE_RFB</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LNA_OVERRIDE_GM_STEER</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_OVRDLBB</name>
            <description>Unspecified</description>
            <addressOffset>0x2538</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LNA_OVERRIDE_HLG</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LNA_OVERRIDE</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LNA_OVERRIDE_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RXBB_GAIN_1_OVERRIDE</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_OVRDBB</name>
            <description>Unspecified</description>
            <addressOffset>0x253C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXBB_GAIN_2_OVERRIDE</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RXBB_GAIN_3_OVERRIDE</name>
                <lsb>3</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RXBB_GAIN_OVERRIDE_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DCOC0</name>
            <description>Unspecified</description>
            <addressOffset>0x2540</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DCOC_SOURCE</name>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DCOC_INV_ADC_OUT</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_INTIAL_ITERATION</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DCOC_ACTIVE</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DCOC1</name>
            <description>Unspecified</description>
            <addressOffset>0x2544</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000E4</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_MEAS_T</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_NUM_ITERATION</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DCOCBYPI</name>
            <description>Unspecified</description>
            <addressOffset>0x2548</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_I_START_BYPASS_VAL</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DCOCBYPQ</name>
            <description>Unspecified</description>
            <addressOffset>0x254C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_START_BYPASS_VAL</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_RSSISET</name>
            <description>Unspecified</description>
            <addressOffset>0x2550</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000072</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSI_AVG_LEN_BIT_2_1</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RSSI_DELAY</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>RSSI_MEAS_T</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_SPARE</name>
            <description>Unspecified</description>
            <addressOffset>0x2554</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPARE_REG</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DCOCRESI</name>
            <description>Unspecified</description>
            <addressOffset>0x2558</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_I_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_DCOCRESQ</name>
            <description>Unspecified</description>
            <addressOffset>0x255C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_RX_GAIN</name>
            <description>Unspecified</description>
            <addressOffset>0x2560</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RF_GAIN_READ</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_ENABLE0</name>
            <description>Unspecified</description>
            <addressOffset>0x2564</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXBB_I_FILT_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TXBB_Q_FILT_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LO_IQ_DIV_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MIXER_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>DCOC_ADC_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DCOC_DAC_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RFVDD_POWER_SW</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
