ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>HB_TX_ENABLE1</name>
            <description>Unspecified</description>
            <addressOffset>0x2568</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_BIAS_SOURCE_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LO_IQ_DIV_BIAS</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TXBB_FILTER_BIAS</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DCOC_ADC_BIAS</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_DAC_BIAS</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TSSI_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>POWER_DET_DIFF_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>POWER_DET_SE_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_BBFILT</name>
            <description>Unspecified</description>
            <addressOffset>0x256C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXBB_FILT_BW_TUNE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TXBB_FILT_BW_MODE</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DCOC_CURRENT_SEL</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_BIAS0</name>
            <description>Unspecified</description>
            <addressOffset>0x2570</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000AA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_MIRROR_LODIV</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_TXBB</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_ADC</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CTAT_MIRROR_DAC</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_BIAS1</name>
            <description>Unspecified</description>
            <addressOffset>0x2574</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTAT_SOURCE</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TX_BIAS_OUT_VREF</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LO_COMMON_V</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_PGADATUNE</name>
            <description>Unspecified</description>
            <addressOffset>0x2578</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000044</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PGA_F_TUNE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DA_F_TUNE</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_PATUNEVCG</name>
            <description>Unspecified</description>
            <addressOffset>0x257C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000044</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_F_TUNE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_GATE_V</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_PGADABIAS</name>
            <description>Unspecified</description>
            <addressOffset>0x2580</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000088</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PGA_BIAS</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DA_BIAS</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_PABIAS</name>
            <description>Unspecified</description>
            <addressOffset>0x2584</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000050</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_BIAS</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TEMPSENS_DC_OFFSET</name>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TEMPSENS_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_PDDPD</name>
            <description>Unspecified</description>
            <addressOffset>0x2588</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000043</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPD_ATTEN</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>POWER_DETECT_ATTEN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_DCOC0</name>
            <description>Unspecified</description>
            <addressOffset>0x258C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DCOC_SOURCE</name>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DCOC_INV_ADC_IN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_LINEAR_SEARCH</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>DCOC_USE_OLD_VAL</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DCOC_IN_PROGRESS</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_DCOC1</name>
            <description>Unspecified</description>
            <addressOffset>0x2590</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000C8</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_MEAS_T</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCOC_NUM_ITERATION</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_DCOCBYPI</name>
            <description>Unspecified</description>
            <addressOffset>0x2594</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_I_START_BYPASS_VAL</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_DCOCBYPQ</name>
            <description>Unspecified</description>
            <addressOffset>0x2598</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_START_BYPASS_VAL</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_PARAMPT</name>
            <description>Unspecified</description>
            <addressOffset>0x259C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000020</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_RAMP_TIME</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_TXPOWER</name>
            <description>Unspecified</description>
            <addressOffset>0x25A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_POWER</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TX_POWER_EXT_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_RXPATUNE</name>
            <description>Unspecified</description>
            <addressOffset>0x25A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PA_F_TUNE_RX</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_TUNE_SEL</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_SPARE</name>
            <description>Unspecified</description>
            <addressOffset>0x25A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPARE_REG</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_DCOCRESI</name>
            <description>Unspecified</description>
            <addressOffset>0x25AC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_I_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_DCOCRESQ</name>
            <description>Unspecified</description>
            <addressOffset>0x25B0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOC_Q_RESULT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_RFGAIN</name>
            <description>Unspecified</description>
            <addressOffset>0x25B4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RF_GAIN_READ</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TX_BBGAIN</name>
            <description>Unspecified</description>
            <addressOffset>0x25B8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BB_GAIN_READ</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_ENABLE</name>
            <description>Unspecified</description>
            <addressOffset>0x25BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>HIGH_CURRENT_MODE_TX</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LDO_EN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LO_BUFFER_BIAS</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED_FOR_HB</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LO_DRIVER_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ALC_ENABLE</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_TRIM0</name>
            <description>Unspecified</description>
            <addressOffset>0x25C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LDO_TRIM</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BG_TRIM</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TEST_MODE_1_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>TEST_MODE_2_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_TRIM1</name>
            <description>Unspecified</description>
            <addressOffset>0x25C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LO_BUF_CTAT_BIAS_TUNE</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LO_DIV_CTAT_BIAS_TUNE</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_SPECIAL</name>
            <description>Unspecified</description>
            <addressOffset>0x25C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ARM_THIS_BAND</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>NOTUSED1_FOR_HB</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>NOTUSED2_FOR_HB</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>3</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_ALC0</name>
            <description>Unspecified</description>
            <addressOffset>0x25CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_RESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ALC_SAMPLE</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ALC_BYPASS</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ALC_TUNE_BYPASS_VAL</name>
                <lsb>3</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_ALC1</name>
            <description>Unspecified</description>
            <addressOffset>0x25D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_SETTLING</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ALC_VALID</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ALC_TUNING_VAL</name>
                <lsb>3</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HB_TRX_STATUS</name>
            <description>Unspecified</description>
            <addressOffset>0x25D4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LDO_UP</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ALC_AMPLITUDE</name>
                <lsb>1</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_ENABLE0</name>
            <description>Unspecified</description>
            <addressOffset>0x2600</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AFEPWR_BG_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AFEPWR_LDO_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BG_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CLK_DOUBLER_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BBPLL_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>BBPLL_ADC_CLK_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BBPLL_DAC_CLK_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BG_SET_1P1V</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
