ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>AFE_ENABLE1</name>
            <description>Unspecified</description>
            <addressOffset>0x2604</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXDAC_I_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RXDAC_I_REF_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RXDAC_Q_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RXDAC_Q_REF_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TXDAC_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TXDAC_REF_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LOCK_DETECT_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DIV_BY_7_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_ENABLE2</name>
            <description>Unspecified</description>
            <addressOffset>0x2608</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN_AFEVDD_EN_BUCKDD</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BG_TRIM</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LDO_TRIM</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TESTMUX</name>
            <description>Unspecified</description>
            <addressOffset>0x260C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AFEPWR_TP2_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AFEPWR_TP1_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>GEN3_ATB_SEL</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GEN3_DTB_SEL</name>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_AFEBG</name>
            <description>Unspecified</description>
            <addressOffset>0x2610</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_V_SETTING</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>BG_TEST_OUT_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BG_TEST_OUT_SEL</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL1</name>
            <description>Unspecified</description>
            <addressOffset>0x2614</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBPLL_MANUAL_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>BBPLL_AFC_MANUAL_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>BBPLL_CCOBUF_MANUAL_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>BBPLL_OPA_MANUAL_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BBPLL_CC0_MANUAL_EN</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>BBPLL_CP_MANUAL_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BBPLL_DIVN_MANUAL_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BBPLL_DIVR_MANUAL_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL2</name>
            <description>Unspecified</description>
            <addressOffset>0x2618</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000033</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LDO1_DIVN_V_SEL</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LDO1_MANUAL_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LDO2_CCO_V_SEL</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>LDO2_MANUAL_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL3</name>
            <description>Unspecified</description>
            <addressOffset>0x261C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PLL_REF_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DIV_CLK_LVDS_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>DIV_CLK_LVDS_CTRL</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL4</name>
            <description>Unspecified</description>
            <addressOffset>0x2620</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000056</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LPF_C1_SEL</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LPF_C2_SEL</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL5</name>
            <description>Unspecified</description>
            <addressOffset>0x2624</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000085</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LPF_R1_SEL</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ICP_SEL</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL6</name>
            <description>Unspecified</description>
            <addressOffset>0x2628</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000A0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCO_CAP_BANK</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>TP_CLK_SEL</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL7</name>
            <description>Unspecified</description>
            <addressOffset>0x262C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000014</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DIVN</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DIVN_MANUAL_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL8</name>
            <description>Unspecified</description>
            <addressOffset>0x2630</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TP1_DECODER_SEL</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TP1_DECODER_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TP2_DECODER_SEL</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TP2_DECODER_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLL9</name>
            <description>Unspecified</description>
            <addressOffset>0x2634</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000C0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LDO_BYPASS_MODE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CCO_KVCO_SEL</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TP_DIGCLK_SEL</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLLA</name>
            <description>Unspecified</description>
            <addressOffset>0x2638</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000013</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DAC_CLK_SEL</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ADC_CLK_SEL</name>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_BBPLLB</name>
            <description>Unspecified</description>
            <addressOffset>0x263C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000001C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCK_DETECT_TIMING</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>X2_COMPARATOR</name>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DIV17_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DIG_TP_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_RXADC0</name>
            <description>Unspecified</description>
            <addressOffset>0x2640</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000044</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADC_VREF_LDO_V</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>VREF_CORE_LDO_BYPASS</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ADC_CORE_LDO_V</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>OUTPUT_ON_CLK_FALL</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_RXADC1</name>
            <description>Unspecified</description>
            <addressOffset>0x2644</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000FB</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VREF_V</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TIME_INTERLEAVE_MODE</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ADC_CHANNEL_SEL</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SIGN_MAG_OUTPUT_FORMAT</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ADC_CLK_OUT_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_RXADC2</name>
            <description>Unspecified</description>
            <addressOffset>0x2648</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000068</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIN_SAMPLING_TIME_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ADC_TCLK_CK</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>DOWNSAMPLE_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DOWNSAMPLE_BY_5</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ADC_COMMON_MODE_V_SEL</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>VREF_CODE_LDO_BIAS</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_RXADC3</name>
            <description>Unspecified</description>
            <addressOffset>0x264C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000038</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VREF_LDO_TEST_OUT_SEL</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>USE_REF_EN_INPUT</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ADC_SPEED_SEL</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>CORE_LDO_STANDBY_V_SEL</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_RXADC4</name>
            <description>Unspecified</description>
            <addressOffset>0x2650</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TEST_OUT_CLK_SEL</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RG_IN_CR_BW18</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC0</name>
            <description>Unspecified</description>
            <addressOffset>0x2654</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000B3</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DAC_LATCH_V</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DAC_INPUT_SIGN_MAG_FORMAT</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DAC_LDO_V</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DAC_IN_RISING_EDGE_LATCH</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC1</name>
            <description>Unspecified</description>
            <addressOffset>0x2658</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000CC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I_CASCADE_BIAS</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>I_BIAS_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>Q_CASCADE_BIAS</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>Q_BIAS_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC2</name>
            <description>Unspecified</description>
            <addressOffset>0x265C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000007C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DAC_CHANNEL_FOR_CLK</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CLOCK_OUTPUT_EN</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>USE_INTERNAL_BBPLL_CLK</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TEST_NODE_SELECT</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TEST_OUTPUT_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC3</name>
            <description>Unspecified</description>
            <addressOffset>0x2660</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000044</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I_COMMON_MODE_V</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LDO_BYPASS</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>Q_COMMON_MODE_V</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DIG_BYPASS</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC4</name>
            <description>Unspecified</description>
            <addressOffset>0x2664</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000C0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I_OFFSET</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>I_OFFSET_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC5</name>
            <description>Unspecified</description>
            <addressOffset>0x2668</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000C0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Q_OFFSET</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>Q_OFFSET_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
