ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>AFE_TXDAC6</name>
            <description>Unspecified</description>
            <addressOffset>0x266C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000055</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>I_LOAD_RESISTOR_SEL</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>Q_LOAD_RESISTOR_SEL</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LDO_L_BIAS_CURRENT_SEL</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LDO_DIG_BIAS_CURRENT_SEL</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_TXDAC7</name>
            <description>Unspecified</description>
            <addressOffset>0x2670</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000088</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Q_GAIN_FINE_TUNE</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>Q_LOAD_RESISTANCE_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>I_GAIN_FINE_TUNE</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>I_LOAD_RESISTANCE_EN</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLP_ENABLE0</name>
            <description>Unspecified</description>
            <addressOffset>0x2674</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RF_LDO_EN</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PALDO_SOFTSTART</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PALDO_EN</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PALDO_BYPASS</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PALDO_LP_MODE_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BG_TRIM_4</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLP_ENABLE1</name>
            <description>Unspecified</description>
            <addressOffset>0x2678</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTUSED1</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PA_RFVDD_SWITCH_LB</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PA_RFVDD_SWITCH_HB</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TEST_MODE_1_EN</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>TEST_MODE_2_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>NOTUSED2</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLP_TRIM</name>
            <description>Unspecified</description>
            <addressOffset>0x267C</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000CE</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_TRIM</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RF_LDO_TRIM</name>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PALDO_TRIM</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFEWLP_SPARE</name>
            <description>Unspecified</description>
            <addressOffset>0x2680</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPARE_REG</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLP_VDDUP</name>
            <description>Unspecified</description>
            <addressOffset>0x2684</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RF_LDO_UP</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PALDO_UP</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFE_ROBBPLL</name>
            <description>Unspecified</description>
            <addressOffset>0x2688</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBPLL_VCO_CAP_SETTING</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BBPLL_AFC_CAL_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BBPLL_LOCK_DETECT</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_ENABLE0</name>
            <description>Unspecified</description>
            <addressOffset>0x2700</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_REF_EN</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FILTER_BYPASS</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>SXVCO_LDO_EN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>VDDLO_LDO_EN</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>VDDDTC_LDO_EN</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_ENABLE1</name>
            <description>Unspecified</description>
            <addressOffset>0x2704</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDDDPQ_LDO_EN</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>VDDDIG_LDO_EN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TDC_POWERUP</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>BBPLL_ENABLE_CLK</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DCO_EN</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ADPLL_STATE_MACHINE_START</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_TRIM0</name>
            <description>Unspecified</description>
            <addressOffset>0x2708</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000002A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BG_TEMP_COEFF</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>VDDVCO_OUT</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>VDDLO_OUT</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>VDDDTC_OUT</name>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_TRIM1</name>
            <description>Unspecified</description>
            <addressOffset>0x270C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDDPQ_OUT</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>VDDDIG_OUT</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DCO_BIAS</name>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_LOGEN</name>
            <description>Unspecified</description>
            <addressOffset>0x2710</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOGEN_EN_0</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LOGEN_EN_1</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>UNUSED_LOGEN_EN</name>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LOGEN_BIAS</name>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SX_TRIM0_SELECTOR_BIT2</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>SAMPLE_PHASE_SEL</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_ALCBP</name>
            <description>Unspecified</description>
            <addressOffset>0x2714</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_LO_TUNE_BYPASS</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_TESTSEL</name>
            <description>Unspecified</description>
            <addressOffset>0x2718</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ATE_SELECTOR</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DTE_SELECTOR</name>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RESETN_ADPLL_BUSSCHEDULER</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_DEBUG</name>
            <description>Unspecified</description>
            <addressOffset>0x271C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTUSED</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DTC_DEBUG</name>
                <lsb>1</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TDC_DEBUG</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_SPARE</name>
            <description>Unspecified</description>
            <addressOffset>0x2720</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAPRE_REG</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_ALCCTRL</name>
            <description>Unspecified</description>
            <addressOffset>0x2724</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_RESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ALC_SAMPLE</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>NOTUSED1</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ALC_SETTLING</name>
                <lsb>3</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NOTUSED3</name>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_ALCRESULT</name>
            <description>Unspecified</description>
            <addressOffset>0x2728</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALC_RESULT</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ALC_TUNING_VAL</name>
                <lsb>3</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ALC_FINISHED</name>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ALC_VALID</name>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_LDOUP</name>
            <description>Unspecified</description>
            <addressOffset>0x272C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDDDIG_LDO_READY</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>VDDPQ_LDO_READY</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>VDDDTC_LDO_READY</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>VDDLO_LDO_READY</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>VDDVCO_LDO_READY</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ADPLL_LOCK_STATUS</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SX_CHIPID</name>
            <description>Unspecified</description>
            <addressOffset>0x2730</addressOffset>
            <access>read-only</access>
            <resetValue>0x00230307</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHIP_ID_DATE</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RF_CTRL</name>
          <description>Unspecified</description>
          <headerStructName>RPURFBUS_RF_CTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x10000</addressOffset>
          <register>
            <name>AXIMASTERACCESS</name>
            <description>RF CTRL AXI MASTER ACCESS</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESTRICTED</name>
                <description>Enable restricted access to RF slave registers:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UnrestrictedAccess</name>
                    <description>Unrestricted access</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RestrictAccessToMast</name>
                    <description>Restrict access to master specified by MASTER_ID</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MASTERID</name>
                <description>When RESTRICTED=1 select master with access to RF slave registers:</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RiscVCpu0</name>
                    <description>RISC-V CPU 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RiscVCpu1</name>
                    <description>RISC-V CPU 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MemoryVectorDma</name>
                    <description>Memory Vector DMA</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GlobalDomainMaster</name>
                    <description>Global Domain Master</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnsigmaDmaController</name>
                    <description>Ensigma DMA Controller RAM Read</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DmaControlProcessor</name>
                    <description>DMA Control Processor</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnsigmaDmaController6</name>
                    <description>Ensigma DMA Controller Peripherical</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnsigmaDmaController7</name>
                    <description>Ensigma DMA Controller RAM Write</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
