ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>VIDPKTSIZE</name>
            <description>Configures the video packet size.</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDPKTSIZE</name>
                <description>This field configures the number of pixels in a single video packet.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDNUMCHUNKS</name>
            <description>Configures the number of chunks to use. The data in each chunk has the size provided by VID_PKT_SIZE.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDNUMCHUNKS</name>
                <description>This register configures the number of chunks to be transmitted during a Line period (a chunk is pair made of a video packet and a null packet). If set to 0 or 1, video line is still transmitted in a single packet. If set to 1 that packet is part of a chunk, meaning that a null packet follows it (if vid_null_size&amp;gt;0). Otherwise, multiple chunks are used to transmit each video line.</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDNULLSIZE</name>
            <description>Configures the size of null packets.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDNULLSIZE</name>
                <description>This register configures the number of bytes inside a null packet. Setting to 0 disables null packets.</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDHSATIME</name>
            <description>Configures the video HSA time.</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDHSATIME</name>
                <description>This field configures the Horizontal Synchronism Active period in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDHBPTIME</name>
            <description>Configures the video HBP time.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDHBPTIME</name>
                <description>This field configures the Horizontal Back Porch period in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDHLINETIME</name>
            <description>Configures the overall time for each video line.</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VIDHLINETIME</name>
                <description>This field configures the size of the total line time (HSA+HBP+HACT+HFP) counted in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVSALINES</name>
            <description>Configures the VSA period.</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VSALINES</name>
                <description>This field configures the Vertical Synchronism Active period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVBPLINES</name>
            <description>Configures the VBP period.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VBPLINES</name>
                <description>This field configures the Vertical Back Porch period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVFPLINES</name>
            <description>Configures the VFP period.</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VFPLINES</name>
                <description>This field configures the Vertical Front Porch period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIDVACTIVELINES</name>
            <description>Configures the vertical resolution of video.</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VACTIVELINES</name>
                <description>This field configures the Vertical Active period measured in number of horizontal lines.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CMDMODECFG</name>
            <description>Configures several aspect of command mode operation, tearing effect, acknowledge for each packet and the speed mode to transmit each Data Type related to commands.</description>
            <addressOffset>0x068</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TEARFXEN</name>
                <description>When set to 1, this bit enables the tearing effect acknowledge request.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ACKRQSTEN</name>
                <description>When set to 1, this bit enables the acknowledge request after each packet transmission.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>GENSW0PTX</name>
                <description>This bit configures the Generic short write packet with zero parameter command transmission type:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENSW1PTX</name>
                <description>This bit configures the Generic short write packet with one parameter command transmission type:</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENSW2PTX</name>
                <description>This bit configures the Generic short write packet with two parameters command transmission type:</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENSR0PTX</name>
                <description>This bit configures the Generic short read packet with zero parameter command transmission type:</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENSR1PTX</name>
                <description>This bit configures the Generic short read packet with one parameter command transmission type:</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENSR2PTX</name>
                <description>This bit configures the Generic short read packet with two parameters command transmission type:</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENLWTX</name>
                <description>This bit configures the Generic long write packet command transmission type:</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCSSW0PTX</name>
                <description>This bit configures the DCS short write packet with zero parameter command transmission type:</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCSSW1PTX</name>
                <description>This bit configures the DCS short write packet with one parameter command transmission type:</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCSSR0PTX</name>
                <description>This bit configures the DCS short read packet with zero parameter command transmission type:</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCSLWTX</name>
                <description>This bit configures the DCS long write packet command transmission type:</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MAXRDPKTSIZE</name>
                <description>This bit configures the maximum read packet size command transmission type:</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HIGHSPEED</name>
                    <description>Transition type is high-speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOWPOWER</name>
                    <description>Transition type is low-power</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GENHDR</name>
            <description>Sets the header for new packets sent using the Generic interface.</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GENDT</name>
                <description>This field configures the packet Data Type of the header packet.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>GENVC</name>
                <description>This field configures the Virtual Channel ID of the header packet.</description>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GENWCLSBYTE</name>
                <description>This field configures the least significant byte of the header packet's Word count for long packets or data 0 for short packets.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GENWCMSBYTE</name>
                <description>This field configures the most significant byte of the header packet's word count for long packets or data 1 for short packets.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENPLDDATA</name>
            <description>Sets the payload for packets sent using the Generic interface and, when read returns the contents of READ responses from the peripheral.</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GENPLDB1</name>
                <description>This field indicates byte 1 of the packet payload.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GENPLDB2</name>
                <description>This field indicates byte 2 of the packet payload.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GENPLDB3</name>
                <description>This field indicates byte 3 of the packet payload.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GENPLDB4</name>
                <description>This field indicates byte 4 of the packet payload.</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
