ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_DISPC_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PENALTY0</name>
            <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>PENALTY[%s]</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CORE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_DISPC_CORE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>MODE</name>
            <description>General control register that activates the NemaDC</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTMODEEN</name>
                <description>When set to 1, test mode is enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DOUBLESCANEN</name>
                <description>When set to 1, double horizontal scan is enabled</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>POS02LEN01</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ENOUTPUTCOLORFORMATS</name>
                <description>When set to 0, the following output color formats are enabled</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>POS04LEN01</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EXTRADPICOLORFORMATS</name>
                <description>Display data format</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>RGBOUTORYUVOUT</name>
                <description>* 1: YUV/YCbCr format is enabled</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>POS10LEN01</name>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>DPICLKEQUALSFORMATCLK</name>
                <description>When set to 1, DPI_PCLK is equal to format_clk</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DPICOLORFORMATS</name>
                <description>DPI output color formats</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>POS15LEN02</name>
                <lsb>15</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>SINGLEFRAME</name>
                <description>When set to 1, single frame update is enabled</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>BUFFERMECH</name>
                <description>When set to 1, a buffer mechanism is enable that waits for the internal</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>FORCEBLANK</name>
                <description>When set to 1, forces output to blank</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>GLBGAMMAEN</name>
                <description>When set to 1, global gamma correction is enabled</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>POS21LEN02</name>
                <lsb>21</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>SINGLEVSYNC</name>
                <description>When set to 1, VSYNC for a single cycle per line is enabled</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DITHER</name>
                <description>Defines the dithering mode</description>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>DEPOL</name>
                <description>Defines DE polarity</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>HSYNCPOL</name>
                <description>Defines HSYNC polarity</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>VSYNCPOL</name>
                <description>Defines VSYNC polarity</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>POS29LEN01</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CURSOREN</name>
                <description>When set to 1, cursor is enabled</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>EN</name>
                <description>When set to 1, the NemaDC controller is activated</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKCTRL</name>
            <description>Setup proper timing with divider control bits</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000401</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PRIDIV</name>
                <description>Value of primary clock divider</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>POS07LEN01</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PREFETCH</name>
                <description>Number of lines to be prefetched before starting the</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>POS14LEN02</name>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PLLSLCT</name>
                <description>Select PLL Clock. Drives the pll_sw pins</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN01</name>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>OPTDIV</name>
                <description>Value of predivider</description>
                <lsb>25</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BGCOLOR</name>
            <description>Specifies the main background color.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as background color</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as background color</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as background color</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as background color</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESXY</name>
            <description>Specifies the main X and Y resolutions.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESY</name>
                <description>Value of Y resolution in pixels</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RESX</name>
                <description>Value of X resolution in pixels</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PLAY</name>
            <description>Write any value to this register at the end of the programming sequence to trigger the NemaDC.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PLAY</name>
                <description>Trigger the frame generation process</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRONTPORCHXY</name>
            <description>Specifies the X and Y dimensions for the Front Porch.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRONTPORCHY</name>
                <description>Specify the number of lines for the front porch Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FRONTPORCHX</name>
                <description>Specify the pixel clock cycles for the front porch X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BLANKINGXY</name>
            <description>Specifies the X and Y dimensions for the Blanking Period.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLANKINGY</name>
                <description>Specify the VSYNC lines for the Y dimension blanking period</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BLANKINGX</name>
                <description>Specify the HSYNC pulse length for the X dimension blanking period</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BACKPORCHXY</name>
            <description>Specifies the X and Y dimensions for the Back Porch.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BACKPORCHY</name>
                <description>Specify the number of lines for the front porch Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BACKPORCHX</name>
                <description>Specify the pixel clock cycles for the back porch X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURSORXY</name>
            <description>Specifies the cursor's start X and Y coordinates.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURSORY</name>
                <description>Specify cursor's Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CURSORX</name>
                <description>Specify cursor's X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTXY</name>
            <description>Specifies the start position of the very first frame.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTY</name>
                <description>Specify frames's Y dimension</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STARTX</name>
                <description>Specify frames's X dimension</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTERFACECFG</name>
            <description>Register for the configuration DBI Type-B interface</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORFOTMAT</name>
                <description>Set the color format for DBI Type-B/SPI interfaces:</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>COLORFORMATOPTION</name>
                <description>Set the data order of the 8-bit data word:</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>INTERFACEWIDTH</name>
                <description>Set DBI Type-B interface width (8, 9 or 16 bits) and</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>SPIMODE</name>
                <description>Set mode of operation SPI/DualSPI/QuadSPI/QuadSPI DDR</description>
                <lsb>9</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>DSPISUBPIX</name>
                <description>When set to 1, Enables DualSPI sub-pixel transaction</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>HORBLANKING</name>
                <description>When set to 1, enables the horizontal blanking</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>EXTRNCTRL</name>
                <description>When set to 1, enables the external control.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>DBIBCLKASPIXCLK</name>
                <description>When set to 1, expose pixel generation pipeline clock (pixel_clk) on the DBIB_CLK</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>HORADDR</name>
                <description>When set to 1, two-byte address is sent with each horizontal line (SPI)</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HORADDRINVERTION</name>
                <description>When set to 1, inverts the bit-order of the horizontal line address</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>HOLDCMDPARAMS</name>
                <description>When set to 1, it holds the commands/parameters and transmit them</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>DBIBVALID</name>
                <description>When set to 1 and a DBIB read operation is performed then it is necessary</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>SPICPOL</name>
                <description>Sets SPI Clock Polarity</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>SPICPHASE</name>
                <description>Sets SPI Clock Phase</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>ENDBIBBACKPRESSURE</name>
                <description>When set to 1, enables back-pressure for DBI Type-B</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>SPI3SPI4</name>
                <description>Set the SPI 3-wire or 4-wire mode:</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>INVERTPIXORDER</name>
                <description>Invert Pixel Order</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>RSTSIGNAL</name>
                <description>Drives DBIB_RESX output signal of DBI Type-B interface</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>IFFIFOCLR</name>
                <description>When set to 1, it clears the data FIFO and the command FIFO</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SPISD1ASSPIDC</name>
                <description>When set to 1, enables the usage of SPI_DC wire as SPI_SD1</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>ENABLETE</name>
                <description>When set to 1, the INTERFACE_TE signal is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>SWCTRLCSVALUE</name>
                <description>Sets the value of DBIB_CSX or SPI_CS signal:</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>SWCTRLCS</name>
                <description>When set to 1, the value of the CSX signal of the DBI Type-B/SPI interfaces</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>ENINTERFACES</name>
                <description>When set to 1, the DBI Type-B/SPI interfaces are activated</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
