ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>INTERRUPT</name>
            <description>Interrupt register</description>
            <addressOffset>0x0F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VSYNCINTER</name>
                <description>When set to 1, VSYNC interrupt enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>HSYNCINTER</name>
                <description>When set to 1, HSYNC interrupt enabled</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TETRIG</name>
                <description>TE interrupt trigger control</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TEINTER</name>
                <description>When set to 1, TE interrupt enabled</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FRAMEENDINTER</name>
                <description>When set to 1, signals an interrupt on Frame End</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>SPIFRAMEENDINTER</name>
                <description>When set to 1, signals an interrupt when SPI interfaces</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SPICMDINTER</name>
                <description>When set to 1, signals an interrupt when SPI interfaces</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>POS07LEN23</name>
                <lsb>7</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>IRQ</name>
                <description>Indicates IRQ is underway</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INTERTRIG</name>
                <description>Interrupt request trigger control</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>On read, returns NemaDC's status.</description>
            <addressOffset>0x0FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VSYNC</name>
                <description>Indicates that the controller is not in active vertical blanking</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATAEN</name>
                <description>Indicates the DE signal status (0 or 1) at the current time of reading</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HSYNC</name>
                <description>Indicates the HSYNC signal status (0 or 1) at the current time of reading</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>VSYNCORTE</name>
                <description>Indicates the VSYNC signal status and the tearing effect signal</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CSYNC</name>
                <description>Indicates the CSYNC signal status (0 or 1) at the current time of reading</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS05LEN01</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>UNDERFLOW</name>
                <description>Indicates current underflow</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>UNDERFLOWSTICKYBIT</name>
                <description>Indicates sticky underflow. This bit clears when status register is written</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TE</name>
                <description>Indicates DBI Type-B/SPI tearing effect</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS09LEN01</name>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PENDINGPIXEL</name>
                <description>Indicates pending RGB data in DBI Type-B/SPI interfaces</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PENDINGCMD</name>
                <description>Indicates pending commands in DBI Type-B/SPI interfaces</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PENDINGTRANSACTION</name>
                <description>Indicates pending output transaction in DBI Type-B/SPI interfaces</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FRAMEEND</name>
                <description>Indicates Frame end</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CHIPSELECT</name>
                <description>Indicates DBI/SPI CS status</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMDFIFOACK</name>
                <description>Indicates the DBI/SPI Command fifo ack</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SPIRDWR</name>
                <description>Indicates read/write operation on SPI</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CRCREADY</name>
                <description>Indicates CRC Register read ready</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GPISTACK</name>
                <description>Indicates GPI got stack durring packet transaction</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS19LEN13</name>
                <lsb>19</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COLMOD</name>
            <description>Color mode status register.</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x28060000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS00LEN17</name>
                <lsb>0</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TSC4</name>
                <description>High value indicates that TSC4 is enabled</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TSC6</name>
                <description>High value indicate that TSC6 is enabled</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIBEXTRNCTRL</name>
                <description>High value indicate that DBIB external control is enabled</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS20LEN03</name>
                <lsb>20</lsb>
                <msb>22</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER0FLIPX</name>
                <description>High value indicate that FlipX is equiped for Layer 0</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER1FLIPX</name>
                <description>High value indicate that FlipX is equiped for Layer 1</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER2FLIPX</name>
                <description>High value indicate that FlipX is equiped for Layer 2</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LAYER3FLIPX</name>
                <description>High value indicate that FlipX is equiped for Layer 3</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FLIPY</name>
                <description>High value indicate that FlipY is equiped</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS28LEN01</name>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MIP</name>
                <description>High value indicate that NemaDC is equiped with MiP-Parallel interface</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>POS30LEN02</name>
                <lsb>30</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0COLORDECSTARTXY</name>
            <description>X and Y start dimensions of colordec in layer 0</description>
            <addressOffset>0x104</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORDECSTARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of colordec in layer 0.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>COLORDECSTARTX</name>
                <description>Specify the pixel offset of the starting X dimension of colordec in layer 0.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1COLORDECSTARTXY</name>
            <description>X and Y start dimensions of colordec in layer 1</description>
            <addressOffset>0x108</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORDECSTARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of colordec in layer 1.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>COLORDECSTARTX</name>
                <description>Specify the pixel offset of the starting X dimension of colordec in layer 1.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2COLORDECSTARTXY</name>
            <description>X and Y start dimensions of colordec in layer 2</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORDECSTARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of colordec in layer 2.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>COLORDECSTARTX</name>
                <description>Specify the pixel offset of the starting X dimension of colordec in layer 2.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3COLORDECSTARTXY</name>
            <description>X and Y start dimensions of colordec in layer 3</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORDECSTARTY</name>
                <description>Specify the pixel offset of the starting Y dimension of colordec in layer 3.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>COLORDECSTARTX</name>
                <description>Specify the pixel offset of the starting X dimension of colordec in layer 3.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER0COLORFORMAT</name>
            <description>Specify the color format of layer 0</description>
            <addressOffset>0x114</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORMODE</name>
                <description>Color mode for layer 0.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>POS6LEN26</name>
                <lsb>6</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER1COLORFORMAT</name>
            <description>Specify the color format of layer 1</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORMODE</name>
                <description>Color mode for layer 1.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>POS6LEN26</name>
                <lsb>6</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER2COLORFORMAT</name>
            <description>Specify the color format of layer 2</description>
            <addressOffset>0x11C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORMODE</name>
                <description>Color mode for layer 2.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>POS6LEN26</name>
                <lsb>6</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYER3COLORFORMAT</name>
            <description>Specify the color format of layer 3</description>
            <addressOffset>0x120</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COLORMODE</name>
                <description>Color mode for layer 3.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>POS6LEN26</name>
                <lsb>6</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LAYERPARTIAL</name>
            <description>MiP partial and full frame update register, used by layers.</description>
            <addressOffset>0x130</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LAYERPARTIALSTART</name>
                <description>Indicates the first visible row of the layer for the given partial or full frame region.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LAYERPARTIALEND</name>
                <description>Indicates the last visible row of the layer for the given partial or full frame region.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN6</name>
                <lsb>24</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>LAYERSELECTION</name>
                <description>Indicates the layer that the partial or full frame region belongs to.</description>
                <lsb>30</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIPCFG1</name>
            <description>MiP partial and full frame update configuration register, used by MiP-Parallel interface.</description>
            <addressOffset>0x134</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HCKBCKSTART</name>
                <description>Indicates the HCK/BCK count that the MiP-Parallel interface</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>POS10LEN14</name>
                <lsb>10</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>VCKCGKFFWD</name>
                <description>Indicates the VCK/GCK (high/low) width of a fast forward transaction</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIPCFG2</name>
            <description>MiP partial and full frame update configuration register, used by MiP-Parallel interface.</description>
            <addressOffset>0x138</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LASTVCKGCKPOINT</name>
                <description>Indicates the last VCK/GCK count with valid data.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>VCKGCKWIDTH</name>
                <description>Indicates the VCK/GCK (high/low) width during a normal transaction.</description>
                <lsb>12</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>POS22LEN2</name>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>VCKGCKOFFSET</name>
                <description>Indicates the VCK/GCK offset.</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIPCFG3</name>
            <description>MiP partial and full frame update configuration register, used by MiP-Parallel interface.</description>
            <addressOffset>0x13C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POS0LEN10</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>VCKGCKLASTCYCLES</name>
                <description>Indicates the number of the last VCK/GCK counts that are transmitted</description>
                <lsb>10</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>VCKGCKIDLECYCLES</name>
                <description>Indicates the VCK/GCK idle counts before the transmission of valid data.</description>
                <lsb>15</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>POS20LEN10</name>
                <lsb>20</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FIFOANDREGSRESET</name>
                <description>When set to 1, it resets all the MiP-Parallel interface fifos and registers. Layers must be active.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>ENPARTIALUPDATE</name>
                <description>Enables partial update in MiP-Parallel interface.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
