ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>GAMMALUT0102</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1198</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0103</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x119C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0104</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0105</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0106</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0107</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0108</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0109</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0110</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0111</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0112</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0113</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0114</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0115</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0116</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT0117</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x11D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
