ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RPUMAC</name>
      <description>WIFICore RPU MAC peripherals</description>
      <baseAddress>0x48080000</baseAddress>
      <headerStructName>WIFIMAC</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>WIFIMAC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>CRYPTO_PERIP</name>
          <description>Unspecified</description>
          <headerStructName>WIFIMAC_CRYPTO_PERIP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x02000</addressOffset>
          <register>
            <name>MODE</name>
            <description>CRYPTO PERIP MODE</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRYPTOMODE</name>
                <description>Crypto mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RxModeInputIsFromMa</name>
                    <description>RX mode. Input is from MAC controller and output to EDC.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TxModeInputFromEdcA</name>
                    <description>TX mode. Input from EDC and output from MAC controller.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL0</name>
            <description>CRYPTO PERIP CONTROL 0</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PULSEDSOFTRESET</name>
                <description>Self-clearing Crypto core soft reset.This bit is used to reset everything but the control registers.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DeAssertResetToCore</name>
                    <description>De-assert reset to core</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AssertResetToCore</name>
                    <description>Assert reset to core</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LATCHEDSOFTRESET</name>
                <description>Latched Crypto core soft reset.This bit is used to reset everything but the control registers.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DeAssertResetToCore</name>
                    <description>De-assert reset to core</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AssertResetToCore</name>
                    <description>Assert reset to core</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRYPTODONEENABLE</name>
                <description>Enable EFS event CRYPTO_DONE_EVENT that indicates when the Crypto operation is complete.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableCryptoDoneE</name>
                    <description>Disable CRYPTO_DONE_EVENT</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableCryptoDoneEv</name>
                    <description>Enable CRYPTO_DONE_EVENT</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TSFTIMERINDEX</name>
                <description>64 bit timer index of hardware module. There are four 64 bit timers in and one of index is picked up for this.</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL1</name>
            <description>CRYPTO PERIP CONTROL 1</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCMPREQ</name>
                <description>CCMP operation</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TKIPREQ</name>
                <description>TKIP operation</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TKIPMICREQ</name>
                <description>TKIP Message Integrity Check (MIC) operation</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WEPREQ</name>
                <description>WEP operation</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WEP40EN</name>
                <description>WEP 40 operation</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>GCMPREQ</name>
                <description>GCMP operation</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>AES256</name>
                <description>Select AES key size.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>128Bits</name>
                    <description>128-bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256Bits</name>
                    <description>256-bits</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WPIREQ</name>
                <description>WAPI operation</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UPDATETSF</name>
                <description>Set to 1 if HW is expected to modify TSF field in memcopy bytes. HW need read TSF value, compensate with COMP value and update in TSF field.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>SPPAMSDU</name>
                <description>Default value is zero, Set to 1 if SPP_A-MSDU_bit_setis requested by the receiver.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PMBTSFCOMP</name>
            <description>PMB CRYPTO PERIP TSF COMP</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TSFOFFSET</name>
                <description>TSF offset in memcopy stream.Must be set to a value greater than 1.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TSFCOMP</name>
                <description>Hw will add this value to TSF snapshot and update TSF value in probe response/beacon frame.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXCONTROL</name>
            <description>CRYPTO PERIP RX CONTROL</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXUNICASTDATAPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RXUNICASTMGMTPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RXBCSTDATAPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RXBCSTMGMTPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXVECTORLENGTH</name>
            <description>CRYPTO PERIP RX VECTOR LENGTH</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXVECTORLENGTH</name>
                <description>RX vector length. Crypto hardware should bypass (memcopy) to output side without processing.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXFCSANDSTSLENGTH</name>
            <description>CRYPTO PERIP RX FCS AND STS LENGTH</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXFCSANDSTSLENGTH</name>
                <description>Used to determine how many bytes need to be appended after decrypted payload.Note: When it's configured as 0, after payload bytes decrypted, controlstate machine will skip STEP_APPEND, do not appending any bytes.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXCONTROL</name>
            <description>CRYPTO PERIP TX CONTROL</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXUNICASTDATAPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TXUNICASTMGMTPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TXBCSTDATAPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TXBCSTMGMTPROTECTION</name>
                <description>Set 1 to enable.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXVECTORLENGTH</name>
            <description>CRYPTO PERIP TX VECTOR LENGTH</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXVECTORLENGTH</name>
                <description>Valid range 0 to 255. Crypto hardware should bypass to output without processing.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXAMPDUSUBFRAMENUMBER</name>
            <description>CRYPTO PERIP TX AMPDU SUBFRAME NUMBER</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXAMPDUSUBFRAMENUMBER</name>
                <description>Number of AMPDU subframes in current TX job.Minimum value is 1. Maximum value is 64.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INPUTFIFO</name>
            <description>CRYPTO PERIP INPUT FIFO</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INPUTFIFODEPTH</name>
                <description>Programmable FIFO depth.Note that DEPTH=0 will bypass the FIFO.Values of DEPTH greater than the physical FIFO depth will be saturated by hardware to the physical depth.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>INPUTFIFORESET</name>
                <description>Self-clearing input FIFO reset</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PerformReset</name>
                    <description>Perform reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTPUTFIFO</name>
            <description>CRYPTO PERIP OUTPUT FIFO</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTPUTFIFODEPTH</name>
                <description>Programmable FIFO depth.Note that DEPTH=0 will bypass the FIFO.Values of DEPTH greater than the physical FIFO depth will be saturated by hardware to the physical depth.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OUTPUTFIFORESET</name>
                <description>Self-clearing output FIFO reset</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PerformReset</name>
                    <description>Perform reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INPUTFIFOCOUNT</name>
            <description>CRYPTO PERIP INPUT FIFO COUNT</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INPUTFIFOCOUNT</name>
                <description>Input FIFO data count.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTPUTFIFOCOUNT</name>
            <description>CRYPTO PERIP OUTPUT FIFO COUNT</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTPUTFIFOCOUNT</name>
                <description>Output FIFO data count.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTSTATUS</name>
            <description>CRYPTO PERIP EVENT STATUS</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRYPTODONEEVENT</name>
                <description>This bit is set to 1 when the Crypto operation is complete.Writing 1 sets this bit for test purposes.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTCLEAR</name>
            <description>CRYPTO PERIP EVENT CLEAR</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRYPTODONECLEAR</name>
                <description>Writing 1 to this bit sets CRYPTO_DONE and CRYPTO_DONE_EVENT to 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERROR</name>
            <description>CRYPTO PERIP ERROR</description>
            <addressOffset>0x48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORRXAMPDULENGTH</name>
                <description>Received rx_ampdu_length is larger than 0xFFFF. Crypto will push valid=1 mask=1 eop=1 data=0 byte into the output, discard remaining inputs until sync flag received then start new job.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRORWRITESYNCEARLY</name>
                <description>TBus write sync flag appears earlier than expected. Crypto will terminate current engine job if started, push valid=1 mask=1 eop=1 data=0 byte into the output, discard remaining inputs until sync flag received then start new job.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRORWRITESYNCLATE</name>
                <description>TBus write sync flag appears later than expected. Crypto will set eop=1 on the last valid output byte, discard remaining inputs until sync flag received then start new job.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRORPAYLOADLENGTH</name>
                <description>Received payload length is less than 0. Crypto will push valid=1 mask=1 eop=1 data=0 byte into the output, discard remaining inputs until sync flag received then start new job.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORCLEAR</name>
            <description>CRYPTO PERIP ERROR CLEAR</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRYPTOPERIPERRORCLEAR</name>
                <description>Writing 1 to this bit sets CRYPTO_PERIP_ERROR to 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
