ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>STATUS</name>
            <description>CRYPTO PERIP STATUS</description>
            <addressOffset>0x50</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRYPTODONE</name>
                <description>Crypto operation done status. Writing CRYPTO_DONE_CLEAR=1 clears this status.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CryptoOperationNotCo</name>
                    <description>Crypto operation not complete.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CryptoOperationCompl</name>
                    <description>Crypto operation complete.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ICVSTATUS</name>
                <description>WEP ICV status</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IcvSuccess</name>
                    <description>ICV success</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IcvFail</name>
                    <description>ICV fail</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MICSTATUS</name>
                <description>TKIP/CCMP/WAPI MIC status</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MicSuccess</name>
                    <description>MIC success</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MicFail</name>
                    <description>MIC fail</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AADBLOCKS</name>
            <description>CRYPTO PERIP AAD BLOCKS</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADBLOCKS</name>
                <description>Number of valid AAD blocks:</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2AadBlocks</name>
                    <description>2 AAD blocks</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3AadBlocksOnlyUsedB</name>
                    <description>3 AAD blocks (Only used by WAPI and GCMP operation)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD10</name>
            <description>CRYPTO PERIP AAD1 0</description>
            <addressOffset>0x60</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK10</name>
                <description>Bytes 2:0 of AAD block 1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD11</name>
            <description>CRYPTO PERIP AAD1 1</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK11</name>
                <description>Bytes 5:3 of AAD block 1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD12</name>
            <description>CRYPTO PERIP AAD1 2</description>
            <addressOffset>0x68</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK12</name>
                <description>Bytes 8:6 of AAD block 1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD13</name>
            <description>CRYPTO PERIP AAD1 3</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK13</name>
                <description>Bytes 11:9 of AAD block 1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD14</name>
            <description>CRYPTO PERIP AAD1 4</description>
            <addressOffset>0x70</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK14</name>
                <description>Bytes 14:12 of AAD block 1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD15</name>
            <description>CRYPTO PERIP AAD1 5</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK15</name>
                <description>Byte 15 of AAD block 1.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD20</name>
            <description>CRYPTO PERIP AAD2 0</description>
            <addressOffset>0x78</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK20</name>
                <description>Bytes 2:0 of AAD block 2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD21</name>
            <description>CRYPTO PERIP AAD2 1</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK21</name>
                <description>Bytes 5:3 of AAD block 2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD22</name>
            <description>CRYPTO PERIP AAD2 2</description>
            <addressOffset>0x80</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK22</name>
                <description>Bytes 8:6 of AAD block 2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD23</name>
            <description>CRYPTO PERIP AAD2 3</description>
            <addressOffset>0x84</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK23</name>
                <description>Bytes 11:9 of AAD block 2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD24</name>
            <description>CRYPTO PERIP AAD2 4</description>
            <addressOffset>0x88</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK24</name>
                <description>Bytes 14:12 of AAD block 2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD25</name>
            <description>CRYPTO PERIP AAD2 5</description>
            <addressOffset>0x8C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK25</name>
                <description>Byte 15 of AAD block 2.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD30</name>
            <description>CRYPTO PERIP AAD3 0</description>
            <addressOffset>0x90</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK30</name>
                <description>Bytes 2:0 of AAD block 3.Used only for WAPI operation.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD31</name>
            <description>CRYPTO PERIP AAD3 1</description>
            <addressOffset>0x94</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK31</name>
                <description>Bytes 5:3 of AAD block 3.Used only for WAPI operation.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD32</name>
            <description>CRYPTO PERIP AAD3 2</description>
            <addressOffset>0x98</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK32</name>
                <description>Bytes 8:6 of AAD block 3.Used only for WAPI operation.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD33</name>
            <description>CRYPTO PERIP AAD3 3</description>
            <addressOffset>0x9C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK33</name>
                <description>Bytes 11:9 of AAD block 3.Used only for WAPI operation.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD34</name>
            <description>CRYPTO PERIP AAD3 4</description>
            <addressOffset>0xA0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK34</name>
                <description>Bytes 14:12 of AAD block 3.Used only for WAPI operation.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AAD35</name>
            <description>CRYPTO PERIP AAD3 5</description>
            <addressOffset>0xA4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AADATABLOCK35</name>
                <description>Byte 15 of AAD block 3.Used only for WAPI operation.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE0</name>
            <description>CRYPTO PERIP NONCE 0</description>
            <addressOffset>0xA8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCEVALUE0</name>
                <description>Bytes 2:0 of the nonce value.For WAPI operation the entire 16 bytes are considered as the nonce value.For CCMP operation the lower 13 bytes are considered as the nonce value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE1</name>
            <description>CRYPTO PERIP NONCE 1</description>
            <addressOffset>0xAC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCEVALUE1</name>
                <description>Bytes 5:3 of the nonce value.For WAPI operation the entire 16 bytes are considered as the nonce value.For CCMP operation the lower 13 bytes are considered as the nonce value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE2</name>
            <description>CRYPTO PERIP NONCE 2</description>
            <addressOffset>0xB0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCEVALUE2</name>
                <description>Bytes 8:6 of the nonce value.For WAPI operation the entire 16 bytes are considered as the nonce value.For CCMP operation the lower 13 bytes are considered as the nonce value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE3</name>
            <description>CRYPTO PERIP NONCE 3</description>
            <addressOffset>0xB4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCEVALUE3</name>
                <description>Bytes 11:9 of the nonce value.For WAPI operation the entire 16 bytes are considered as the nonce value.For CCMP operation the lower 13 bytes are considered as the nonce value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE4</name>
            <description>CRYPTO PERIP NONCE 4</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCEVALUE4</name>
                <description>Bytes 14:12 of the nonce value.For WAPI operation the entire 16 bytes are considered as the nonce value.For CCMP operation the lower 13 bytes are considered as the nonce value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE5</name>
            <description>CRYPTO PERIP NONCE 5</description>
            <addressOffset>0xBC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCEVALUE5</name>
                <description>Byte 15 of the nonce value.For WAPI operation the entire 16 bytes are considered as the nonce value.For CCMP operation the lower 13 bytes are considered as the nonce value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHE</name>
            <description>CRYPTO PERIP DB CACHE</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEVALID</name>
                <description>Cache valid. 1: Cache is valid. 0: Cache is invalid.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DBCACHEPF</name>
                <description>Protected frame.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>DBCACHEGF</name>
                <description>Grp_frm.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DBCACHECS</name>
                <description>Cipher suite</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DBCACHEKI</name>
                <description>Key ID</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHEADDR10</name>
            <description>CRYPTO PERIP DB CACHE ADDR1 0</description>
            <addressOffset>0xC4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEADDR10</name>
                <description>Bytes 2:0 of Addr1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHEADDR11</name>
            <description>CRYPTO PERIP DB CACHE ADDR1 1</description>
            <addressOffset>0xC8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEADDR11</name>
                <description>Bytes 5:3 of Addr1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHEADDR20</name>
            <description>CRYPTO PERIP DB CACHE ADDR2 0</description>
            <addressOffset>0xCC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEADDR20</name>
                <description>Bytes 2:0 of Addr2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHEADDR21</name>
            <description>CRYPTO PERIP DB CACHE ADDR2 1</description>
            <addressOffset>0xD0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEADDR21</name>
                <description>Bytes 5:3 of Addr2.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHEBSSID0</name>
            <description>CRYPTO PERIP DB CACHE BSSID 0</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEBSSID0</name>
                <description>Bytes 2:0 of BSSID.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DBCACHEBSSID1</name>
            <description>CRYPTO PERIP DB CACHE BSSID 1</description>
            <addressOffset>0xD8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEBSSID1</name>
                <description>Bytes 5:3 of BSSID.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
