ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>DBCACHEENABLE</name>
            <description>CRYPTO PERIP DB CACHE ENABLE</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBCACHEENABLE</name>
                <description>Key search cache enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableCacheCryptoW</name>
                    <description>Disable cache. Crypto will search new keys for each subframe.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableCacheCryptoWi</name>
                    <description>Enable cache. Crypto will use cached keys if search condition unchanged.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC0</name>
            <description>CRYPTO PERIP MIC 0</description>
            <addressOffset>0xE0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TKIPCALCMICVAL0</name>
                <description>Bytes 2:0 of the calculated Message Integrity Check (MIC) Bytes 2:0</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC1</name>
            <description>CRYPTO PERIP MIC 1</description>
            <addressOffset>0xE4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TKIPCALCMICVAL1</name>
                <description>Bytes 5:3 of the calculated Message Integrity Check (MIC) Bytes 5:3</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC2</name>
            <description>CRYPTO PERIP MIC 2</description>
            <addressOffset>0xE8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TKIPCALCMICVAL2</name>
                <description>Bytes 7:6 of the calculated Message Integrity Check (MIC) Bytes 7:6</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDMODE</name>
            <description>CRYPTO PERIP TBUS RD MODE</description>
            <addressOffset>0xF0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TBUSDEBUGRDDISCARD</name>
                <description>Discard PBus debug mode output (TBUS_DEBUG_RD_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>64</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>CRYPTOTXAMPDUSUBFRAMEPARAMS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIMAC_CRYPTO_PERIP_CRYPTOTXAMPDUSUBFRAMEPARAMS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>TXCONTROLDURATION</name>
              <description>Description cluster: TX CONTROL DURATION</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXCONTROLFCF</name>
                  <description>Set to 1 to update FCF</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>TXCONTROLDURATION</name>
                  <description>Set to 1 to update Duration</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                </field>
                <field>
                  <name>TXCONTROLMACHEADER</name>
                  <description>Set to 1 to populate TSF in mac header</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                </field>
                <field>
                  <name>TXCONTROLTXSPPAMSDU</name>
                  <description>TX_SPP_A_MSDU</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>TXCONTROLFRAMEFORMAT</name>
                  <description>Frame format</description>
                  <lsb>4</lsb>
                  <msb>6</msb>
                </field>
                <field>
                  <name>TXCONTROLENCRYPT</name>
                  <description>Encrypt enable</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>TXDURATION</name>
                  <description>Replace duration field of MAC header with this configuration.</description>
                  <lsb>8</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>TXFCFAMPDULENGTH</name>
              <description>Description cluster: TX FCF AMPDU LENGTH</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXFCF</name>
                  <description>This is used to set some bits in frame control field by hardware (retry bit).Hardware should do bitwise 'OR' operation on first byte of MAC header.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>TXAMPDULENGTH</name>
                  <description>AMPDU subframe length. Includes MAC header, security header and payload.Security tail bytes are not included in this length.</description>
                  <lsb>8</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x01C</dimIncrement>
            <name>CRYPTOVIFKEYDB[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIMAC_CRYPTO_PERIP_CRYPTOVIFKEYDB</headerStructName>
            <access>read-write</access>
            <addressOffset>0x300</addressOffset>
            <register>
              <name>VIFDBVALID</name>
              <description>Description cluster: VIF DB VALID</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFDBVALID</name>
                  <description>DB is valid when set.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>VIFBSSID0</name>
              <description>Description cluster: VIF BSSID 0</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFBSSID0</name>
                  <description>VIF connected BSSID[23:0].Note: Value is valid only when VIF_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>VIFBSSID1</name>
              <description>Description cluster: VIF BSSID 1</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFBSSID1</name>
                  <description>VIF connected BSSID[47:24].Note: Value is valid only when VIF_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>VIFADDR0</name>
              <description>Description cluster: VIF ADDR 0</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFADDR0</name>
                  <description>Virtual interface MAC address[23:0].Note: Value is valid only when VIF_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>VIFADDR1</name>
              <description>Description cluster: VIF ADDR 1</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFADDR1</name>
                  <description>Virtual interface MAC address[47:24].Note: Value is valid only when VIF_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>VIFKEYVALID</name>
              <description>Description cluster: VIF KEY VALID</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFKEYVALID</name>
                  <description>Bit[0]: Key 0 ValidBit[1]: Key 1 ValidBit[2]: Key 2 ValidBit[3]: Key 3 ValidNote: Value is valid only when VIF_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>VIFCIPHERSUITE</name>
              <description>Description cluster: VIF CIPHER SUITE</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VIFCIPHERSUITE</name>
                  <description>0: Plain1: WEP 402: WEP 1043: TKIP Only4: TKIP and MIC5: CCMP_1286: CCMP_2567: GCMP_1288: GCMP_2569: WAPINote: Value is valid only when VIF_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>8</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>CRYPTOPEERKEYDB[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIMAC_CRYPTO_PERIP_CRYPTOPEERKEYDB</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <register>
              <name>PEERDBVALID</name>
              <description>Description cluster: PEER DB VALID</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PEERDBVALID</name>
                  <description>DB is valid when set.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PEERADDR0</name>
              <description>Description cluster: PEER ADDR 0</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PEERADDR0</name>
                  <description>Peer MAC address[23:0].Note: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PEERADDR1</name>
              <description>Description cluster: PEER ADDR 1</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PEERADDR1</name>
                  <description>Peer MAC address[47:24].Note: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PEERVIFADDR0</name>
              <description>Description cluster: PEER VIF ADDR 0</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PEERVIFADDR0</name>
                  <description>Virtual interface MAC address[23:0].Note: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PEERVIFADDR1</name>
              <description>Description cluster: PEER VIF ADDR 1</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PEERVIFADDR1</name>
                  <description>Virtual interface MAC address[47:24].Note: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PEERKEYVALID</name>
              <description>Description cluster: PEER KEY VALID</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PEERKEYVALID</name>
                  <description>Bit[0]: Unicast Key validBit[1]: Broadcast Key validNote: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>UCSTCIPHERSUITE</name>
              <description>Description cluster: UCST CIPHER SUITE</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>UCSTCIPHERSUITE</name>
                  <description>0: Plain1: WEP 402: WEP 1043: TKIP Only4: TKIP and MIC5: CCMP_1286: CCMP_2567: GCMP_1288: GCMP_2569: WAPINote: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>BCSTCIPHERSUITE</name>
              <description>Description cluster: BCST CIPHER SUITE</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BCSTCIPHERSUITE</name>
                  <description>0: Plain1: WEP 402: WEP 1043: TKIP Only4: TKIP and MIC5: CCMP_1286: CCMP_2567: GCMP_1288: GCMP_2569: WAPINote: Value is valid only when PEER_DB_VALID is set.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>WLAN_MAC_CTRL</name>
          <description>Unspecified</description>
          <headerStructName>WIFIMAC_WLAN_MAC_CTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x04000</addressOffset>
          <register>
            <name>PULSEDSOFTWARERESET</name>
            <description>WLAN MAC CTRL PULSED SOFTWARE RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLPULSEDSOFTWARERESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LATCHEDSOFTWARERESET</name>
            <description>WLAN MAC CTRL LATCHED SOFTWARE RESET</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLLATCHEDSOFTWARERESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGENABLE</name>
            <description>WLAN MAC CTRL DEBUG ENABLE</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGENABLE</name>
                <description>Override TX_ABORT, EDCA_EVENT, EDCA_EVENT_STATUS, TX_END, TX_END_STATUS and PRIMARY_CCA using debug registers</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGENABLEPHYONLY</name>
                <description>Override TX_ABORT, TX_END, TX_END_STATUS and PRIMARY_CCA using debug registers</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGWLANTXABORT</name>
            <description>WLAN MAC CTRL DEBUG WLAN TX ABORT</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGWLANTXABORT</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGEDCAEVENT</name>
            <description>WLAN MAC CTRL DEBUG EDCA EVENT</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGEDCAEVENT</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGEDCAEVENTSTATUS</name>
            <description>WLAN MAC CTRL DEBUG EDCA EVENT STATUS</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGEDCAEVENTSTATUS</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGTXEND</name>
            <description>WLAN MAC CTRL DEBUG TX END</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGTXEND</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGTXENDSTATUS</name>
            <description>WLAN MAC CTRL DEBUG TX END STATUS</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGTXENDSTATUS</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
