ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>DEBUGPRIMARYCCA</name>
            <description>WLAN MAC CTRL DEBUG PRIMARY CCA</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGPRIMARYCCA</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGBASICNAVBUSY</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IGNOREDEAGGWRSYNC</name>
            <description>WLAN MAC CTRL IGNORE DEAGG WR SYNC</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLIGNOREDEAGGWRSYNC</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FSMSTATE</name>
            <description>WLAN MAC CTRL FSM STATE</description>
            <addressOffset>0x28</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLFSMSTATE</name>
                <description>MAC Controller FSM State:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rx</name>
                    <description>RX</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Tx</name>
                    <description>TX</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Inactive</name>
                    <description>INACTIVE</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDDISCARD</name>
            <description>WLAN MAC CTRL TBUS RD DISCARD</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLTBUSRDAGGDISCARD</name>
                <description>Discard aggregation TBus read port:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTDiscard</name>
                    <description>Don't discard</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Discard</name>
                    <description>Discard</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMACCTRLTBUSRDDEAGGDISCARD</name>
                <description>Discard deaggregation TBus read port:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTDiscard</name>
                    <description>Don't discard</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Discard</name>
                    <description>Discard</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEACTIVATE</name>
            <description>WLAN MAC CTRL DEACTIVATE</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEACTIVATE</name>
                <description>Deactivate MAC and disable the PHY:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTDeactivate</name>
                    <description>Don't deactivate</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DeactivateSafelyWhen</name>
                    <description>Deactivate safely when FSM state is IDLE</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DeactivateForcefully</name>
                    <description>Deactivate forcefully regardless of FSM state</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PTACONTROL</name>
            <description>WLAN MAC CTRL PTA CONTROL</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000280</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLPTACONTROLREG</name>
                <description>PTA control register:bit 0 : Enable AGG TX requestbit 1 : Enable DEAGG RX requestbit 2 : Enable PHY RX request</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANMACCTRLCLKFREQMHZ</name>
                <description>Clock frequency in MHz</description>
                <lsb>3</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PTAEXT</name>
            <description>WLAN MAC CTRL PTA EXT</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLTXSIGNALEXT</name>
                <description>Duration by which AGG_TX_REQUEST signal is extended in microseconds</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANMACCTRLRXSIGNALEXT</name>
                <description>Duration by which DEAGG_RX_REQUEST signal is extended in microseconds</description>
                <lsb>10</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>WLANMACCTRLPHYRXSIGNALEXT</name>
                <description>Duration by which PHY_RX_REQUEST signal is extended in microseconds</description>
                <lsb>15</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXABORTTIMEOUT</name>
            <description>WLAN MAC CTRL TX ABORT TIMEOUT</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLTXABORTTIMEOUT</name>
                <description>Ignore WLAN_TX_ABORT signal from PTA if asserted after this timeout, counter running at core clock.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBEAMFORMINGDMALENGTH</name>
            <description>WLAN MAC CTRL DEBUG BEAMFORMING DMA LENGTH</description>
            <addressOffset>0x40</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGBEAMFORMINGDMALENGTH</name>
                <description>Writing to this register triggers a beamforming DMA length update</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBEAMFORMINGSNR</name>
            <description>WLAN MAC CTRL DEBUG BEAMFORMING SNR</description>
            <addressOffset>0x44</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGBEAMFORMINGSNR</name>
                <description>Writing to this register triggers a beamforming SNR update</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGPTAARBITOR</name>
            <description>WLAN MAC CTRL DEBUG PTA ARBITOR</description>
            <addressOffset>0x48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGPTAARBITORWLANREQUEST</name>
                <description>Debug wlan_request output from pta_arbitor</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGPTAARBITORWLANTXRX</name>
                <description>Debug wlan_request output from pta_arbitor</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGPTAARBITORWLANPTI</name>
                <description>Debug wlan_request output from pta_arbitor</description>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGPTAARBITORPHYTXABORT</name>
                <description>Debug wlan_request output from pta_arbitor</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEX</name>
            <description>WLAN MAC CTRL COEX</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLCOEXENABLE</name>
                <description>Enable coexistence support</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMACCTRLCOEXTXMODE</name>
                <description>TX request applies to:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>5GhzOnly</name>
                    <description>5 GHz only</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>245Ghz</name>
                    <description>2.4 &amp;amp; 5 GHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMACCTRLCOEXPRIORITY</name>
                <description>Coexistence priority:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>WiFiHasPriority</name>
                    <description>Wi-Fi has priority</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BtHasPriority</name>
                    <description>BT has priority</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCOEXREQUEST</name>
            <description>WLAN MAC CTRL DEBUG COEX REQUEST</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGCOEXREQUESTFORCE</name>
                <description>Force coexistence request output with value WLAN_MAC_CTRL_DEBUG_COEX_REQUEST_VALUE[i]</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGCOEXREQUESTVALUE</name>
                <description>Force coexistence request output to this value when WLAN_MAC_CTRL_DEBUG_COEX_REQUEST_FORCE[i] is set</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCOEXGRANT</name>
            <description>WLAN MAC CTRL DEBUG COEX GRANT</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGCOEXGRANTFORCE</name>
                <description>Force coexistence grant input with value WLAN_MAC_CTRL_DEBUG_COEX_GRANT_VALUE[i]</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGCOEXGRANTVALUE</name>
                <description>Force coexistence grant input to this value when WLAN_MAC_CTRL_DEBUG_COEX_GRANT_FORCE[i] is set</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGCOEXGRANTOBSERVE</name>
                <description>Observe coexistence grant input</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGANTSWC</name>
            <description>WLAN MAC CTRL DEBUG ANTSWC</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCLNASWFORCE</name>
                <description>Force antenna switch controller LNA switch input with value WLAN_MAC_CTRL_DEBUG_ANTSWC_LNA_SW_VALUE</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCPAENFORCE</name>
                <description>Force antenna switch controller power amplifier enable input with value WLAN_MAC_CTRL_DEBUG_ANTSWC_PA_EN_VALUE</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCTXFORCE</name>
                <description>Force antenna switch controller TX input with value WLAN_MAC_CTRL_DEBUG_ANTSWC_TX_VALUE</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXFORCE</name>
                <description>Force antenna switch controller RX input with value WLAN_MAC_CTRL_DEBUG_ANTSWC_RX_VALUE</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXINHIBITFORCE</name>
                <description>Force antenna switch controller RX inhibit input with value WLAN_MAC_CTRL_DEBUG_ANTSWC_RX_INHIBIT_VALUE</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXHOLDFORCE</name>
                <description>Force antenna switch controller RX hold input with value WLAN_MAC_CTRL_DEBUG_ANTSWC_RX_HOLD_VALUE</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCLNASWVALUE</name>
                <description>Force antenna switch controller LNA switch input to this value when WLAN_MAC_CTRL_DEBUG_ANTSWC_LNA_SW_FORCE is set</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCPAENVALUE</name>
                <description>Force antenna switch controller power amplifier enable input to this value when WLAN_MAC_CTRL_DEBUG_ANTSWC_PA_EN_FORCE is set</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCTXVALUE</name>
                <description>Force antenna switch controller TX input to this value when WLAN_MAC_CTRL_DEBUG_ANTSWC_TX_FORCE is set</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXVALUE</name>
                <description>Force antenna switch controller RX input to this value when WLAN_MAC_CTRL_DEBUG_ANTSWC_RX_FORCE is set</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXINHIBITVALUE</name>
                <description>Force antenna switch controller RX inhibit input to this value when WLAN_MAC_CTRL_DEBUG_ANTSWC_RX_INHIBIT_FORCE is set</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXHOLDVALUE</name>
                <description>Force antenna switch controller RX hold input to this value when WLAN_MAC_CTRL_DEBUG_ANTSWC_RX_HOLD_FORCE is set</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCLNASWOBSERVE</name>
                <description>Observe antenna switch controller LNA switch input</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCPAENOBSERVE</name>
                <description>Observe antenna switch controller power amplifier enable input</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCTXOBSERVE</name>
                <description>Observe antenna switch controller TX input</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXOBSERVE</name>
                <description>Observe antenna switch controller RX input</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXINHIBITOBSERVE</name>
                <description>Observe antenna switch controller RX inhibit input</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEBUGANTSWCRXHOLDOBSERVE</name>
                <description>Observe antenna switch controller RX hold input</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_MAC_CTRL_DEAGG</name>
          <description>Unspecified</description>
          <headerStructName>WIFIMAC_WLAN_MAC_CTRL_DEAGG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0E000</addressOffset>
          <register>
            <name>PULSEDRESET</name>
            <description>WLAN MAC CTRL DEAGG PULSED RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGPULSEDRESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LATCHEDRESET</name>
            <description>WLAN MAC CTRL DEAGG LATCHED RESET</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLATCHEDRESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMSIFSVALUE</name>
            <description>WLAN MAC CTRL DEAGG OFDM SIFS VALUE</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGOFDMSIFSVALUE</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DSSSSIFSVALUE</name>
            <description>WLAN MAC CTRL DEAGG DSSS SIFS VALUE</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDSSSSIFSVALUE</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
