ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>INTRCOALSESIZE</name>
            <description>WLAN MAC CTRL DEAGG INTR COALSE SIZE</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGINTRCOALSESIZE</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTRCOALSENUM</name>
            <description>WLAN MAC CTRL DEAGG INTR COALSE NUM</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGINTRCOALSENUM</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYRXVECTCNT</name>
            <description>WLAN MAC CTRL DEAGG PHY RX VECT CNT</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000004E</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGPHYRXVECTCNT</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACRXVECTCNT</name>
            <description>WLAN MAC CTRL DEAGG MAC RX VECT CNT</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACRXVECTCNT</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXDMAEVENTENABLE</name>
            <description>WLAN MAC CTRL DEAGG RX DMA EVENT ENABLE</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRXDMAEVENTENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMACCTRLDEAGGDISPKTEVENTENABLE</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXDMAEVENTCLEAR</name>
            <description>WLAN MAC CTRL DEAGG RX DMA EVENT CLEAR</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRXDMAEVENTCLEAR</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXDMALENGTH</name>
            <description>WLAN MAC CTRL DEAGG RX DMA LENGTH</description>
            <addressOffset>0x28</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRXDMALENGTH</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIFCONTROL</name>
            <description>WLAN MAC CTRL DEAGG VIF CONTROL</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIFCONTROL</name>
                <description>The Deagg module has support for 4 VIF addresses.Firmware is expected to set the corresponding valid flag hereafter configuring each VIF address.Bit 0 (LSB) : VIF 0 validBit 1 : VIF 1 validBit 2 : VIF 2 validBit 3 (MSB) : VIF 3 valid</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR00</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 0 0</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR00</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR01</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 0 1</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR01</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR10</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 1 0</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR10</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR11</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 1 1</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR11</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR20</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 2 0</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR20</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR21</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 2 1</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR21</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR30</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 3 0</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR30</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MACADDR31</name>
            <description>WLAN MAC CTRL DEAGG MAC ADDR 3 1</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMACADDR31</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMPDUBITMAPINBYTES</name>
            <description>WLAN MAC CTRL DEAGG AMPDU BITMAP IN BYTES</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGAMPDUBITMAPINBYTES</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMPDUBITMAPSIZE</name>
            <description>WLAN MAC CTRL DEAGG AMPDU BITMAP SIZE</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGAMPDUBITMAPSIZE</name>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXQOSTIDS</name>
            <description>WLAN MAC CTRL DEAGG MAX QOS TIDS</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMAXQOSTIDS</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLEARALLDEBUGCNTS</name>
            <description>WLAN MAC CTRL DEAGG CLEAR ALL DEBUG CNTS</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCLEARALLDEBUGCNTS</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FSMSTATE</name>
            <description>WLAN MAC CTRL DEAGG FSM STATE</description>
            <addressOffset>0x60</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGFSMSTATE</name>
                <description>Deaggregation FSM State:</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RcvRxVector</name>
                    <description>RCV_RX_VECTOR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GenDmaEvent</name>
                    <description>GEN_DMA_EVENT</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SendRxVectorToMa</name>
                    <description>SEND_RX_VECTOR_TO_MAC</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ProcessAmpduFrame</name>
                    <description>PROCESS_AMPDU_FRAME</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ProcessMpduFrame</name>
                    <description>PROCESS_MPDU_FRAME</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AppendCrcStatus</name>
                    <description>APPEND_CRC_STATUS</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardFrame</name>
                    <description>DISCARD_FRAME</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GenEop</name>
                    <description>GEN_EOP</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SkipPadBytes</name>
                    <description>SKIP_PAD_BYTES</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForSifs</name>
                    <description>WAIT_FOR_SIFS</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXSTARTCNT</name>
            <description>WLAN MAC CTRL DEAGG RX START CNT</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRXSTARTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VALIDPHYVECTORCNT</name>
            <description>WLAN MAC CTRL DEAGG VALID PHY VECTOR CNT</description>
            <addressOffset>0x68</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVALIDPHYVECTORCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INVALIDPHYVECTORCNT</name>
            <description>WLAN MAC CTRL DEAGG INVALID PHY VECTOR CNT</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGINVALIDPHYVECTORCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMPDURCVDCNT</name>
            <description>WLAN MAC CTRL DEAGG AMPDU RCVD CNT</description>
            <addressOffset>0x70</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGAMPDURCVDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MPDURCVDCNT</name>
            <description>WLAN MAC CTRL DEAGG MPDU RCVD CNT</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMPDURCVDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRC32PASSCNT</name>
            <description>WLAN MAC CTRL DEAGG CRC32PASS CNT</description>
            <addressOffset>0x78</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRC32PASSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRC32FAILCNT</name>
            <description>WLAN MAC CTRL DEAGG CRC32FAIL CNT</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRC32FAILCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRC8PASSCNT</name>
            <description>WLAN MAC CTRL DEAGG CRC8PASS CNT</description>
            <addressOffset>0x80</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRC8PASSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRC8FAILCNT</name>
            <description>WLAN MAC CTRL DEAGG CRC8FAIL CNT</description>
            <addressOffset>0x84</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRC8FAILCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UNICASTPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG UNICAST PKT CNT</description>
            <addressOffset>0x88</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGUNICASTPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BRDCSTPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG BRDCST PKT CNT</description>
            <addressOffset>0x8C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBRDCSTPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIGGERDMACNT</name>
            <description>WLAN MAC CTRL DEAGG TRIGGER DMA CNT</description>
            <addressOffset>0x90</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGTRIGGERDMACNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENEOPCNT</name>
            <description>WLAN MAC CTRL DEAGG GEN EOP CNT</description>
            <addressOffset>0x94</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGGENEOPCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIFSFRMCNT</name>
            <description>WLAN MAC CTRL DEAGG SIFS FRM CNT</description>
            <addressOffset>0x98</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGSIFSFRMCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESPONSEFRMCNT</name>
            <description>WLAN MAC CTRL DEAGG RESPONSE FRM CNT</description>
            <addressOffset>0x9C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRESPONSEFRMCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCVDCTSCNT</name>
            <description>WLAN MAC CTRL DEAGG RCVD CTS CNT</description>
            <addressOffset>0xA0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRCVDCTSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCVDRTSCNT</name>
            <description>WLAN MAC CTRL DEAGG RCVD RTS CNT</description>
            <addressOffset>0xA4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRCVDRTSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCVDCNTRLPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG RCVD CNTRL PKT CNT</description>
            <addressOffset>0xA8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRCVDCNTRLPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
