ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>RCVDMGMTPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG RCVD MGMT PKT CNT</description>
            <addressOffset>0xAC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRCVDMGMTPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCVDQOSDATAPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG RCVD QOS DATA PKT CNT</description>
            <addressOffset>0xB0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRCVDQOSDATAPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCVDNONQOSDATAPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG RCVD NON QOS DATA PKT CNT</description>
            <addressOffset>0xB4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRCVDNONQOSDATAPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DSSSCRC32PASSCNT</name>
            <description>WLAN MAC CTRL DEAGG DSSS CRC32PASS CNT</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDSSSCRC32PASSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DSSSCRC32FAILCNT</name>
            <description>WLAN MAC CTRL DEAGG DSSS CRC32FAIL CNT</description>
            <addressOffset>0xBC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDSSSCRC32FAILCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTLENPHYVECTOR</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT LEN PHY VECTOR</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTLENPHYVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTAMPDUORMPDU</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT AMPDU OR MPDU</description>
            <addressOffset>0xC4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTAMPDUORMPDU</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTAMPDUSUBFRMRCVDCNT</name>
            <description>WLAN MAC CTRL DEAGG CRNT AMPDU SUB FRM RCVD CNT</description>
            <addressOffset>0xC8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTAMPDUSUBFRMRCVDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTSUBFRMLEN</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT SUB FRM LEN</description>
            <addressOffset>0xCC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTSUBFRMLEN</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTCRCSTATUS</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT CRC STATUS</description>
            <addressOffset>0xD0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTCRCSTATUS</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTFCF</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT FCF</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTFCF</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTRCVDMPDUBYTECNT</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT RCVDMPDUBYTECNT</description>
            <addressOffset>0xD8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTRCVDMPDUBYTECNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRNTPKTSEQNUM</name>
            <description>WLAN MAC CTRL DEAGG CRNT PKT SEQ NUM</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCRNTPKTSEQNUM</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTSEQNUM</name>
            <description>WLAN MAC CTRL DEAGG START SEQ NUM</description>
            <addressOffset>0xE0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGSTARTSEQNUM</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMALENPRGMD</name>
            <description>WLAN MAC CTRL DEAGG DMA LEN PRGMD</description>
            <addressOffset>0xE4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDMALENPRGMD</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAPENDINGBYTES</name>
            <description>WLAN MAC CTRL DEAGG DMA PENDING BYTES</description>
            <addressOffset>0xE8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDMAPENDINGBYTES</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMASENTBYTESCNT</name>
            <description>WLAN MAC CTRL DEAGG DMA SENT BYTES CNT</description>
            <addressOffset>0xEC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDMASENTBYTESCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BARCONTROLFIELD</name>
            <description>WLAN MAC CTRL DEAGG BAR CONTROL FIELD</description>
            <addressOffset>0xF0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBARCONTROLFIELD</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTPKTLENPHYVECTOR</name>
            <description>WLAN MAC CTRL DEAGG LAST PKT LEN PHY VECTOR</description>
            <addressOffset>0xF4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLASTPKTLENPHYVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTPKTSUBFRMLEN</name>
            <description>WLAN MAC CTRL DEAGG LAST PKT SUB FRM LEN</description>
            <addressOffset>0xF8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLASTPKTSUBFRMLEN</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTPKTAMPDUORMPDU</name>
            <description>WLAN MAC CTRL DEAGG LAST PKT AMPDU OR MPDU</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLASTPKTAMPDUORMPDU</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTAMPDUSUBFRMRCVDCNT</name>
            <description>WLAN MAC CTRL DEAGG LAST AMPDU SUB FRM RCVD CNT</description>
            <addressOffset>0x100</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLASTAMPDUSUBFRMRCVDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTPKTCRCSTATUS</name>
            <description>WLAN MAC CTRL DEAGG LAST PKT CRC STATUS</description>
            <addressOffset>0x104</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLASTPKTCRCSTATUS</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LASTPKTFCF</name>
            <description>WLAN MAC CTRL DEAGG LAST PKT FCF</description>
            <addressOffset>0x108</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGLASTPKTFCF</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FEATUREENABLE</name>
            <description>WLAN MAC CTRL DEAGG FEATURE ENABLE</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGFEATUREENABLE</name>
                <lsb>0</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF0BSSID0</name>
            <description>WLAN MAC CTRL DEAGG VIF0 BSSID 0</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF0BSSID0</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF0BSSID1</name>
            <description>WLAN MAC CTRL DEAGG VIF0 BSSID 1</description>
            <addressOffset>0x114</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF0BSSID1</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF1BSSID0</name>
            <description>WLAN MAC CTRL DEAGG VIF1 BSSID 0</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF1BSSID0</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF1BSSID1</name>
            <description>WLAN MAC CTRL DEAGG VIF1 BSSID 1</description>
            <addressOffset>0x11C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF1BSSID1</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF2BSSID0</name>
            <description>WLAN MAC CTRL DEAGG VIF2 BSSID 0</description>
            <addressOffset>0x120</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF2BSSID0</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF2BSSID1</name>
            <description>WLAN MAC CTRL DEAGG VIF2 BSSID 1</description>
            <addressOffset>0x124</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF2BSSID1</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF3BSSID0</name>
            <description>WLAN MAC CTRL DEAGG VIF3 BSSID 0</description>
            <addressOffset>0x128</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF3BSSID0</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF3BSSID1</name>
            <description>WLAN MAC CTRL DEAGG VIF3 BSSID 1</description>
            <addressOffset>0x12C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF3BSSID1</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF0STAAID</name>
            <description>WLAN MAC CTRL DEAGG VIF0 STA AID</description>
            <addressOffset>0x130</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF0STAAID</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF1STAAID</name>
            <description>WLAN MAC CTRL DEAGG VIF1 STA AID</description>
            <addressOffset>0x134</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF1STAAID</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF2STAAID</name>
            <description>WLAN MAC CTRL DEAGG VIF2 STA AID</description>
            <addressOffset>0x138</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF2STAAID</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VIF3STAAID</name>
            <description>WLAN MAC CTRL DEAGG VIF3 STA AID</description>
            <addressOffset>0x13C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGVIF3STAAID</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHETRIGGERPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE TRIGGER PKT CNT</description>
            <addressOffset>0x140</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHETRIGGERPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHETRIGGERPKTAIDMATCHEDCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE TRIGGER PKT AID MATCHED CNT</description>
            <addressOffset>0x144</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHETRIGGERPKTAIDMATCHEDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEBASICTRIGGERPKTCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE BASIC TRIGGER PKT CNT</description>
            <addressOffset>0x148</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHEBASICTRIGGERPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEMURTSCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE MU RTS CNT</description>
            <addressOffset>0x14C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHEMURTSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEMULTISTABACNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE MULTI STA BA CNT</description>
            <addressOffset>0x150</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHEMULTISTABACNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEMUBARCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE MU BAR CNT</description>
            <addressOffset>0x154</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHEMUBARCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEBSRPCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE BSRP CNT</description>
            <addressOffset>0x158</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHEBSRPCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
