ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>BTCOEXCTRL</name>
            <description>WLAN MAC CTRL DEAGG BT COEX CTRL</description>
            <addressOffset>0x15C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBTCOEXCTRL</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXVECTTXOP</name>
            <description>WLAN MAC CTRL DEAGG RX VECT TXOP</description>
            <addressOffset>0x160</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRXVECTTXOP</name>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DISPKTEVENTCLEAR</name>
            <description>WLAN MAC CTRL DEAGG DIS PKT EVENT CLEAR</description>
            <addressOffset>0x164</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDISPKTEVENTCLEAR</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEFAULTSIFSVALUE</name>
            <description>WLAN MAC CTRL DEAGG DEFAULT SIFS VALUE</description>
            <addressOffset>0x168</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEFAULTSIFSVALUE</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGNDPARECEIVEDCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG NDPA RECEIVED CNT</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGNDPARECEIVEDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGPROCESSNDPCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG PROCESS NDP CNT</description>
            <addressOffset>0x170</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGPROCESSNDPCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGVHTNDPARECEIVEDCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG VHT NDPA RECEIVED CNT</description>
            <addressOffset>0x174</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGVHTNDPARECEIVEDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHENDPARECEIVEDCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE NDPA RECEIVED CNT</description>
            <addressOffset>0x178</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHENDPARECEIVEDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGDISCARDNDPCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG DISCARD NDP CNT</description>
            <addressOffset>0x17C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGDISCARDNDPCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEMUAMPDUCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE MU AMPDU CNT</description>
            <addressOffset>0x180</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHEMUAMPDUCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHESUAMPDUCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG HE SU AMPDU CNT</description>
            <addressOffset>0x184</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGHESUAMPDUCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGRAMATCHEDHETPACKAMPDUCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG RA MATCHED HETP ACK AMPDU CNT</description>
            <addressOffset>0x188</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGRAMATCHEDHETPACKAMPDUCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDBAFORHETPACKAMPDUCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG SEND BA FOR HETP ACK AMPDU CNT</description>
            <addressOffset>0x18C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGSENDBAFORHETPACKAMPDUCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDBAFORNORMALACKPOLICYCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG SEND BA FOR NORMAL ACK POLICY CNT</description>
            <addressOffset>0x190</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGSENDBAFORNORMALACKPOLICYCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDBAFORBARCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG SEND BA FOR BAR CNT</description>
            <addressOffset>0x194</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGSENDBAFORBARCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDBAFORMUBARCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG SEND BA FOR MU BAR CNT</description>
            <addressOffset>0x198</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGSENDBAFORMUBARCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDHEBACNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG SEND HE BA CNT</description>
            <addressOffset>0x19C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGSENDHEBACNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDBACNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG SEND BA CNT</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGSENDBACNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGAMPDUSUBFRMCRC32PASSCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG AMPDU SUB FRM CRC32 PASS CNT</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGAMPDUSUBFRMCRC32PASSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGAMPDUSUBFRMCRC32FAILCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG AMPDU SUB FRM CRC32 FAIL CNT</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGAMPDUSUBFRMCRC32FAILCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBITMAPRECORDB0TOB23</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BITMAP RECORD B0 TO B23</description>
            <addressOffset>0x1AC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBITMAPRECORDB0TOB23</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBITMAPRECORDB24TOB47</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BITMAP RECORD B24 TO B47</description>
            <addressOffset>0x1B0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBITMAPRECORDB24TOB47</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBITMAPRECORDB48TOB63</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BITMAP RECORD B48 TO B63</description>
            <addressOffset>0x1B4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBITMAPRECORDB48TOB63</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBITMAPRECORDSSN</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BITMAP RECORD SSN</description>
            <addressOffset>0x1B8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBITMAPRECORDSSN</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBARSSN</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BAR SSN</description>
            <addressOffset>0x1BC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBARSSN</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBABITMAPB0TOB23</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BA BITMAP B0 TO B23</description>
            <addressOffset>0x1C0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBABITMAPB0TOB23</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBABITMAPB24TOB47</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BA BITMAP B24 TO B47</description>
            <addressOffset>0x1C4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBABITMAPB24TOB47</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBABITMAPB48TOB63</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BA BITMAP B48 TO B63</description>
            <addressOffset>0x1C8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBABITMAPB48TOB63</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBASSN</name>
            <description>WLAN MAC CTRL DEAGG DEBUG BA SSN</description>
            <addressOffset>0x1CC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGBASSN</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGNAVBUSYDROPRTSCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG NAV BUSY DROP RTS CNT</description>
            <addressOffset>0x1D0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGNAVBUSYDROPRTSCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGNAVBUSYDROPBASICTRIGCNT</name>
            <description>WLAN MAC CTRL DEAGG DEBUG NAV BUSY DROP BASIC TRIG CNT</description>
            <addressOffset>0x1D4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDEBUGNAVBUSYDROPBASICTRIGCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXWAITCNTINSIFS</name>
            <description>WLAN MAC CTRL DEAGG MAX WAIT CNT IN SIFS</description>
            <addressOffset>0x1D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000FA0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGMAXWAITCNTINSIFS</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSICTRLDATAFRAMES</name>
            <description>WLAN MAC CTRL DEAGG CSI CTRL DATA FRAMES</description>
            <addressOffset>0x1DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSICTRLDATAFRAMES</name>
                <lsb>0</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSICTRLMGMTFRAMES</name>
            <description>WLAN MAC CTRL DEAGG CSI CTRL MGMT FRAMES</description>
            <addressOffset>0x1E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSICTRLMGMTFRAMES</name>
                <lsb>0</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSICTRLCONTROLFRAMES</name>
            <description>WLAN MAC CTRL DEAGG CSI CTRL CONTROL FRAMES</description>
            <addressOffset>0x1E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSICTRLCONTROLFRAMES</name>
                <lsb>0</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSICTRL</name>
            <description>WLAN MAC CTRL DEAGG CSI CTRL</description>
            <addressOffset>0x1E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSICTRL</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSIEVENTCLR</name>
            <description>WLAN MAC CTRL DEAGG CSI EVENT CLR</description>
            <addressOffset>0x1EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIEVENTCLR</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSILOCKCLR</name>
            <description>WLAN MAC CTRL DEAGG CSI LOCK CLR</description>
            <addressOffset>0x1F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSILOCKCLR</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSIBUFID</name>
            <description>WLAN MAC CTRL DEAGG CSI BUF ID</description>
            <addressOffset>0x1F4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIBUFID</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSIBUF0AVLBL</name>
            <description>WLAN MAC CTRL DEAGG CSI BUF0 AVLBL</description>
            <addressOffset>0x1F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIBUF0AVLBL</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSIBUF1AVLBL</name>
            <description>WLAN MAC CTRL DEAGG CSI BUF1 AVLBL</description>
            <addressOffset>0x1FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIBUF1AVLBL</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSIBUF2AVLBL</name>
            <description>WLAN MAC CTRL DEAGG CSI BUF2 AVLBL</description>
            <addressOffset>0x200</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIBUF2AVLBL</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSIBUF3AVLBL</name>
            <description>WLAN MAC CTRL DEAGG CSI BUF3 AVLBL</description>
            <addressOffset>0x204</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIBUF3AVLBL</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
