ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CSIEVENTSTATUS</name>
            <description>WLAN MAC CTRL DEAGG CSI EVENT STATUS</description>
            <addressOffset>0x208</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGCSIEVENTSTATUS</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BSSBEACONEVENTSTATUS</name>
            <description>WLAN MAC CTRL DEAGG BSS BEACON EVENT STATUS</description>
            <addressOffset>0x20C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBSSBEACONEVENTSTATUS</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BSSBEACONEVENTCLR</name>
            <description>WLAN MAC CTRL DEAGG BSS BEACON EVENT CLR</description>
            <addressOffset>0x210</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBSSBEACONEVENTCLR</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONRATEMCSMODULATIONTYPE</name>
            <description>WLAN MAC CTRL DEAGG BEACON RATE MCS MODULATION TYPE</description>
            <addressOffset>0x214</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONRATEMCSMODULATIONTYPE</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONLEN</name>
            <description>WLAN MAC CTRL DEAGG BEACON LEN</description>
            <addressOffset>0x218</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONLEN</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONTSFLSB</name>
            <description>WLAN MAC CTRL DEAGG BEACON TSF LSB</description>
            <addressOffset>0x21C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONTSFLSB</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONTSFMIDSB</name>
            <description>WLAN MAC CTRL DEAGG BEACON TSF MIDSB</description>
            <addressOffset>0x220</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONTSFMIDSB</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONTSFMSB</name>
            <description>WLAN MAC CTRL DEAGG BEACON TSF MSB</description>
            <addressOffset>0x224</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONTSFMSB</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONDTIMCOUNT</name>
            <description>WLAN MAC CTRL DEAGG BEACON DTIM COUNT</description>
            <addressOffset>0x228</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONDTIMCOUNT</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONDTIMPERIOD</name>
            <description>WLAN MAC CTRL DEAGG BEACON DTIM PERIOD</description>
            <addressOffset>0x22C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONDTIMPERIOD</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONMULTICASTUNICASTCHECK</name>
            <description>WLAN MAC CTRL DEAGG BEACON MULTICAST UNICAST CHECK</description>
            <addressOffset>0x230</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONMULTICASTUNICASTCHECK</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEACONFIXEDPARAMETERSLEN</name>
            <description>WLAN MAC CTRL DEAGG BEACON FIXED PARAMETERS LEN</description>
            <addressOffset>0x234</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGBEACONFIXEDPARAMETERSLEN</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DISCARDPKTEVENTSTATUS</name>
            <description>WLAN MAC CTRL DEAGG DISCARD PKT EVENT STATUS</description>
            <addressOffset>0x3F8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGDISCARDPKTEVENTSTATUS</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXDMAEVENTSTATUS</name>
            <description>WLAN MAC CTRL DEAGG RX DMA EVENT STATUS</description>
            <addressOffset>0x3FC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLDEAGGRXDMAEVENTSTATUS</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_MAC_CTRL_AGG</name>
          <description>Unspecified</description>
          <headerStructName>WIFIMAC_WLAN_MAC_CTRL_AGG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x18000</addressOffset>
          <register>
            <name>PULSEDRESET</name>
            <description>WLAN MAC CTRL AGG PULSED RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGPULSEDRESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LATCHEDRESET</name>
            <description>WLAN MAC CTRL AGG LATCHED RESET</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGLATCHEDRESET</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXENABLE</name>
            <description>WLAN MAC CTRL AGG TX ENABLE</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BTCOEXENABLE</name>
            <description>WLAN MAC CTRL AGG BT COEX ENABLE</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGBTCOEXENABLE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTXVECTORCNT</name>
            <description>WLAN MAC CTRL AGG PHY TX VECTOR CNT</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGPHYTXVECTORCNT</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAEVENTSTATUS</name>
            <description>WLAN MAC CTRL AGG DMA EVENT STATUS</description>
            <addressOffset>0x14</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDMAEVENTSTATUS</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAEVENTSTATUSCLEAR</name>
            <description>WLAN MAC CTRL AGG DMA EVENT STATUS CLEAR</description>
            <addressOffset>0x18</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDMAEVENTSTATUSCLEAR</name>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXFWEVENTSTATUS</name>
            <description>WLAN MAC CTRL AGG TX FW EVENT STATUS</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXFWEVENTSTATUS</name>
                <description>0 : TX_SUCCESS1 : TX_BT_ABORT2 : TX_BT_ABORT_AT_END3 : TX_PHY_CCA_ABORT4 : TX_DMA_UNDERRUN5 : TX_ACK_TO</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXEDCASTATUS</name>
            <description>WLAN MAC CTRL AGG TX EDCA STATUS</description>
            <addressOffset>0x20</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXEDCASTATUS</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXFWEVENTSTATUSCLEAR</name>
            <description>WLAN MAC CTRL AGG TX FW EVENT STATUS CLEAR</description>
            <addressOffset>0x24</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXFWEVENTSTATUSCLEAR</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DSSSTXTOTXSIFS</name>
            <description>WLAN MAC CTRL AGG DSSS TX TO TX SIFS</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDSSSTXTOTXSIFS</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMTXTOTXSIFS</name>
            <description>WLAN MAC CTRL AGG OFDM TX TO TX SIFS</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGOFDMTXTOTXSIFS</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4A</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>AC1TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG AC1 TX VECTOR</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC1TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4A</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>AC2TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG AC2 TX VECTOR</description>
            <addressOffset>0x158</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC2TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4A</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>AC3TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG AC3 TX VECTOR</description>
            <addressOffset>0x280</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC3TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4A</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>AC4TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG AC4 TX VECTOR</description>
            <addressOffset>0x3A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC4TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4A</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>AC5TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG AC5 TX VECTOR</description>
            <addressOffset>0x4D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC5TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x34</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>SIFSRESPTXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG SIFS RESP TX VECTOR</description>
            <addressOffset>0x5F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGSIFSRESPTXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x3A</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>SIFSFRAMERATETABLE[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG SIFS FRAME RATE TABLE</description>
            <addressOffset>0x6C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGSIFSFRAMERATETABLE</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x34</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HETBAC0TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG HE TB AC0 TX VECTOR</description>
            <addressOffset>0x7B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC0TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x34</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HETBAC1TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG HE TB AC1 TX VECTOR</description>
            <addressOffset>0x880</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC1TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x34</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HETBAC2TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG HE TB AC2 TX VECTOR</description>
            <addressOffset>0x950</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC2TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x34</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HETBAC3TXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG HE TB AC3 TX VECTOR</description>
            <addressOffset>0xA20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC3TXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBAC0TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB AC0 TX ENABLE</description>
            <addressOffset>0xAF0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC0TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBAC1TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB AC1 TX ENABLE</description>
            <addressOffset>0xAF4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC1TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBAC2TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB AC2 TX ENABLE</description>
            <addressOffset>0xAF8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC2TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBAC3TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB AC3 TX ENABLE</description>
            <addressOffset>0xAFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBAC3TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MPDUFRAMES</name>
            <description>WLAN MAC CTRL AGG MPDU FRAMES</description>
            <addressOffset>0xB00</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMPDUFRAMES</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
