ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>HTCTRLBSRPCAPABLE</name>
            <description>WLAN MAC CTRL AGG HTCTRL BSRP CAPABLE</description>
            <addressOffset>0xB04</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHTCTRLBSRPCAPABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x34</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HETBBSRPTXVECTOR[%s]</name>
            <description>Description collection: WLAN MAC CTRL AGG HE TB BSRP TX VECTOR</description>
            <addressOffset>0xB08</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBBSRPTXVECTOR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID0TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID0 TX ENABLE</description>
            <addressOffset>0xBD8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID0TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID1TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID1 TX ENABLE</description>
            <addressOffset>0xBDC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID1TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID2TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID2 TX ENABLE</description>
            <addressOffset>0xBE0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID2TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID3TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID3 TX ENABLE</description>
            <addressOffset>0xBE4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID3TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID4TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID4 TX ENABLE</description>
            <addressOffset>0xBE8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID4TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID5TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID5 TX ENABLE</description>
            <addressOffset>0xBEC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID5TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID6TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID6 TX ENABLE</description>
            <addressOffset>0xBF0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID6TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID7TXENABLE</name>
            <description>WLAN MAC CTRL AGG HE TB TID7 TX ENABLE</description>
            <addressOffset>0xBF4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID7TXENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID0TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID0 TX LENGTH</description>
            <addressOffset>0xBF8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID0TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID1TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID1 TX LENGTH</description>
            <addressOffset>0xBFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID1TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID2TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID2 TX LENGTH</description>
            <addressOffset>0xC00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID2TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID3TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID3 TX LENGTH</description>
            <addressOffset>0xC04</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID3TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID4TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID4 TX LENGTH</description>
            <addressOffset>0xC08</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID4TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID5TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID5 TX LENGTH</description>
            <addressOffset>0xC0C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID5TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID6TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID6 TX LENGTH</description>
            <addressOffset>0xC10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID6TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HETBTID7TXLENGTH</name>
            <description>WLAN MAC CTRL AGG HE TB TID7 TX LENGTH</description>
            <addressOffset>0xC14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHETBTID7TXLENGTH</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEAMFORMGRAMPTR</name>
            <description>WLAN MAC CTRL AGG BEAMFORM GRAM PTR</description>
            <addressOffset>0xC18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGBEAMFORMGRAMPTR</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEAMFORMDMALENGTH</name>
            <description>WLAN MAC CTRL AGG BEAMFORM DMA LENGTH</description>
            <addressOffset>0xC1C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGBEAMFORMDMALENGTH</name>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WAITSTATE1TIME</name>
            <description>WLAN MAC CTRL AGG WAIT STATE 1 TIME</description>
            <addressOffset>0xC24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGWAITSTATE1TIME</name>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPOWZEROTXGAIN</name>
            <description>WLAN MAC CTRL AGG TXPOW ZERO TX GAIN</description>
            <addressOffset>0xC28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPOWZEROTXGAIN</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPOWSTEP</name>
            <description>WLAN MAC CTRL AGG TX POW STEP</description>
            <addressOffset>0xC2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPOWSTEP</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP00</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 0 0</description>
            <addressOffset>0xC30</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP00</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP01</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 0 1</description>
            <addressOffset>0xC34</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP01</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP10</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 1 0</description>
            <addressOffset>0xC38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP10</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP11</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 1 1</description>
            <addressOffset>0xC3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP11</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP1CTRL</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 1 CTRL</description>
            <addressOffset>0xC40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP1CTRL</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP20</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 2 0</description>
            <addressOffset>0xC44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP20</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP21</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 2 1</description>
            <addressOffset>0xC48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP21</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP2CTRL</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 2 CTRL</description>
            <addressOffset>0xC4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP2CTRL</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP30</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 3 0</description>
            <addressOffset>0xC50</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP30</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP31</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 3 1</description>
            <addressOffset>0xC54</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP31</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP3CTRL</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 3 CTRL</description>
            <addressOffset>0xC58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP3CTRL</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP40</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 4 0</description>
            <addressOffset>0xC5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP40</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP41</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 4 1</description>
            <addressOffset>0xC60</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP41</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPKTTIMESTAMP4CTRL</name>
            <description>WLAN MAC CTRL AGG TX PKT TIMESTAMP 4 CTRL</description>
            <addressOffset>0xC64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPKTTIMESTAMP4CTRL</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLEMISCCOMPUTATIONS</name>
            <description>WLAN MAC CTRL AGG DISABLE MISC COMPUTATIONS</description>
            <addressOffset>0xC68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDISABLEMISCCOMPUTATIONS</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS0</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 0</description>
            <addressOffset>0xC6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS0</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS1</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 1</description>
            <addressOffset>0xC70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS1</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS2</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 2</description>
            <addressOffset>0xC74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS2</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS3</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 3</description>
            <addressOffset>0xC78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS3</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS4</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 4</description>
            <addressOffset>0xC7C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS4</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS5</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 5</description>
            <addressOffset>0xC80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS5</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
