ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>MAXTXPWRMCS6</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 6</description>
            <addressOffset>0xC84</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS6</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXTXPWRMCS7</name>
            <description>WLAN MAC CTRL AGG MAX TX PWR MCS 7</description>
            <addressOffset>0xC88</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGMAXTXPWRMCS7</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGFSMSTATE</name>
            <description>WLAN MAC CTRL AGG DEBUG FSM STATE</description>
            <addressOffset>0xC8C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGFSMSTATE</name>
                <description>Aggregation FSM State:</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TxIdle</name>
                    <description>TX_IDLE</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TxPreProc</name>
                    <description>TX_PRE_PROC</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SendTxVector</name>
                    <description>SEND_TX_VECTOR</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ProcessMpduPayload</name>
                    <description>PROCESS_MPDU_PAYLOAD</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CalcAmpduDelimiter</name>
                    <description>CALC_AMPDU_DELIMITER</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AppendCrc</name>
                    <description>APPEND_CRC</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForTxEnd</name>
                    <description>WAIT_FOR_TX_END</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AddPadBytes</name>
                    <description>ADD_PAD_BYTES</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NullDelimiters</name>
                    <description>NULL_DELIMITERS</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitState</name>
                    <description>WAIT_STATE</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForSifs</name>
                    <description>WAIT_FOR_SIFS</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BeamformGramData</name>
                    <description>BEAMFORM_GRAM_DATA</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ComputeTxPowLut</name>
                    <description>COMPUTE_TX_POW_LUT</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ComputeBasictrigger</name>
                    <description>COMPUTE_BASICTRIGGER_ULLENGTH</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PrepBasictriggerAc</name>
                    <description>PREP_BASICTRIGGER_ACLST</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PrepTriggerFrame</name>
                    <description>PREP_TRIGGER_FRAME</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ComputingBasictrigg</name>
                    <description>COMPUTING_BASICTRIGGER_ULLENGTH</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InvalidUlBwOrRu</name>
                    <description>INVALID_UL_BW_OR_RU</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BasictriggerNoData</name>
                    <description>BASICTRIGGER_NO_DATA</description>
                    <value>0x12</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGMPDUORAMPDU</name>
            <description>WLAN MAC CTRL AGG DEBUG MPDU OR AMPDU</description>
            <addressOffset>0xC90</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGMPDUORAMPDU</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGMPDULENGTH</name>
            <description>WLAN MAC CTRL AGG DEBUG MPDU LENGTH</description>
            <addressOffset>0xC94</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGMPDULENGTH</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGAMPDUCURRENTSUBFRAMELENGTH</name>
            <description>WLAN MAC CTRL AGG DEBUG AMPDU CURRENT SUBFRAME LENGTH</description>
            <addressOffset>0xC98</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGAMPDUCURRENTSUBFRAMELENGTH</name>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCURRENTMPDUPENDINGBYTES</name>
            <description>WLAN MAC CTRL AGG DEBUG CURRENT MPDU PENDING BYTES</description>
            <addressOffset>0xC9C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGCURRENTMPDUPENDINGBYTES</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGISPROTECTIONFRAME</name>
            <description>WLAN MAC CTRL AGG DEBUG IS PROTECTION FRAME</description>
            <addressOffset>0xCA0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGISPROTECTIONFRAME</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCTSTIMEOUTVALUE</name>
            <description>WLAN MAC CTRL AGG DEBUG CTS TIMEOUT VALUE</description>
            <addressOffset>0xCA4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGCTSTIMEOUTVALUE</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGACKTIMEOUTVALUE</name>
            <description>WLAN MAC CTRL AGG DEBUG ACK TIMEOUT VALUE</description>
            <addressOffset>0xCA8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGACKTIMEOUTVALUE</name>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGINSIFSFRAMETX</name>
            <description>WLAN MAC CTRL AGG DEBUG IN SIFS FRAME TX</description>
            <addressOffset>0xCAC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGINSIFSFRAMETX</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSIFSRESPONSEFRAMETYPE</name>
            <description>WLAN MAC CTRL AGG DEBUG SIFS RESPONSE FRAME TYPE</description>
            <addressOffset>0xCB0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGSIFSRESPONSEFRAMETYPE</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGTXPOW</name>
            <description>WLAN MAC CTRL AGG DEBUG TX POW</description>
            <addressOffset>0xCB4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGTXPOW</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBASICTRIGQOSFRMCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG BASIC TRIG QOS FRM CNT</description>
            <addressOffset>0xCB8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGBASICTRIGQOSFRMCNT</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCOMMONINFO13</name>
            <description>WLAN MAC CTRL AGG DEBUG COMMON INFO 1 3</description>
            <addressOffset>0xCBC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGCOMMONINFO13</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCOMMONINFO46</name>
            <description>WLAN MAC CTRL AGG DEBUG COMMON INFO 4 6</description>
            <addressOffset>0xCC0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGCOMMONINFO46</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCOMMONINFO78</name>
            <description>WLAN MAC CTRL AGG DEBUG COMMON INFO 7 8</description>
            <addressOffset>0xCC4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGCOMMONINFO78</name>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGUSERINFO13</name>
            <description>WLAN MAC CTRL AGG DEBUG USER INFO 1 3</description>
            <addressOffset>0xCC8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGUSERINFO13</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGUSERINFO45</name>
            <description>WLAN MAC CTRL AGG DEBUG USER INFO 4 5</description>
            <addressOffset>0xCCC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGUSERINFO45</name>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGTRIGGERCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG TRIGGER CNT</description>
            <addressOffset>0xCD0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGTRIGGERCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGTRIGGERTYPE</name>
            <description>WLAN MAC CTRL AGG DEBUG TRIGGER TYPE</description>
            <addressOffset>0xCD4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGTRIGGERTYPE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBASICCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG BASIC CNT</description>
            <addressOffset>0xCD8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGBASICCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGBSRPCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG BSRP CNT</description>
            <addressOffset>0xCDC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGBSRPCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGEDCACNT</name>
            <description>WLAN MAC CTRL AGG DEBUG EDCA CNT</description>
            <addressOffset>0xCE0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGEDCACNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGINVALIDBWCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG INVALID BW CNT</description>
            <addressOffset>0xCE4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGINVALIDBWCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSENDBACNT</name>
            <description>WLAN MAC CTRL AGG DEBUG SEND BA CNT</description>
            <addressOffset>0xCE8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGSENDBACNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGMUBARCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG MU BAR CNT</description>
            <addressOffset>0xCEC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGMUBARCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGVHTBEAMFORM</name>
            <description>WLAN MAC CTRL AGG DEBUG VHT BEAM FORM</description>
            <addressOffset>0xCF0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGVHTBEAMFORM</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGHEBEAMFORM</name>
            <description>WLAN MAC CTRL AGG DEBUG HE BEAM FORM</description>
            <addressOffset>0xCF4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGHEBEAMFORM</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCTSPKTCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG CTS PKT CNT</description>
            <addressOffset>0xCF8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGCTSPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGMUCTSPKTCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG MU CTS PKT CNT</description>
            <addressOffset>0xCFC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGMUCTSPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGACKPKTCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG ACK PKT CNT</description>
            <addressOffset>0xD00</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGACKPKTCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSIFSRCVDCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG SIFS RCVD CNT</description>
            <addressOffset>0xD04</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGSIFSRCVDCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGSIFSRESPCNT</name>
            <description>WLAN MAC CTRL AGG DEBUG SIFS RESP CNT</description>
            <addressOffset>0xD08</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGSIFSRESPCNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXPREPROCESSINGCNT</name>
            <description>WLAN MAC CTRL AGG TX PRE PROCESSING CNT</description>
            <addressOffset>0xD0C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000078</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGTXPREPROCESSINGCNT</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LGDPDBYPASS</name>
            <description>WLAN MAC CTRL AGG LG DPD BYPASS</description>
            <addressOffset>0xD10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGLGDPDBYPASS</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
