ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>NONHEDPDBYPASS</name>
            <description>WLAN MAC CTRL AGG NON HE DPD BYPASS</description>
            <addressOffset>0xD14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGNONHEDPDBYPASS</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HEDPDBYPASS</name>
            <description>WLAN MAC CTRL AGG HE DPD BYPASS</description>
            <addressOffset>0xD18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHEDPDBYPASS</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LGCFRBYPASS</name>
            <description>WLAN MAC CTRL AGG LG CFR BYPASS</description>
            <addressOffset>0xD1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGLGCFRBYPASS</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONHECFRBYPASS</name>
            <description>WLAN MAC CTRL AGG NON HE CFR BYPASS</description>
            <addressOffset>0xD20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGNONHECFRBYPASS</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HECFRBYPASS</name>
            <description>WLAN MAC CTRL AGG HE CFR BYPASS</description>
            <addressOffset>0xD24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHECFRBYPASS</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LGPRECFRENABLE</name>
            <description>WLAN MAC CTRL AGG LG PRECFR ENABLE</description>
            <addressOffset>0xD28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGLGPRECFRENABLE</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONHEPRECFRENABLE</name>
            <description>WLAN MAC CTRL AGG NON HE PRECFR ENABLE</description>
            <addressOffset>0xD2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGNONHEPRECFRENABLE</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HEPRECFRENABLE</name>
            <description>WLAN MAC CTRL AGG HE PRECFR ENABLE</description>
            <addressOffset>0xD30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHEPRECFRENABLE</name>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>POSTRSFILTERCFG</name>
            <description>WLAN MAC CTRL AGG POST RS FILTER CFG</description>
            <addressOffset>0xD34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGPOSTRSFILTERCFG</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HTPOSTRSFILTERCFG</name>
            <description>WLAN MAC CTRL AGG HT POST RS FILTER CFG</description>
            <addressOffset>0xD38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGHTPOSTRSFILTERCFG</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPERESIDUALCFO</name>
            <description>WLAN MAC CTRL AGG CPE RESIDUAL CFO</description>
            <addressOffset>0xD3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGCPERESIDUALCFO</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGTOTALCFO</name>
            <description>WLAN MAC CTRL AGG DEBUG TOTAL CFO</description>
            <addressOffset>0xD40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGTOTALCFO</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AC0RETRY</name>
            <description>WLAN MAC CTRL AGG AC0 RETRY</description>
            <addressOffset>0xD44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC0RETRY</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AC1RETRY</name>
            <description>WLAN MAC CTRL AGG AC1 RETRY</description>
            <addressOffset>0xD48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC1RETRY</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AC2RETRY</name>
            <description>WLAN MAC CTRL AGG AC2 RETRY</description>
            <addressOffset>0xD4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC2RETRY</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AC3RETRY</name>
            <description>WLAN MAC CTRL AGG AC3 RETRY</description>
            <addressOffset>0xD50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC3RETRY</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AC4RETRY</name>
            <description>WLAN MAC CTRL AGG AC4 RETRY</description>
            <addressOffset>0xD54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGAC4RETRY</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGCONTROLS</name>
            <description>WLAN MAC CTRL AGG DEBUG CONTROLS</description>
            <addressOffset>0xFFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMACCTRLAGGDEBUGFREEZEFSMDURINGPBUSWRITES</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
