ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RPUPHY</name>
      <description>WIFICore RPU PHY peripherals</description>
      <baseAddress>0x48080000</baseAddress>
      <alternatePeripheral>RPUMAC</alternatePeripheral>
      <headerStructName>WIFIPHY</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>WIFIPHY</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>SCP</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_SCP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x07000</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>SCP CONTROL</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NSEL</name>
                <description>Defines the decimation ratio N of the first decimation stage of the SCP as follows:</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDecimation</name>
                    <description>No decimation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy2</name>
                    <description>Decimate by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy3</name>
                    <description>Decimate by 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy4</name>
                    <description>Decimate by 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy6</name>
                    <description>Decimate by 6</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy8</name>
                    <description>Decimate by 8</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy12</name>
                    <description>Decimate by 12</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecimateBy16</name>
                    <description>Decimate by 16</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LUTRESET</name>
                <description>Writing '1' to this field causes the LUT select signals to be reset.This bit clears automatically.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PSEL</name>
                <description>Defines the decimation ratio P of the final decimation stage of the SCP as follows:</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>P2</name>
                    <description>P = 2</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P3</name>
                    <description>P = 3</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P1</name>
                    <description>P = 1</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P4</name>
                    <description>P = 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Specifies the input IF sample format as follows:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2SComplementSamples</name>
                    <description>2's complement samples</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OffsetBinarySamples</name>
                    <description>Offset binary samples</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SOURCE</name>
                <description>Specifies the input IF sample source as follows:</description>
                <lsb>7</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SourceIsOnBoardAdc</name>
                    <description>Source is on-board ADC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SourceIsTbusWrPort</name>
                    <description>Source is TBus Wr port</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SourceIsInputSample</name>
                    <description>Source is Input_Sample register</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPUTMODE</name>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InputSamplesRepresen</name>
                    <description>Input samples represent a real IF signal</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InputSamplesAreIQPa</name>
                    <description>Input samples are I/Q pairs</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INVERTSPECTRUM</name>
                <description>Note: The mixer design under normal operation inverts the output I and Q samples even if this field is set to 0. To re-invert set field to 1.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheMixerOutputSpectr</name>
                    <description>The mixer output spectrum is not inverted</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheMixerOutputSpectr1</name>
                    <description>The mixer output spectrum is inverted by swapping I and Q</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYNCHRONIZEUPDATES</name>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UpdatesToParametersT</name>
                    <description>Updates to parameters take effect immediately.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UpdatesToParametersA</name>
                    <description>Updates to parameters are synchronized to the APPLY_PARAMETERS sample count value.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPRESET</name>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ScpSignalPathOperate</name>
                    <description>SCP signal path operates normally</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ScpSignalPathHeldInA</name>
                    <description>SCP signal path held in a reset state (clears CIC and notch phase accumulators)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLEARPHASE</name>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResamplerAndLoPhaseA</name>
                    <description>Resampler and LO phase accumulators run normally</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResamplerAndLoPhaseA1</name>
                    <description>Resampler and LO phase accumulators are forced to zero</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SETSCPPOWER</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoChange</name>
                    <description>No change</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPowerMode</name>
                    <description>Low-power mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOn</name>
                    <description>Power-on</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOff</name>
                    <description>Power-off</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SETADCPOWER</name>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoChange</name>
                    <description>No change</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPowerMode</name>
                    <description>Low-power mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOn</name>
                    <description>Power-on</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOff</name>
                    <description>Power-off</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SETACTIVEFRAME</name>
                <lsb>18</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoChange</name>
                    <description>No change</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoChange1</name>
                    <description>No change</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FrameAActive</name>
                    <description>Frame A Active</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FrameBActive</name>
                    <description>Frame B active</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TBUSFIFOFLUSH</name>
                <description>Writing '1' to this field causes the TBus output FIFO to be flushed.This bit clears automatically.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>MODE</name>
                <description>Defines the operating mode of the SCP as follows:0: Normal operation; SCP samples are output1: LO phase accumulator (MSB:MSB-11) is output on ILO phase accumulator(MSB-12:MSB-23) is output on Q2: Bypass mode 1; resampler results are output on I and Q3: Bypass mode 2; mixer results are output on I and Q4: Samples bypass the SCP completely</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>SCP STATUS</description>
            <addressOffset>0x4</addressOffset>
            <access>read-only</access>
            <resetValue>0x001BC000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPCOEFFLOADED</name>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CoeffsAreNotLoaded</name>
                    <description>Coeffs are not loaded.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CoeffsSet0IsLoaded</name>
                    <description>Coeffs set 0 is loaded.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CoeffsSet1IsLoaded</name>
                    <description>Coeffs set 1 is loaded.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPPOWER</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Undefined</name>
                    <description>Undefined</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPowerMode</name>
                    <description>Low-power mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOn</name>
                    <description>Power-on</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOff</name>
                    <description>Power-off</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADCPOWER</name>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Undefined</name>
                    <description>Undefined</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPowerMode</name>
                    <description>Low-power mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOn</name>
                    <description>Power-on</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOff</name>
                    <description>Power-off</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACTIVEFRAME</name>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FrameAActive</name>
                    <description>Frame_A active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FrameBActive</name>
                    <description>Frame_B active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPUTSAMPLEENABLE</name>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ScpNotReadyForWriteT</name>
                    <description>SCP not ready for write to SCP_INPUT_SAMPLE register.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ScpReadyForWriteToSc</name>
                    <description>SCP ready for write to SCP_INPUT_SAMPLE register.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IFENABLE</name>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InputSynchroniserNot</name>
                    <description>Input synchroniser not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InputSynchroniserEna</name>
                    <description>Input synchroniser enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IRQSCP</name>
                <description>This signal reflects the state of the IRQ_SCP interrupt.This interrupt is controlled by SCP_Interrupt_Enable.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTERRUPTSTATUS</name>
            <description>SCP INTERRUPT STATUS</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENERGYEVENT</name>
                <description>This bit is set to 1 when Energy Monitor outputs are ready to be read.Writing 1 sets this bit for test purposes (and hence asserts the interrupt if ENERGY_ENABLE is also set).</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TBUSOVERFLOWEVENT</name>
                <description>This bit is set to 1 if the TBus output FIFO overflows.Writing 1 sets this bit for test purposes (and hence asserts the interrupt if TBUS_OVERFLOW_ENABLE is also set).</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>OVERFLOWEVENT</name>
                <description>This bit is set to 1 when the input synchroniser has overflowed.Writing 1 sets this bit for test purposes (and hence asserts the interrupt if OVERFLOW_ENABLE is also set).</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>COMPAREEVENT</name>
                <description>This bit is set to 1 when the frame compare test has matched.Writing 1 sets this bit for test purposes (and hence asserts the interrupt if COMPARE_ENABLE is also set).</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>AGCCOUNTSEVENT</name>
                <description>This bit is set to 1 when the AGC period has completed.Writing 1 sets this bit for test purposes (and hence asserts the interrupt if AGC_COUNTS_ENABLE is also set).</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
