ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>INTERRUPTENABLE</name>
            <description>SCP INTERRUPT ENABLE</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENERGYENABLE</name>
                <description>IRQ_SCP is asserted when ENERGY_EVENT=1 and ENERGY_ENABLE=1.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TBUSOVERFLOWENABLE</name>
                <description>IRQ_SCP is asserted when TBUS_OVERFLOW_EVENT=1 and TBUS_OVERFLOW_ENABLE=1.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>OVERFLOWENABLE</name>
                <description>IRQ_SCP is asserted when OVERFLOW_EVENT=1 and OVERFLOW_ENABLE=1.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>COMPAREENABLE</name>
                <description>IRQ_SCP is asserted when COMPARE_EVENT=1 and COMPARE_ENABLE=1.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>AGCCOUNTSENABLE</name>
                <description>IRQ_SCP is asserted when AGC_COUNTS_EVENT=1 and AGC_COUNTS_ENABLE=1.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTERRUPTCLEAR</name>
            <description>SCP INTERRUPT CLEAR</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENERGYCLEAR</name>
                <description>Writing 1 to this bit sets ENERGY_EVENT to 0</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TBUSOVERFLOWCLEAR</name>
                <description>Writing 1 to this bit sets TBUS_OVERFLOW_EVENT to 0</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>OVERFLOWCLEAR</name>
                <description>Writing 1 to this bit sets OVERFLOW_EVENT to 0</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>COMPARECLEAR</name>
                <description>Writing 1 to this bit sets COMPARE_EVENT to 0</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>AGCCOUNTSCLEAR</name>
                <description>Writing 1 to this bit sets AGC_COUNTS_EVENT to 0.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INPUTSAMPLE</name>
            <description>SCP INPUT SAMPLE</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INPUTQ</name>
                <description>For 12-bit SCP : input sample Q component.For 16-bit SCP : write input sample I[11:0] followed by Q[11:0].Poll for INPUT_SAMPLE_ENABLE=1 before writing.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>INPUTI</name>
                <description>For 12-bit SCP : write input sample I component.For 16-bit SCP : write input sample I[15:12] followed by Q[15:12].Poll for INPUT_SAMPLE_ENABLE=1 before writing.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REFERENCECLOCKCONTROLN</name>
            <description>SCP REFERENCE CLOCK CONTROL N</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>N</name>
                <description>The frequency of the output ref_clk is R x (N[14:0] / (M * 2)), where R is the SCP output sample frequency when N[15]=0, else the core clock frequency.If N and M are to be used to scale the reference clock M must be programmed first followed by N.Note that the reference clock control can only act as a divider not as a multiplier so the ratio (N[14:0] / (M * 2)) must be less than or equal to 0.5.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REFERENCECLOCKCONTROLM</name>
            <description>SCP REFERENCE CLOCK CONTROL M</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>M</name>
                <description>The frequency of the output ref_clk is R x (N[14:0] / (M * 2)), where R is the SCP sample frequency when N[15]=0, else the core clock frequency.If N and M are to be used to scale the reference clock M must be programmed first followed by N.Note that the Reference clock control can only act as a divider not as a multiplier so the ratio (N[14:0] / (M * 2)) must be less than or equal to 0.5.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CICBYPASS</name>
            <description>SCP CIC BYPASS</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CICBYPASS</name>
                <description>Used to set the bypass mode of the CIC block.When bypass is set the CIC block is powered down and data passes around it unaltered.When cleared the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RSSIINPUT</name>
            <description>SCP RSSI INPUT</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIINPUT</name>
                <description>RSSI (Received Signal Strength Indicator) ADC input captured on AGC sample period trigger</description>
                <lsb>8</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL2</name>
            <description>SCP CONTROL2</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPKICKENABLE</name>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>WritesToSetAdcPowe</name>
                    <description>Writes to SET_ADC_POWER/SET_SCP_POWER/NEW_ADC_POWER/NEW_SCP_POWER/INPUT_I/INPUT_Q registers not deferred until kick received from EDC_SCP_KICK register to synchroniser update of these registers to multiple SCPs.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WritesToSetAdcPowe1</name>
                    <description>Writes to SET_ADC_POWER/SET_SCP_POWER/NEW_ADC_POWER/NEW_SCP_POWER/INPUT_I/INPUT_Q registers deferred until kick received from EDC_SCP_KICK register to synchroniser update of these registers to multiple SCPs.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANEDAGCSTART</name>
                <description>Note: In mode 1 the input data rate to the SCP must be greater than or equal to the output data rate.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ScpNotUsedForProcess</name>
                    <description>SCP not used for processing Wi-Fi samples. No hold off provided to synchronize output samples with ADC input, DMA output enabled at start of frame.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ScpUsedForProcessing</name>
                    <description>SCP used for processing Wi-Fi samples. Provides hold off to synchronize output samples with ADC input, DMA output enabled by agc_done signal from Wi-Fi AGC.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGGING</name>
            <description>SCP DEBUG</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPSTARTSAMPLES</name>
                <description>Number of samples before enabling SCP output when SCP_START_MODE=1</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DISCARDINITIALSAMPLES</name>
                <description>Number of initial ADC samples to discard</description>
                <lsb>8</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>SCPDEBUG</name>
                <description>Enable debug registers SCP_DEBUG_VALID and SCP_DEBUG_ENABLE</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPSTARTMODE</name>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputAllScpOutputSa</name>
                    <description>Output all SCP output samples, or all samples after ED event when WLAN_EDAGC_START=1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardFirstScpStar</name>
                    <description>Discard first SCP_START_SAMPLES SCP output samples</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISCARDINITIALZEROS</name>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ProcessAllAdcInputSa</name>
                    <description>Process all ADC input samples</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardInitialAdcInp</name>
                    <description>Discard initial ADC input data until first non-zero sample</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGVALID0</name>
            <description>SCP DEBUG VALID 0</description>
            <addressOffset>0x30</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPDEBUGVALID0</name>
                <description>Live state of the valid flow control signals0: Source Synchroniser Output1: RI/Q Formatter Input2: RI/Q Formatter Output3: NDRM Decimator Input4: NDRM Decimator Output5: FDC Offset Input6: FDC Offset Output7: EEarly Gain Input8: EEarly Gain Output9: RMixer Input10: Mixer Output11: Resampler Input12: Resampler Output13: IQ Imbalance Input14: IQ Imbalance Output15: CIC Decimator Input16: CIC Decimator Output17: FIR Decimator Input18: FIR Decimator Output19: Notch Filter Input20: Notch Filter Output21: Late Gain Input22: Late Gain Output23: Impulse Filter Input</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGVALID1</name>
            <description>SCP DEBUG VALID 1</description>
            <addressOffset>0x34</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPDEBUGVALID1</name>
                <description>Live state of the valid flow control signals0: Impulse Filter Output1: Output Mux Input2: FIFO Write3: FIFO Output4: Unpacker Input5: EDC T-Bus Read Peripheral Input6: EDC T-Bus Read Peripheral Output</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGENABLE0</name>
            <description>SCP DEBUG ENABLE 0</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPDEBUGENABLE0</name>
                <description>Live state of the valid flow control signals0: Source Synchroniser Output1: RI/Q Formatter Input2: RI/Q Formatter Output3: NDRM Decimator Input4: NDRM Decimator Output5: FDC Offset Input6: FDC Offset Output7: EEarly Gain Input8: EEarly Gain Output9: RMixer Input10: Mixer Output11: Resampler Input12: Resampler Output13: IQ Imbalance Input14: IQ Imbalance Output15: CIC Decimator Input16: CIC Decimator Output17: FIR Decimator Input18: FIR Decimator Output19: Notch Filter Input20: Notch Filter Output21: Late Gain Input22: Late Gain Output23: Impulse Filter Input</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGENABLE1</name>
            <description>SCP DEBUG ENABLE 1</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPDEBUGENABLE1</name>
                <description>Live state of the valid flow control signals0: Impulse Filter Output1: Output Mux Input2: FIFO Full3: FIFO Output4: Unpacker Input5: EDC T-Bus Read Peripheral Input6: EDC T-Bus Read Peripheral Output</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFFADDR</name>
            <description>SCP COEFF ADDR</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPCOEFFADDR</name>
                <description>Address for coefficient of final (FIR) decimation filter.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFFDATA</name>
            <description>SCP COEFF DATA</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPCOEFFDATA</name>
                <description>Data for coefficient of final (FIR) decimation filter in 2's complement format where the range of numbers represented is -1.0 to 1.0.SCP_COEFF_ADDR automatically increments following write.</description>
                <lsb>0</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ENERGYCONTROL</name>
            <description>SCP ENERGY CONTROL</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENERGYBLOCKSIZE</name>
                <description>Block size for the energy calculation at the CIC decimator and the late gain stage, shifted right by 6.Takes values in the range [1 ~ 2^14] and must be a power of 2.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ENERGYCICENABLE</name>
                <description>Enable, disable the energy calculation on the input of the CIC decimator block.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EnergyCalculationDis</name>
                    <description>Energy calculation disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnergyCalculationEna</name>
                    <description>Energy calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENERGYLATEGAINENABLE</name>
                <description>Enable control for the energy calculation on the input of the late gain block:</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EnergyCalculationDis</name>
                    <description>Energy calculation disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnergyCalculationEna</name>
                    <description>Energy calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENERGYCICVALUE</name>
            <description>SCP ENERGY CIC VALUE</description>
            <addressOffset>0x54</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENERGYCICVALUE</name>
                <description>Energy value from CIC decimator energy monitor block.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ENERGYLATEGAINVALUE</name>
            <description>SCP ENERGY LATE GAIN VALUE</description>
            <addressOffset>0x58</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENERGYLATEGAINVALUE</name>
                <description>Energy value from late gain energy monitor block.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
