ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>EARLYCOARSEGAIN</name>
            <description>SCP EARLY COARSE GAIN</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EARLYCOARSEGAIN</name>
                <description>Coarse gain applied in the early gain block.</description>
                <lsb>22</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CoarseGainOf1</name>
                    <description>Coarse gain of 1.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CoarseGainOf14</name>
                    <description>Coarse gain of 1/4.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CoarseGainOf4</name>
                    <description>Coarse gain of 4.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EARLYFINEGAINI</name>
            <description>SCP EARLY FINE GAIN I</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00200000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EARLYIGAIN</name>
                <description>2's complement value that multiplies I value from SCP.This is a linear gain where 0x800 represents the 0dB point, thus the fine gain is EARLY_I_GAIN/0x800.Bits 23:13 valid for 12-bit SCP, bits 23:10 valid for 16-bit SCP.</description>
                <lsb>10</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EARLYFINEGAINQ</name>
            <description>SCP EARLY FINE GAIN Q</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00200000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EARLYQGAIN</name>
                <description>2's complement value that multiplies Q value from SCP.This is a linear gain where 0x800 represents the 0dB point, thus the fine gain is EARLY_Q_GAIN/0x800.Bits 23:13 valid for 12-bit SCP, bits 23:10 valid for 16-bit SCP.</description>
                <lsb>10</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EARLYANGLEIQ</name>
            <description>SCP EARLY ANGLE IQ</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EARLYITOQGAIN</name>
                <description>2's complement value that multiplies I value before addition to Q value in the early gain block.Qout = Q + (I * EARLY_I_TO_Q_GAIN &amp;gt;&amp;gt; 13).Bits 23:13 valid for 12-bit SCP, bits 23:10 valid for 16-bit SCP.</description>
                <lsb>10</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LATECOARSEGAIN</name>
            <description>SCP LATE COARSE GAIN</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LATECOARSEGAIN</name>
                <description>Coarse gain applied in the late gain block.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CoarseGainOf1</name>
                    <description>Coarse gain of 1.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CoarseGainOf4</name>
                    <description>Coarse gain of 4.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LATEFINEGAINI</name>
            <description>SCP LATE FINE GAIN I</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00200000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LATEIGAIN</name>
                <description>2's complement value that multiplies I value from SCP. This is a linear gain where 0x100 represents the 0dB point, thus the fine gain is LATE_I_GAIN/0x100.</description>
                <lsb>13</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LATEFINEGAINQ</name>
            <description>SCP LATE FINE GAIN Q</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00200000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LATEQGAIN</name>
                <description>2's complement value that multiplies Q value from SCP. This is a linear gain where 0x100 represents the 0dB point, thus the fine gain is LATE_Q_GAIN/0x100.</description>
                <lsb>13</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCOFFSETI1</name>
            <description>SCP DC OFFSET I 1</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOFFSETFRACI1</name>
                <description>DC offset cancellation value for the real or I channel. 2's complement value, where the number of integer bits are defined by the I channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCOFFSETI1</name>
                <description>DC offset cancellation value for the real or I channel. 2's complement value, where the number of integer bits are defined by the I channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCOFFSETQ1</name>
            <description>SCP DC OFFSET Q 1</description>
            <addressOffset>0x84</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOFFSETFRACQ1</name>
                <description>DC offset cancellation value for the Q channel. 2's complement value, where the number of integer bits are defined by the Q channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCOFFSETQ1</name>
                <description>DC offset cancellation value for the Q channel. 2's complement value, where the number of integer bits are defined by the Q channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCOFFSETI0</name>
            <description>SCP DC OFFSET I 0</description>
            <addressOffset>0x88</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOFFSETFRACI0</name>
                <description>DC offset cancellation value for the real or I channel. 2's complement value, where the number of integer bits are defined by the I channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCOFFSETI0</name>
                <description>DC offset cancellation value for the real or I channel. 2's complement value, where the number of integer bits are defined by the I channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCOFFSETQ0</name>
            <description>SCP DC OFFSET Q 0</description>
            <addressOffset>0x8C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOFFSETFRACQ0</name>
                <description>DC offset cancellation value for the Q channel. 2's complement value, where the number of integer bits are defined by the Q channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCOFFSETQ0</name>
                <description>DC offset cancellation value for the Q channel. 2's complement value, where the number of integer bits are defined by the Q channel size and the remainder bits are fractional. The fractional bits enter a wrapping accumulator and the carry from this is summed with the integer offset.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTGAINCONTROL1</name>
            <description>SCP EXT GAIN CONTROL 1</description>
            <addressOffset>0x90</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GAINCONTROL1</name>
                <description>External gain control signal for channel 1 (I channel)</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTGAINCONTROL2</name>
            <description>SCP EXT GAIN CONTROL 2</description>
            <addressOffset>0x94</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GAINCONTROL2</name>
                <description>External gain control signal for channel 2 (Q Channel)</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTOFFSETCONTROL1</name>
            <description>SCP EXT OFFSET CONTROL 1</description>
            <addressOffset>0x98</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETCONTROL1</name>
                <description>External offset control signal for channel 1 (I Channel)</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTOFFSETCONTROL2</name>
            <description>SCP EXT OFFSET CONTROL 2</description>
            <addressOffset>0x9C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETCONTROL2</name>
                <description>External offset control signal for channel 2 (Q Channel)</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EARLYGAINBYPASS</name>
            <description>SCP EARLY GAIN BYPASS</description>
            <addressOffset>0xA0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EARLYBYPASS</name>
                <description>Used to set the bypass mode of the Early Gain block.When bypass is set the Early Gain block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LATEGAINBYPASS</name>
            <description>SCP LATE GAIN BYPASS</description>
            <addressOffset>0xA4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LATEBYPASS</name>
                <description>Used to set the bypass mode of the Late Gain block.When bypass is set the Late Gain block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IQCORRCONTROL</name>
            <description>SCP IQCORR CONTROL</description>
            <addressOffset>0xB0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQCORRENABLE</name>
                <description>Used to enable the IQ Correlator for detecting angle error on a Zero-IF input signal</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IqCorrelatorIsDisabl</name>
                    <description>IQ Correlator is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IqCorrelatorIsEnable</name>
                    <description>IQ Correlator is enabled)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IQCORRSTATUS</name>
            <description>SCP IQCORR STATUS</description>
            <addressOffset>0xB4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQCORROUT</name>
                <description>IQ Correlator output for detecting angle error on a Zero-IF input signal.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCNOISEPERIOD</name>
            <description>SCP AGC NOISE PERIOD</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOISEPERIOD</name>
                <description>Period of the input sample counter - 1e.g. 0 gives period of sample length 1, 1 gives period of sample length 2, 2 gives period of sample length 3.The value has to be already adjusted according to DRM decimation factor, resampling rate and CIC &amp;amp; FIR decimation factors.NOISE_PERIOD = ((AGC_PERIOD / (((RESAMP_BASE * 2^23) + RESAMP_CONTROL) / 2^25)) / P) / N.</description>
                <lsb>5</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCCLIPCONTROL</name>
            <description>SCP AGC CLIP CONTROL</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCCLIP</name>
                <description>Threshold value against which the absolute value of IF samples is compared in the logic that generates CLIP_COUNT.Bits 18:8 valid for 12-bit SCP, bits 18:4 valid for 16-bit SCP.</description>
                <lsb>4</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCTHRESHCONTROL</name>
            <description>SCP AGC THRESH CONTROL</description>
            <addressOffset>0xC4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCTHRESH</name>
                <description>Threshold value against which the absolute value of IF samples is compared in the logic that generates THRESH_COUNT.Bits 18:8 valid for 12-bit SCP, bits 18:4 valid for 16-bit SCP.</description>
                <lsb>4</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCPERIOD</name>
            <description>SCP AGC PERIOD</description>
            <addressOffset>0xC8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCPERIOD</name>
                <description>Period of the input sample counter - 1e.g. 0 gives period of sample length 1, 1 gives period of sample length 2, 2 gives period of sample length 3.The value has to be already adjusted according to DRM decimation factor.</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCSAMPLECOUNTER</name>
            <description>SCP AGC SAMPLE COUNTER</description>
            <addressOffset>0xCC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCCOUNT</name>
                <description>Current value of the AGC sample counter. This counts pairs of input samples (I and Q).</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCCLIPCOUNTI</name>
            <description>SCP AGC CLIP COUNT I</description>
            <addressOffset>0xD0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIPCOUNTI</name>
                <description>The number of IF samples at either extreme of the ADC range (greater than AGC_CLIP) recorded during the last complete AGC_PERIOD of the I sample stream.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCTHRESHCOUNTI</name>
            <description>SCP AGC THRESH COUNT I</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>THRESHCOUNTI</name>
                <description>The number of IF samples with absolute value greater than AGC_THRESH recorded during the last complete AGC_PERIOD of the I sample stream.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
