ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>AGCCLIPCOUNTQ</name>
            <description>SCP AGC CLIP COUNT Q</description>
            <addressOffset>0xD8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIPCOUNTQ</name>
                <description>The number of IF samples at either extreme of the ADC range (greater than AGC_CLIP) recorded during the last complete AGC_PERIOD of the Q sample stream.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCTHRESHCOUNTQ</name>
            <description>SCP AGC THRESH COUNT Q</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>THRESHCOUNTQ</name>
                <description>The number of IF samples with absolute value greater than AGC_THRESH recorded during the last complete AGC_PERIOD of the Q sample stream.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCMONITORI</name>
            <description>SCP DC MONITOR I</description>
            <addressOffset>0xE0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCMONITORI</name>
                <description>Measures the DC component of the I signal from the ADC to allow feedback to the RF to reduce the long-term DC offset to zero.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCMONITORQ</name>
            <description>SCP DC MONITOR Q</description>
            <addressOffset>0xE4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCMONITORQ</name>
                <description>Measures the DC component of the Q signal from the ADC to allow feedback to the RF to reduce the long-term DC offset to zero.This value is latched and held when the IRQ_SCP interrupt is asserted due to AGC_COUNTS_EVENT.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCBYPASS</name>
            <description>SCP DC BYPASS</description>
            <addressOffset>0xE8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCBYPASS</name>
                <description>Used to set the bypass mode of the DC Offset block.When bypass is set the DC Offset block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCCONTROL</name>
            <description>SCP DC CONTROL</description>
            <addressOffset>0xEC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCMONITORSOURCE</name>
                <description>Selects the source for input to the DC Monitor:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheOutputOfTheDrmDec</name>
                    <description>The output of the DRM Decimator (default)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheOutputOfTheDcOffs</name>
                    <description>The output of the DC Offset Control</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCMONITORIQSEL</name>
                <description>Selects which part of the 32 bit register hoding the dc_monitor_i/q value is read out from the DC_MONITOR_I/Q field of the register SCP_DC_MONITOR_I/Q.0 : Lower 16 bits are read out from the DC_MONITOR_I/Q[15:0] field.1 : Upper 16 bits are read out from the DC_MONITOR_I/Q[15:0] field.Only valid for 16-bit SCP, unused by 12-bit SCP.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOBASE</name>
            <description>SCP LO BASE</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOBASE</name>
                <description>Local Oscillator base. This is an unsigned value which is combined with LO_CONTROL to generate the 26-bit control Fc:Fc = (LO_BASE &amp;lt;&amp;lt; 23) + LO_CONTROLFc is in 2's complement signed format where its value represents numbers within the range -1 to 0.9999999. To convert a ratio into the 26-bit Fc, multiply by 2^25.The digitally generated Local Oscillator (LO) frequency used in the mixer section is equal to Fc * (IF Clock Frequency/2). Hence the full-scale negative value represents a frequency of -(IF Clock Frequency/2).The input signal is frequency translated such that input frequency F moves to a frequency of F + Local Oscillator (LO) Frequency.NOTE : a real IF input implicitly carries the inverse of its positive spectrum at negative frequencies. This means that a positive Fc applied to a real IF gives an inverted spectrum, and a negative Fc gives a non-inverted one. An SCP input contains independent positive and negative frequency components, so Fc cannot invert the spectrum.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCONTROL</name>
            <description>SCP LO CONTROL</description>
            <addressOffset>0x104</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCONTROL</name>
                <description>Local Oscillator control. This is a 2's complement value which is combined with LO_BASE to generate the 26-bit control Fc:Fc = (LO_BASE &amp;lt;&amp;lt; 23) + LO_CONTROL</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIXERBYPASS</name>
            <description>SCP MIXER BYPASS</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIXERBYPASS</name>
                <description>Used to set the bypass mode of the Mixer block.When bypass is set the Mixer block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MIXERCONTROL</name>
            <description>SCP MIXER CONTROL</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIXEROUTGAIN</name>
                <description>Selects Mixer output gain:NOTE: Using a setting of 2.0 increases the signal strength by 6 dB as both real &amp;amp; imaginary components are scaled.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GainOf10IsAppliedTo</name>
                    <description>Gain of 1.0 is applied to the output of Mixer rotator (default)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainOf20IsAppliedTo</name>
                    <description>Gain of 2.0 is applied to the output of Mixer rotator (used to compensate for 0.5 gain in real input mode)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MIXERMETRICENABLE</name>
                <description>Used to enable the Mixer IQ level imbalance estimation metric generation:</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MixerIqMetricIsDisab</name>
                    <description>Mixer IQ metric is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MixerIqMetricIsEnabl</name>
                    <description>Mixer IQ metric is enabled)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MIXERMETRICSTATUS</name>
            <description>MIXER METRIC STATUS</description>
            <addressOffset>0x114</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIXERMETRICOUT</name>
                <description>Mixer IQ level imbalance estimation metric accumulated over AGC period.</description>
                <lsb>0</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLINGFACTORBASE</name>
            <description>SCP RESAMPLING FACTOR BASE</description>
            <addressOffset>0x120</addressOffset>
            <access>read-write</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESAMPBASE</name>
                <description>Resampling factor base. This is an unsigned value which is combined with the 2's complement RESAMP_CONTROL to generate the 26-bit control Fs:Fs = (RESAMP_BASE &amp;lt;&amp;lt; 23) + RESAMP_CONTROLFs is the sample conversion ratio (I / O) used in the sample rate conversion section of the SCP.Fs is an unsigned number, where the full-scale range of values is 1 / (2^25) to ((2^26) - 1) / (2^25) = 2.98023224E-08 to 1.99999997NOTE: To convert a ratio into the 26-bit Fs, multiply by 2^25</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLINGFACTORCONTROL</name>
            <description>SCP RESAMPLING FACTOR CONTROL</description>
            <addressOffset>0x124</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESAMPCONTROL</name>
                <description>Resampling factor control. This is a 2's complement value which is combined with RESAMP_BASE to generate the 26-bit control Fs:Fs = (RESAMP_BASE &amp;lt;&amp;lt; 23) + RESAMP_CONTROL</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF0</name>
            <description>SCP RESAMPLERCOEFF 0</description>
            <addressOffset>0x128</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000C034</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R1R23</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>R0R24</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF1</name>
            <description>SCP RESAMPLERCOEFF 1</description>
            <addressOffset>0x12C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0007C0EC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R3R21</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>R2R22</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF2</name>
            <description>SCP RESAMPLERCOEFF 2</description>
            <addressOffset>0x130</addressOffset>
            <access>read-write</access>
            <resetValue>0x00190264</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R5R19</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>R4R20</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF3</name>
            <description>SCP RESAMPLERCOEFF 3</description>
            <addressOffset>0x134</addressOffset>
            <access>read-write</access>
            <resetValue>0x00360470</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R7R17</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>R6R18</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF4</name>
            <description>SCP RESAMPLERCOEFF 4</description>
            <addressOffset>0x138</addressOffset>
            <access>read-write</access>
            <resetValue>0x00584680</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R9R15</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>R8R16</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF5</name>
            <description>SCP RESAMPLERCOEFF 5</description>
            <addressOffset>0x13C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0074C7D0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R11R13</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>R10R14</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFF6</name>
            <description>SCP RESAMPLERCOEFF 6</description>
            <addressOffset>0x140</addressOffset>
            <access>read-write</access>
            <resetValue>0x007FC000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>R12</name>
                <description>Coefficient of resampler filter in 2's complement format.Only valid for 12-bit SCP, SCP_RESAMPLERCOEFF_ADDR/DATA must be used for 16-bit SCP.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERBYPASS</name>
            <description>SCP RESAMPLER BYPASS</description>
            <addressOffset>0x144</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESAMPBYPASS</name>
                <description>Used to set the bypass mode of the Resampler block.When bypass is set the Resampler block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
