ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>RESAMPLERCONTROL</name>
            <description>SCP RESAMPLER CONTROL</description>
            <addressOffset>0x148</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESAMPOUTGAIN</name>
                <description>Selects Resampler output gain to normalise the gain range (0.65 to 3.9):</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GainOf02511IsAp</name>
                    <description>Gain of 0.25 (&amp;gt;&amp;gt;11) is applied to the output of Resampler</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainOf0510IsApp</name>
                    <description>Gain of 0.5(&amp;gt;&amp;gt;10) is applied to the output of Resampler (default)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainOf109IsAppl</name>
                    <description>Gain of 1.0 (&amp;gt;&amp;gt;9) is applied to the output of Resampler</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainOf208IsAppl</name>
                    <description>Gain of 2.0 (&amp;gt;&amp;gt;8) is applied to the output of Resampler</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFFADDR</name>
            <description>SCP RESAMPLERCOEFF ADDR</description>
            <addressOffset>0x150</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPRESAMPLERCOEFFADDR</name>
                <description>Address for coefficient of resampler filter.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLERCOEFFDATA</name>
            <description>SCP RESAMPLERCOEFF DATA</description>
            <addressOffset>0x154</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPRESAMPLERCOEFFDATA</name>
                <description>Data for coefficient of resampler filter in 2's complement format.SCP_RESAMPLERCOEFF_ADDR automatically increments following write.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLINGTIMEACCUMENABLE</name>
            <description>SCP RESAMPLING TIME ACCUM ENABLE</description>
            <addressOffset>0x158</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMEACCUMENABLE</name>
                <description>Enable snapshot of resampler time accumulator to register TIME_ACCUM when the ED/AGC enables the SCP output (requires WLAN_EDAGC_START=1).Automatically cleared once the snapshot is captured.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESAMPLINGTIMEACCUM</name>
            <description>SCP RESAMPLING TIME ACCUM</description>
            <addressOffset>0x15C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMEACCUM</name>
                <description>Contains a snapshot of the resampler time accumulator captured when the ED/AGC enables the SCP output (when enabled with TIME_ACCUM_ENABLE=1).The snaphot stores the most significant 24-bits of the fractional part of the resampler time accumulator.Note that TIME_ACCUM_ENABLE is cleared once the snapshot is captured.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLENUMBER</name>
            <description>SCP SAMPLE NUMBER</description>
            <addressOffset>0x160</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLENUM</name>
                <description>The current state of the sample counter for the active frame.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLNUMBER</name>
            <description>SCP SYMBOL NUMBER</description>
            <addressOffset>0x164</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLNUM</name>
                <description>The current state of the symbol counter for the active frame.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLENUMBERA</name>
            <description>SCP SAMPLE NUMBER A</description>
            <addressOffset>0x168</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLENUMBERA</name>
                <description>The current state of the sample counter for frame A.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLNUMBERA</name>
            <description>SCP SYMBOL NUMBER A</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLNUMBERA</name>
                <description>The current state of the symbol counter for frame A.Can be written for immediate symbol counter update.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLENUMBERB</name>
            <description>SCP SAMPLE NUMBER B</description>
            <addressOffset>0x170</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLENUMBERB</name>
                <description>The current state of the sample counter for frame B.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLNUMBERB</name>
            <description>SCP SYMBOL NUMBER B</description>
            <addressOffset>0x174</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLNUMBERB</name>
                <description>The current state of the symbol counter for frame B.Can be written for immediate symbol counter update.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOMPARECONTROL</name>
            <description>SCP FRAME COMPARE CONTROL</description>
            <addressOffset>0x178</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NEWSCPPOWER</name>
                <description>This field determines the power state of the SCP following the next occurrence of the frame COMPARE_EVENT.</description>
                <lsb>14</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoChange</name>
                    <description>No change</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPowerMode</name>
                    <description>Low-power mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOn</name>
                    <description>Power-on</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOff</name>
                    <description>Power-off</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NEWADCPOWER</name>
                <description>This field determines the power state of the ADC following the next occurrence of the frame COMPARE_EVENT.</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoChange</name>
                    <description>No change</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPowerMode</name>
                    <description>Low-power mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOn</name>
                    <description>Power-on</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerOff</name>
                    <description>Power-off</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NEWACTIVEFRAME</name>
                <description>This field determines which will be the active frame following the next occurrence of the frame COMPARE_EVENT.</description>
                <lsb>18</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoChange</name>
                    <description>No change</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoChange1</name>
                    <description>No change</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FrameAActive</name>
                    <description>Frame A Active</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FrameBActive</name>
                    <description>Frame B active</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOMPARESYMBOL</name>
            <description>SCP FRAME COMPARE SYMBOL</description>
            <addressOffset>0x17C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COMPARESYMBOLA</name>
                <description>COMPARE_EVENT is asserted whenever the following condition is true:SYMBOL_NUMBER_A = COMPARE_SYMBOL_AandSAMPLE_NUMBER_A = COMPARE_SAMPLE_A.This will cause the assertion of IRQ_SCP if COMPARE_ENABLE is set.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOMPARESAMPLE</name>
            <description>SCP FRAME COMPARE SAMPLE</description>
            <addressOffset>0x180</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COMPARESAMPLEA</name>
                <description>COMPARE_EVENT is asserted whenever the following condition is true:SYMBOL_NUMBER_A = COMPARE_SYMBOL_AandSAMPLE_NUMBER_A = COMPARE_SAMPLE_A.This will cause the assertion of IRQ_SCP if COMPARE_ENABLE is set.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMFIFOOUT</name>
            <description>SCP SYM FIFO OUT</description>
            <addressOffset>0x188</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMFIFOOUT</name>
                <description>The symbol counter value for the current DMA output.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSFIFOCOUNT</name>
            <description>SCP TBUS FIFO COUNT</description>
            <addressOffset>0x18C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TBUSFIFOCOUNT</name>
                <description>The number of symbols that have are stored in the TBus output FIFO.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLPERIODA</name>
            <description>SCP SYMBOL PERIOD A</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLPERIODA</name>
                <description>The number of SCP samples between the starts of two successive symbols inframe A. Must be &amp;gt; 1 in current implementation for DMA synchronization to work.Note that setting this register sets SYMBOL_PERIOD_ADJUST_A to the same value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMESYMSA</name>
            <description>SCP FRAME SYMS A</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRAMESYMSA</name>
                <description>The number of symbols in frame A.Note that setting this register sets FRAME_SYMS_ADJUST_A to the same value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINALPERIODA</name>
            <description>SCP FINAL PERIOD A</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINALPERIODA</name>
                <description>The number of SCP samples during the last symbol of frame A.Note that setting this register sets FINAL_PERIOD_ADJUST_A to the same value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLPERIODADJUSTA</name>
            <description>SCP SYMBOL PERIOD ADJUST A</description>
            <addressOffset>0x1AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLPERIODADJUSTA</name>
                <description>The value written to this field defines the duration of the next symbol only. At the end of the adjusted symbol this field is automatically set to equal the value of SYMBOL_PERIOD_A.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMESYMSADJUSTA</name>
            <description>SCP FRAME SYMS ADJUST A</description>
            <addressOffset>0x1B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRAMESYMSADJUSTA</name>
                <description>The value written to this field defines the number of symbols in the current frame only. At the end of the current frame this field is automatically set to equal the value of FRAME_SYMS_A.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINALPERIODADJUSTA</name>
            <description>SCP FINAL PERIOD ADJUST A</description>
            <addressOffset>0x1B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINALPERIODADJUSTA</name>
                <description>The value written to this field defines the duration of the last symbol of the current frame only. At the end of the current frame this field is automatically set to equal the value of FINAL_PERIOD_A.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>APPLYPARAMETERSA</name>
            <description>SCP APPLY PARAMETERS A</description>
            <addressOffset>0x1B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>APPLYPARAMETERSA</name>
                <description>If the SYNCHRONISE_UPDATES bit is set in the Control register, a number of parameters are updated synchronously when the sample number is equal to (APPLY_PARAMETERS_A - 1). Thus, with the control bit set, writes to the parameter fields are held off until SAMPLE_NUMBER_A = (APPLY_PARAMETERS_A - 1). If SYNCHRONISE_UPDATES is not set, updates to the parameters occur immediately that they are written to the appropriate registers.The following parameter updates are synchronized:- GAIN_CONTROL_1- GAIN_CONTROL_2- OFFSET_CONTROL_1- OFFSET_CONTROL_2- DC_OFFSET_I- DC_OFFSET_Q- COARSE_GAIN- I_GAIN- Q_GAIN- I_TO_Q_GAIN- FS- FC</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLPERIODB</name>
            <description>SCP SYMBOL PERIOD B</description>
            <addressOffset>0x1E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLPERIODB</name>
                <description>The number of SCP samples between the starts of two successive symbols inframe B. Must be &amp;gt; 1 in current implementation for DMA synchronization to work.Note that setting this register sets SYMBOL_PERIOD_ADJUST_B to the same value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMESYMSB</name>
            <description>SCP FRAME SYMS B</description>
            <addressOffset>0x1E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRAMESYMSB</name>
                <description>The number of symbols in frame B.Note that setting this register sets FRAME_SYMS_ADJUST_B to the same value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINALPERIODB</name>
            <description>SCP FINAL PERIOD B</description>
            <addressOffset>0x1E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINALPERIODB</name>
                <description>The number of SCP samples during the last symbol of frame B.Note that setting this register sets FINAL_PERIOD_ADJUST_B to the same value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYMBOLPERIODADJUSTB</name>
            <description>SCP SYMBOL PERIOD ADJUST B</description>
            <addressOffset>0x1EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SYMBOLPERIODADJUSTB</name>
                <description>The value written to this field defines the duration of the next symbol only. At the end of the adjusted symbol this field is automatically set to equal the value of SYMBOL_PERIOD_B.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
