ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>FRAMESYMSADJUSTB</name>
            <description>SCP FRAME SYMS ADJUST B</description>
            <addressOffset>0x1F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRAMESYMSADJUSTB</name>
                <description>The value written to this field defines the number of symbols in the current frame only. At the end of the current frame this field is automatically set to equal the value of FRAME_SYMS_B.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINALPERIODADJUSTB</name>
            <description>SCP FINAL PERIOD ADJUST B</description>
            <addressOffset>0x1F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINALPERIODADJUSTB</name>
                <description>The value written to this field defines the duration of the last symbol of the current frame only. At the end of the current frame this field is automatically set to equal the value of FINAL_PERIOD_B.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>APPLYPARAMETERSB</name>
            <description>SCP Apply Parameters B</description>
            <addressOffset>0x1F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>APPLYPARAMETERSB</name>
                <description>If the SYNCHRONISE_UPDATES bit is set in the Control register, a number of parameters are updated synchronously when the sample number is equal to (APPLY_PARAMETERS_B - 1). Thus, with the control bit set, writes to the parameter fields are held off until SAMPLE_NUMBER_B = (APPLY_PARAMETERS_B - 1). If SYNCHRONISE_UPDATES is not set, updates to the parameters occur immediately that they are written to the appropriate registers.The following parameter updates are synchronized:The following parameter updates are synchronized:- GAIN_CONTROL_1- GAIN_CONTROL_2- OFFSET_CONTROL_1- OFFSET_CONTROL_2- DC_OFFSET_I- DC_OFFSET_Q- COARSE_GAIN- I_GAIN- Q_GAIN- I_TO_Q_GAIN- FS- FC</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFF0</name>
            <description>SCP COEFF 0</description>
            <addressOffset>0x220</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>A1</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>A0</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFF1</name>
            <description>SCP COEFF 1</description>
            <addressOffset>0x224</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>A3</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>A2</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFF2</name>
            <description>SCP COEFF 2</description>
            <addressOffset>0x228</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>A5</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>A4</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFF3</name>
            <description>SCP COEFF 3</description>
            <addressOffset>0x22C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>A7</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>A6</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFF4</name>
            <description>SCP COEFF 4</description>
            <addressOffset>0x230</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>A9</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>A8</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COEFF5</name>
            <description>SCP COEFF 5</description>
            <addressOffset>0x234</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>A11</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>2</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>A10</name>
                <description>Coefficient of final decimation filter in 2's complement format.Only valid for 12-bit SCP, SCP_COEFF_ADDR/DATA must be used for 16-bit SCP.NOTE: use FIR_COEFF_SET_SEL to select the coefficients set.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIRBYPASS</name>
            <description>SCP FIR BYPASS</description>
            <addressOffset>0x238</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIRBYPASS</name>
                <description>Used to set the bypass mode of the FIR block.When bypass is set the FIR block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FIRCONTROL</name>
            <description>SCP FIR CONTROL</description>
            <addressOffset>0x23C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIROUTGAIN</name>
                <description>Selects Decimating FIR output gain to normalise the gain range (2.4 to 23):0. Gain of 1/32 (&amp;gt;&amp;gt;14 + x) is applied to the output of Final Stage Decimation - FIR Filter1. Gain of 1/16 (&amp;gt;&amp;gt;13 + x) is applied to the output of Final Stage Decimation - FIR Filter2. Gain of 1/8(&amp;gt;&amp;gt;12 + x) is applied to the output of Final Stage Decimation - FIR Filter3. Gain of 1/4(&amp;gt;&amp;gt;11 + x) is applied to the output of Final Stage Decimation - FIR Filter4. Gain of 1/2(&amp;gt;&amp;gt;10 + x) is applied to the output of Final Stage Decimation - FIR Filter5. Gain of 1.0(&amp;gt;&amp;gt;9 + x)is applied to the output of Final Stage Decimation - FIR Filter (default)6. Gain of 2.0(&amp;gt;&amp;gt;8 + x)is applied to the output of Final Stage Decimation - FIR Filter7. Gain of 4.0(&amp;gt;&amp;gt;7 + x)is applied to the output of Final Stage Decimation - FIR Filter8. Gain of 8.0(&amp;gt;&amp;gt;6 + x)is applied to the output of Final Stage Decimation - FIR Filter9. Gain of 16.0 (&amp;gt;&amp;gt;5 + x)is applied to the output of Final Stage Decimation - FIR FilterWhere x is 0 for 12-bit SCP and 7 for 16-bit SCP.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FIRCOEFFSETSEL</name>
                <description>Selects Decimating FIR Coefficients set (reading and writing):</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OfdmSet</name>
                    <description>OFDM set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DsssSet</name>
                    <description>DSSS set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FIRDYNAMICCOEFFS</name>
                <description>Enable dynamic decimation FIR coefficients selection (set 0 for OFDM, set 1 for DSSS).When disabled the set 0 is only used.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FIRITERATIONNUM</name>
                <description>Number of FIR filter iteration cycles to perform per sample.The FIR filter contains a filter with 24 taps.Making use of the same filter for multiple cycles creates a virtual FIR filter with more taps.This field should be set as floor (FIR_VIRTUAL_TAP_NUM / FIR_REAL_TAP_NUM)-1, where FIR_VIRTUAL_TAP_NUM refers to the number of taps that are needed for the current application.Only valid for 16-bit SCP.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCH0</name>
            <description>SCP NOTCH 0</description>
            <addressOffset>0x240</addressOffset>
            <access>read-write</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTCH0ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableTheNotchFilte</name>
                    <description>Disable the notch filter (NOTE: the NotchEnergy register is unaffected)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableTheNotchFilter</name>
                    <description>Enable the notch filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH0L</name>
                <description>Notch filter gain linear valueNOTE: these multiplier values become increasingly inaccurate as the value of SHIFT is reduced below 8. For values of SHIFT&amp;lt;8, it is advisable to evaluate the notch bandwidth using simulation or calculation.</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L010DbBw88BwFo</name>
                    <description>L=0 -10 dB BW ~=8/8 * BWfor L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L110DbBw98BwFo</name>
                    <description>L=1 -10 dB BW ~=9/8 * BWfor L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L210DbBw108BwF</name>
                    <description>L=2 -10 dB BW ~=10/8 * BWfor L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L310DbBw118BwF</name>
                    <description>L=3 -10 dB BW ~=11/8 * BWfor L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L410DbBw128BwF</name>
                    <description>L=4 -10 dB BW ~=12/8 * BWfor L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L510DbBw138BwF</name>
                    <description>L=5 -10 dB BW ~=13/8 * BWfor L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L610DbBw148BwF</name>
                    <description>L=6 -10 dB BW ~=14/8 * BWfor L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L710DbBw158BwF</name>
                    <description>L=7 -10 dB BW ~=15/8 * BWfor L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH0S</name>
                <description>Notch filter gain shift value</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Shift1410DbBwFs</name>
                    <description>SHIFT=14 -10 dB BW ~= Fs / 20000for L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1310DbBwFs</name>
                    <description>SHIFT=13 -10 dB BW ~= Fs / 10000for L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1210DbBwFs</name>
                    <description>SHIFT=12 -10 dB BW ~= Fs / 5000for L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1110DbBwFs</name>
                    <description>SHIFT=11 -10 dB BW ~= Fs / 2500for L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1010DbBwFs</name>
                    <description>SHIFT=10 -10 dB BW ~= Fs / 1250for L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift910DbBwFs6</name>
                    <description>SHIFT=9 -10 dB BW ~= Fs / 600for L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift810DbBwFs3</name>
                    <description>SHIFT=8 -10 dB BW ~= Fs / 300for L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift710DbBwFs1</name>
                    <description>SHIFT=7 -10 dB BW ~= Fs / 140for L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift610DbBwFs6</name>
                    <description>SHIFT=6 -10 dB BW ~= Fs / 65for L=0</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift510DbBwFs2</name>
                    <description>SHIFT=5 -10 dB BW ~= Fs / 28for L=0</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift410DbBwFs9</name>
                    <description>SHIFT=4 -10 dB BW ~= Fs / 9for L=0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH0FREQ</name>
                <description>Defines the centre frequency of the first notch of the ACI / CCI filter.FREQ is a signed (2's complement) number, where the full-scale negative value represents a frequency of - R_CLK/2 (where R_CLK is the output sample rate).</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
