ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>NOTCH1</name>
            <description>SCP NOTCH 1</description>
            <addressOffset>0x244</addressOffset>
            <access>read-write</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTCH1ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableTheNotchFilte</name>
                    <description>Disable the notch filter (NOTE: the NotchEnergy register is unaffected)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableTheNotchFilter</name>
                    <description>Enable the notch filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH1L</name>
                <description>Notch filter gain linear valueNOTE: these multiplier values become increasingly inaccurate as the value of SHIFT is reduced below 8. For values of SHIFT&amp;lt;8, it is advisable to evaluate the notch bandwidth using simulation or calculation.</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L010DbBw88BwFo</name>
                    <description>L=0 -10 dB BW ~=8/8 * BWfor L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L110DbBw98BwFo</name>
                    <description>L=1 -10 dB BW ~=9/8 * BWfor L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L210DbBw108BwF</name>
                    <description>L=2 -10 dB BW ~=10/8 * BWfor L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L310DbBw118BwF</name>
                    <description>L=3 -10 dB BW ~=11/8 * BWfor L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L410DbBw128BwF</name>
                    <description>L=4 -10 dB BW ~=12/8 * BWfor L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L510DbBw138BwF</name>
                    <description>L=5 -10 dB BW ~=13/8 * BWfor L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L610DbBw148BwF</name>
                    <description>L=6 -10 dB BW ~=14/8 * BWfor L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L710DbBw158BwF</name>
                    <description>L=7 -10 dB BW ~=15/8 * BWfor L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH1S</name>
                <description>Notch filter gain shift value</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Shift1410DbBwFs</name>
                    <description>SHIFT=14 -10 dB BW ~= Fs / 20000for L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1310DbBwFs</name>
                    <description>SHIFT=13 -10 dB BW ~= Fs / 10000for L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1210DbBwFs</name>
                    <description>SHIFT=12 -10 dB BW ~= Fs / 5000for L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1110DbBwFs</name>
                    <description>SHIFT=11 -10 dB BW ~= Fs / 2500for L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1010DbBwFs</name>
                    <description>SHIFT=10 -10 dB BW ~= Fs / 1250for L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift910DbBwFs6</name>
                    <description>SHIFT=9 -10 dB BW ~= Fs / 600for L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift810DbBwFs3</name>
                    <description>SHIFT=8 -10 dB BW ~= Fs / 300for L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift710DbBwFs1</name>
                    <description>SHIFT=7 -10 dB BW ~= Fs / 140for L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift610DbBwFs6</name>
                    <description>SHIFT=6 -10 dB BW ~= Fs / 65for L=0</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift510DbBwFs2</name>
                    <description>SHIFT=5 -10 dB BW ~= Fs / 28for L=0</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift410DbBwFs9</name>
                    <description>SHIFT=4 -10 dB BW ~= Fs / 9for L=0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH1FREQ</name>
                <description>Defines the centre frequency of the first notch of the ACI / CCI filter.FREQ is a signed (2's complement) number, where the full-scale negative value represents a frequency of - R_CLK/2 (where R_CLK is the output sample rate).</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCH2</name>
            <description>SCP NOTCH 2</description>
            <addressOffset>0x248</addressOffset>
            <access>read-write</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTCH2ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableTheNotchFilte</name>
                    <description>Disable the notch filter (NOTE: the NotchEnergy register is unaffected)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableTheNotchFilter</name>
                    <description>Enable the notch filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH2L</name>
                <description>Notch filter gain linear valueNOTE: these multiplier values become increasingly inaccurate as the value of SHIFT is reduced below 8. For values of SHIFT&amp;lt;8, it is advisable to evaluate the notch bandwidth using simulation or calculation.</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L010DbBw88BwFo</name>
                    <description>L=0 -10 dB BW ~=8/8 * BWfor L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L110DbBw98BwFo</name>
                    <description>L=1 -10 dB BW ~=9/8 * BWfor L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L210DbBw108BwF</name>
                    <description>L=2 -10 dB BW ~=10/8 * BWfor L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L310DbBw118BwF</name>
                    <description>L=3 -10 dB BW ~=11/8 * BWfor L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L410DbBw128BwF</name>
                    <description>L=4 -10 dB BW ~=12/8 * BWfor L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L510DbBw138BwF</name>
                    <description>L=5 -10 dB BW ~=13/8 * BWfor L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L610DbBw148BwF</name>
                    <description>L=6 -10 dB BW ~=14/8 * BWfor L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L710DbBw158BwF</name>
                    <description>L=7 -10 dB BW ~=15/8 * BWfor L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH2S</name>
                <description>Notch filter gain shift value</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Shift1410DbBwFs</name>
                    <description>SHIFT=14 -10 dB BW ~= Fs / 20000for L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1310DbBwFs</name>
                    <description>SHIFT=13 -10 dB BW ~= Fs / 10000for L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1210DbBwFs</name>
                    <description>SHIFT=12 -10 dB BW ~= Fs / 5000for L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1110DbBwFs</name>
                    <description>SHIFT=11 -10 dB BW ~= Fs / 2500for L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1010DbBwFs</name>
                    <description>SHIFT=10 -10 dB BW ~= Fs / 1250for L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift910DbBwFs6</name>
                    <description>SHIFT=9 -10 dB BW ~= Fs / 600for L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift810DbBwFs3</name>
                    <description>SHIFT=8 -10 dB BW ~= Fs / 300for L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift710DbBwFs1</name>
                    <description>SHIFT=7 -10 dB BW ~= Fs / 140for L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift610DbBwFs6</name>
                    <description>SHIFT=6 -10 dB BW ~= Fs / 65for L=0</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift510DbBwFs2</name>
                    <description>SHIFT=5 -10 dB BW ~= Fs / 28for L=0</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift410DbBwFs9</name>
                    <description>SHIFT=4 -10 dB BW ~= Fs / 9for L=0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH2FREQ</name>
                <description>Defines the centre frequency of the first notch of the ACI / CCI filter.FREQ is a signed (2's complement) number, where the full-scale negative value represents a frequency of - R_CLK/2 (where R_CLK is the output sample rate).</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCH3</name>
            <description>SCP NOTCH 3</description>
            <addressOffset>0x24C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTCH3ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableTheNotchFilte</name>
                    <description>Disable the notch filter (NOTE: the NotchEnergy register is unaffected)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableTheNotchFilter</name>
                    <description>Enable the notch filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH3L</name>
                <description>Notch filter gain linear valueNOTE: these multiplier values become increasingly inaccurate as the value of SHIFT is reduced below 8. For values of SHIFT&amp;lt;8, it is advisable to evaluate the notch bandwidth using simulation or calculation.</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L010DbBw88BwFo</name>
                    <description>L=0 -10 dB BW ~=8/8 * BWfor L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L110DbBw98BwFo</name>
                    <description>L=1 -10 dB BW ~=9/8 * BWfor L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L210DbBw108BwF</name>
                    <description>L=2 -10 dB BW ~=10/8 * BWfor L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L310DbBw118BwF</name>
                    <description>L=3 -10 dB BW ~=11/8 * BWfor L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L410DbBw128BwF</name>
                    <description>L=4 -10 dB BW ~=12/8 * BWfor L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L510DbBw138BwF</name>
                    <description>L=5 -10 dB BW ~=13/8 * BWfor L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L610DbBw148BwF</name>
                    <description>L=6 -10 dB BW ~=14/8 * BWfor L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L710DbBw158BwF</name>
                    <description>L=7 -10 dB BW ~=15/8 * BWfor L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH3S</name>
                <description>Notch filter gain shift value</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Shift1410DbBwFs</name>
                    <description>SHIFT=14 -10 dB BW ~= Fs / 20000for L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1310DbBwFs</name>
                    <description>SHIFT=13 -10 dB BW ~= Fs / 10000for L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1210DbBwFs</name>
                    <description>SHIFT=12 -10 dB BW ~= Fs / 5000for L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1110DbBwFs</name>
                    <description>SHIFT=11 -10 dB BW ~= Fs / 2500for L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1010DbBwFs</name>
                    <description>SHIFT=10 -10 dB BW ~= Fs / 1250for L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift910DbBwFs6</name>
                    <description>SHIFT=9 -10 dB BW ~= Fs / 600for L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift810DbBwFs3</name>
                    <description>SHIFT=8 -10 dB BW ~= Fs / 300for L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift710DbBwFs1</name>
                    <description>SHIFT=7 -10 dB BW ~= Fs / 140for L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift610DbBwFs6</name>
                    <description>SHIFT=6 -10 dB BW ~= Fs / 65for L=0</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift510DbBwFs2</name>
                    <description>SHIFT=5 -10 dB BW ~= Fs / 28for L=0</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift410DbBwFs9</name>
                    <description>SHIFT=4 -10 dB BW ~= Fs / 9for L=0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH3FREQ</name>
                <description>Defines the centre frequency of the first notch of the ACI / CCI filter.FREQ is a signed (2's complement) number, where the full-scale negative value represents a frequency of - R_CLK/2 (where R_CLK is the output sample rate).</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
