ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>NOTCH4</name>
            <description>SCP NOTCH 4</description>
            <addressOffset>0x250</addressOffset>
            <access>read-write</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTCH4ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableTheNotchFilte</name>
                    <description>Disable the notch filter (NOTE: the NotchEnergy register is unaffected)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableTheNotchFilter</name>
                    <description>Enable the notch filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH4L</name>
                <description>Notch filter gain linear valueNOTE: these multiplier values become increasingly inaccurate as the value of SHIFT is reduced below 8. For values of SHIFT&amp;lt;8, it is advisable to evaluate the notch bandwidth using simulation or calculation.</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L010DbBw88BwFo</name>
                    <description>L=0 -10 dB BW ~=8/8 * BWfor L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L110DbBw98BwFo</name>
                    <description>L=1 -10 dB BW ~=9/8 * BWfor L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L210DbBw108BwF</name>
                    <description>L=2 -10 dB BW ~=10/8 * BWfor L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L310DbBw118BwF</name>
                    <description>L=3 -10 dB BW ~=11/8 * BWfor L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L410DbBw128BwF</name>
                    <description>L=4 -10 dB BW ~=12/8 * BWfor L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L510DbBw138BwF</name>
                    <description>L=5 -10 dB BW ~=13/8 * BWfor L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L610DbBw148BwF</name>
                    <description>L=6 -10 dB BW ~=14/8 * BWfor L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L710DbBw158BwF</name>
                    <description>L=7 -10 dB BW ~=15/8 * BWfor L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH4S</name>
                <description>Notch filter gain shift value</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Shift1410DbBwFs</name>
                    <description>SHIFT=14 -10 dB BW ~= Fs / 20000for L=0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1310DbBwFs</name>
                    <description>SHIFT=13 -10 dB BW ~= Fs / 10000for L=0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1210DbBwFs</name>
                    <description>SHIFT=12 -10 dB BW ~= Fs / 5000for L=0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1110DbBwFs</name>
                    <description>SHIFT=11 -10 dB BW ~= Fs / 2500for L=0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift1010DbBwFs</name>
                    <description>SHIFT=10 -10 dB BW ~= Fs / 1250for L=0</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift910DbBwFs6</name>
                    <description>SHIFT=9 -10 dB BW ~= Fs / 600for L=0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift810DbBwFs3</name>
                    <description>SHIFT=8 -10 dB BW ~= Fs / 300for L=0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift710DbBwFs1</name>
                    <description>SHIFT=7 -10 dB BW ~= Fs / 140for L=0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift610DbBwFs6</name>
                    <description>SHIFT=6 -10 dB BW ~= Fs / 65for L=0</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift510DbBwFs2</name>
                    <description>SHIFT=5 -10 dB BW ~= Fs / 28for L=0</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shift410DbBwFs9</name>
                    <description>SHIFT=4 -10 dB BW ~= Fs / 9for L=0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCH4FREQ</name>
                <description>Defines the centre frequency of the first notch of the ACI / CCI filter.FREQ is a signed (2's complement) number, where the full-scale negative value represents a frequency of - R_CLK/2 (where R_CLK is the output sample rate).</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY0I</name>
            <description>SCP NOTCHENERGY 0 I</description>
            <addressOffset>0x254</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IENERGY0</name>
                <description>Represents a measure of the negated in-phase signal component suppressed by notch filter 0 in 2' complement format.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY0Q</name>
            <description>SCP NOTCHENERGY 0 Q</description>
            <addressOffset>0x258</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QENERGY0</name>
                <description>Represents a measure of the negated quadrature signal component suppressed by notch filter 0 in 2' complement format.This register will hold the current Q value after a read command is issued to the SCP_NOTCHENERGY_0_I register until this register is read.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY1I</name>
            <description>SCP NOTCHENERGY 1 I</description>
            <addressOffset>0x25C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IENERGY1</name>
                <description>Represents a measure of the negated in-phase signal component suppressed by notch filter 1 in 2's complement format.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY1Q</name>
            <description>SCP NOTCHENERGY 1 Q</description>
            <addressOffset>0x260</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QENERGY1</name>
                <description>Represents a measure of the negated quadrature signal component suppressed by notch filter 1 in 2' complement format.This register will hold the current Q value after a read command is issued to the SCP_NOTCHENERGY_1_I register until this register is read.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY2I</name>
            <description>SCP NOTCHENERGY 2 I</description>
            <addressOffset>0x264</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IENERGY2</name>
                <description>Represents a measure of the negated in-phase signal component suppressed by notch filter 2 in 2' complement format.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY2Q</name>
            <description>SCP NOTCHENERGY 2 Q</description>
            <addressOffset>0x268</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QENERGY2</name>
                <description>Represents a measure of the negated quadrature signal component suppressed by notch filter 2 in 2' complement format.This register will hold the current Q value after a read command is issued to the SCP_NOTCHENERGY_2_I register until this register is read.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY3I</name>
            <description>SCP NOTCHENERGY 3 I</description>
            <addressOffset>0x26C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IENERGY3</name>
                <description>Represents a measure of the negated in-phase signal component suppressed by notch filter 3 in 2' complement format.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY3Q</name>
            <description>SCP NOTCHENERGY 3 Q</description>
            <addressOffset>0x270</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QENERGY3</name>
                <description>Represents a measure of the negated quadrature signal component suppressed by notch filter 3 in 2' complement format.This register will hold the current Q value after a read command is issued to the SCP_NOTCHENERGY_3_I register until this register is read.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY4I</name>
            <description>SCP NOTCHENERGY 4 I</description>
            <addressOffset>0x274</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IENERGY4</name>
                <description>Represents a measure of the negated in-phase signal component suppressed by notch filter 4 in 2' complement format.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHENERGY4Q</name>
            <description>SCP NOTCHENERGY 4 Q</description>
            <addressOffset>0x278</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QENERGY4</name>
                <description>Represents a measure of the negated quadrature signal component suppressed by notch filter 4 in 2' complement format.This register will hold the current Q value after a read command is issued to the SCP_NOTCHENERGY_4_I register until this register is read.13-bit value sign extended to 16 bits in bits 23:8 valid for 12-bit SCP, 17-bit value in bits 23:7 valid for 16-bit SCP.</description>
                <lsb>7</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOTCHBYPASS</name>
            <description>SCP NOTCH BYPASS</description>
            <addressOffset>0x27C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWCONTROLNOTCH0</name>
                <description>Determine the Notch filter 0 enabling/disabling control mode:0. Notch filter 0 is enabled if SCP_NOTCH_0.NOTCH0_ENABLE register field is set.1. Notch filter 0 is dynamically controlled using DSSS or OFDM information from ED block: enable notch when DSSS packet is detected, disable when OFDM packet is detected.*Note: mode 1 requires SCP_NOTCH_0.NOTCH0_ENABLE = 1 and SCP_NOTCH_BYPASS.NOTCH_BYPASS = 0</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>NOTCHACCUM</name>
                <description>Determines whether notch phase accumulators are reset when NOTCHn_FREQ registers are written to.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetAccumulationWhe</name>
                    <description>Reset accumulation when NOTCHn_FREQ registers are written to.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ContinueAccumulation</name>
                    <description>Continue accumulation when NOTCHn_FREQ registers are written to.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTCHBYPASS</name>
                <description>Used to set the bypass mode of the Notch filter block.When bypass is set the Notch filter block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISECONTROL</name>
            <description>SCP IMPULSE NOISE CONTROL</description>
            <addressOffset>0x280</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOISEFILTERENABLE</name>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IQSamplesAreNotDele</name>
                    <description>I/Q samples are not deleted but counters operate normally</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IQSamplesAreDeleted</name>
                    <description>I/Q samples are deleted as indicated by deletion logic</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISEBURSTCOUNT</name>
            <description>SCP IMPULSE NOISE BURST COUNT</description>
            <addressOffset>0x284</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOISEBURSTCOUNT</name>
                <description>The number of SCP sample bursts deleted by the impulse noise filter.This value is latched and held when AGC_COUNTS_EVENT is asserted.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISESAMPLECOUNT</name>
            <description>SCP IMPULSE NOISE SAMPLE COUNT</description>
            <addressOffset>0x288</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOISESAMPLECOUNT</name>
                <description>The number of SCP samples deleted by the impulse noise filter.This value is latched and held when AGC_COUNTS_EVENT is asserted.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISEENERGY</name>
            <description>SCP IMPULSE NOISE ENERGY</description>
            <addressOffset>0x28C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOISEENERGY</name>
                <description>The sum of energy in all the SCP samples deleted by the impulse noise filter.This value is latched and held when AGC_COUNTS_EVENT is asserted.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISETHRESHOLD1</name>
            <description>SCP IMPULSE NOISE THRESHOLD 1</description>
            <addressOffset>0x290</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>T1</name>
                <description>Energy threshold for 1-sample window.Setting 0xFF disables this section.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>T2</name>
                <description>Energy threshold for 2-sample window.Setting 0xFF disables this section.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>T3</name>
                <description>Energy threshold for 3-sample window.Setting 0xFF disables this section.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISETHRESHOLD2</name>
            <description>SCP IMPULSE NOISE THRESHOLD 2</description>
            <addressOffset>0x294</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>T4</name>
                <description>Energy threshold for 4-sample window.Setting 0xFF disables this section.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>T5</name>
                <description>Energy threshold for 5-sample window.Setting 0xFF disables this section.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>T6</name>
                <description>Energy threshold for 6-sample window.Setting 0xFF disables this section.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
