ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>IMPULSENOISETHRESHOLD3</name>
            <description>SCP IMPULSE NOISE THRESHOLD 3</description>
            <addressOffset>0x298</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>T7</name>
                <description>Energy threshold for 7-sample window.Setting 0xFF disables this section.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>T8</name>
                <description>Energy threshold for 8-sample window.Setting 0xFF disables this section.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>T9</name>
                <description>Energy threshold for 9-sample window.Setting 0xFF disables this section.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISETHRESHOLD4</name>
            <description>SCP IMPULSE NOISE THRESHOLD 4</description>
            <addressOffset>0x29C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>T10</name>
                <description>Energy threshold for 10-sample window.Setting 0xFF disables this section.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>T11</name>
                <description>Energy threshold for 11-sample window.Setting 0xFF disables this section.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>T12</name>
                <description>Energy threshold for 12-sample window.Setting 0xFF disables this section.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISETHRESHOLD5</name>
            <description>SCP IMPULSE NOISE THRESHOLD 5</description>
            <addressOffset>0x2A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>T13</name>
                <description>Energy threshold for 13-sample window.Setting 0xFF disables this section.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>T14</name>
                <description>Energy threshold for 14-sample window.Setting 0xFF disables this section.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>T15</name>
                <description>Energy threshold for 15-sample window.Setting 0xFF disables this section.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSENOISETHRESHOLD6</name>
            <description>SCP IMPULSE NOISE THRESHOLD 6</description>
            <addressOffset>0x2A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>T16</name>
                <description>Energy threshold for 16-sample window.Setting 0xFF disables this section.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMPULSEFILTERBYPASS</name>
            <description>SCP IMPULSE FILTER BYPASS</description>
            <addressOffset>0x2A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IMPBYPASS</name>
                <description>Used to set the bypass mode of the Impulse filter block.When bypass is set the Impulse filter block is powered down and data passes around it unaltered.When set to Normal the block operates as programmed by the registers that control it.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BlockBypassedOverru</name>
                    <description>Block Bypassed (overrules any other block settings)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBINPHASEDLY</name>
            <description>SCP IQ IMB INPHASE DLY</description>
            <addressOffset>0x2AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQINPHASEDELAY</name>
                <description>Delay line for Inphase stream. This is a unsigned value.The maximum supported value is 14.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF1</name>
            <description>SCP IQ IMB COEFF1</description>
            <addressOffset>0x2B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000400</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB0</name>
                <description>Filter Coefficient B0 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB1</name>
                <description>Filter Coefficient B1 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF2</name>
            <description>SCP IQ IMB COEFF2</description>
            <addressOffset>0x2B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB2</name>
                <description>Filter Coefficient B2 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB3</name>
                <description>Filter Coefficient B3 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF3</name>
            <description>SCP IQ IMB COEFF3</description>
            <addressOffset>0x2B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB4</name>
                <description>Filter Coefficient B4 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB5</name>
                <description>Filter Coefficient B5 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF4</name>
            <description>SCP IQ IMB COEFF4</description>
            <addressOffset>0x2BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB6</name>
                <description>Filter Coefficient B6 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB7</name>
                <description>Filter Coefficient B7 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF5</name>
            <description>SCP IQ IMB COEFF5</description>
            <addressOffset>0x2C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB8</name>
                <description>Filter Coefficient B8 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB9</name>
                <description>Filter Coefficient B9 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF6</name>
            <description>SCP IQ IMB COEFF6</description>
            <addressOffset>0x2C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB10</name>
                <description>Filter Coefficient B10 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB11</name>
                <description>Filter Coefficient B11 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF7</name>
            <description>SCP IQ IMB COEFF7</description>
            <addressOffset>0x2C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB12</name>
                <description>Filter Coefficient B12 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB13</name>
                <description>Filter Coefficient B13 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF8</name>
            <description>SCP IQ IMB COEFF8</description>
            <addressOffset>0x2CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB14</name>
                <description>Filter Coefficient B14 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_BYPASS = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBBYPASS</name>
            <description>SCP IQ IMB BYPASS</description>
            <addressOffset>0x2D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQIMBALANCEBYPASS</name>
                <description>Used to set the bypass mode of the IQ imbalance compensation block:</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IqImbalanceCompensat</name>
                    <description>IQ imbalance compensation is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IqImbalanceCompensta</name>
                    <description>IQ imbalance compenstation block is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DRMDECIMATORCTRL</name>
            <description>SCP DRM DECIMATOR CTRL</description>
            <addressOffset>0x2D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRMDECRATIO</name>
                <description>Decimation ratio (if DRM_DEC_EN is set):0: Decimate by 1 (no decimation)1: Decimate by 215: Decimate by 16</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DRMDECEN</name>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BypassDrmDecimator</name>
                    <description>Bypass DRM decimator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableDecimation</name>
                    <description>Enable decimation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>8</dim>
            <dimIncrement>0x00C</dimIncrement>
            <name>EARLYGAINLUT[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_SCP_EARLYGAINLUT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x2E0</addressOffset>
            <register>
              <name>EARLYFINEGAINI</name>
              <description>Description cluster: SCP EARLY FINE GAIN I</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00200000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>EARLYIGAIN</name>
                  <description>2's complement value that multiplies I value from SCP.This is a linear gain where 0x800 represents the 0dB point, thus the fine gain is EARLY_I_GAIN/0x800.Bits 23:13 valid for 12-bit SCP, bits 23:10 valid for 16-bit SCP.</description>
                  <lsb>10</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>EARLYFINEGAINQ</name>
              <description>Description cluster: SCP EARLY FINE GAIN Q</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00200000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>EARLYQGAIN</name>
                  <description>2's complement value that multiplies Q value from SCP.This is a linear gain where 0x800 represents the 0dB point, thus the fine gain is EARLY_Q_GAIN/0x800.Bits 23:13 valid for 12-bit SCP, bits 23:10 valid for 16-bit SCP.</description>
                  <lsb>10</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>EARLYANGLEIQ</name>
              <description>Description cluster: SCP EARLY ANGLE IQ</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>EARLYITOQGAIN</name>
                  <description>2's complement value that multiplies I value before addition to Q value in the early gain block.Qout = Q + (I * EARLY_I_TO_Q_GAIN &amp;gt;&amp;gt; 13).Bits 23:13 valid for 12-bit SCP, bits 23:10 valid for 16-bit SCP.</description>
                  <lsb>10</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>COREID</name>
            <description>SCP CORE ID</description>
            <addressOffset>0x340</addressOffset>
            <access>read-only</access>
            <resetValue>0x000F0200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CORECONFIG</name>
                <description>Configuration of the core.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>COREID</name>
                <description>Identifies the member of the IP group.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GROUPID</name>
                <description>Identifies core as part of an IMG IP family group.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COREREVISION</name>
            <description>SCP CORE REVISION</description>
            <addressOffset>0x350</addressOffset>
            <access>read-only</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAINTENANCEREV</name>
                <description>Maintenance Release Revision</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MINORREV</name>
                <description>Core Minor Release Revision</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MAJORREV</name>
                <description>Family Major Release Revision</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GNSSOUTPUTFORMAT</name>
            <description>SCP GNSS OUTPUT FORMAT</description>
            <addressOffset>0x360</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GNSSOUTPUTFORMAT</name>
                <description>SCP, GNSS Location Core output format selection.0:1x I/Q pair(12-bits per component)This represents standard SCP operation.1:3x I/Q pairs(4-bits per component)2:4x I/Q pairs(3-bits per component)3:6x I/Q pairs(2-bits per component)4: 12x I/Q pairs(1-bitper component)Other values are reserved and must not be used.Where a non-zero value is set in this register the 12-bit samples in each pair are reduced to the k-bit width indicated by selecting the k MSBs from each 12-bit sample.Setting this register to a non-zero value assumes TBUS_OUTPUT_FORMAT=0</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
