ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>TBUSCONTROL</name>
            <description>SCP TBUS CONTROL</description>
            <addressOffset>0x380</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TBUSOUTPUTFORMAT</name>
                <description>Used to select TBus output format:0 : 12-bit real in upper and 12-bit imaginary in lower 24 bits of TBus output (default).1 : Alternating 16-bit imaginary followed by 16-bit real, left aligned in 24-bits of output TBus.8-bit lsbs are zero padded and full 24 bits transferred to memory by EDC for processing as 24-bit double by MCP.This case is only relevant on 16-bit SCPs.Note reference to this register in the description of register GNSS_OUTPUT_FORMAT.2 : Alternating 16-bit imaginary followed by 16-bit real, right aligned in 24-bits of output TBus.Sign extended to 24 bits but in practice only lower 16 bits will be transferred to memory by EDC for processing as 32-bit complex by MCU.This case is only relevant on 16-bit SCPs.Note reference to this register in the description of register GNSS_OUTPUT_FORMAT.3 : Alternating 12-bit real followed by 12-bit imaginary, where each 12-bit word is left shifted by 4 and signed extended to 24-bits.</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TBUSOUTPUTSTALL</name>
                <description>Used to enable or disable stalling of SCP when output FIFO is full:</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StallingOfScpDisable</name>
                    <description>Stalling of SCP disabled when output FIFO is full.TBUS_OVERFLOW_EVENT flagged when SCP output overflows TBus output FIFO.OVERFLOW_EVENT can also be flagged when input data rate too high for enabled processing (i.e. due to re-sample factor, or enabling of notch/impulse filters).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StallingOfScpEnabled</name>
                    <description>Stalling of SCP enabled when output FIFO is full.TBUS_OVERFLOW_EVENT not flagged, only OVERFLOW_EVENT flagged when input data rate too high for enabled processing (i.e. due to re-sample factor, or enabling of notch/impulse filters), or as a result of EDC TBus job rate being too slow.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TBUSOUTPUTENABLE</name>
                <description>Used to enable or disable output of next symbol to TBus:</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToTbusDisabled</name>
                    <description>Output to TBus disabled at end of next symbol.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OutputToTbusEnabledA</name>
                    <description>Output to TBus enabled at start of next symbol.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TBUSOUTPUTMODE</name>
                <description>Used to enable output to TBus:</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToTbusDisabled</name>
                    <description>Output to TBus disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OutputToTbusEnabled</name>
                    <description>Output to TBus enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ISCRCONTROL</name>
            <description>SCP ISCR CONTROL</description>
            <addressOffset>0x390</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPISCRENABLE</name>
                <description>Control for ISCR Counter:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ISCRCOUNTER0</name>
            <description>SCP ISCR COUNTER0</description>
            <addressOffset>0x394</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ISCRCOUNTERLOW</name>
                <description>lowest 24 bits of iscr_counter value clocked at scp output rate. Writable register to manually set the low bits of the iscr counter value</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ISCRCOUNTER1</name>
            <description>SCP ISCR COUNTER1</description>
            <addressOffset>0x398</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ISCRCOUNTERHIGH</name>
                <description>highest 24 bits of iscr_counter value clocked at scp output rate. Writable register to manually set the high bits fo the iscr counter value</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ISCRSTATUS0</name>
            <description>SCP ISCR STATUS0</description>
            <addressOffset>0x39C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ISCRSYMSTARTLOW</name>
                <description>lowest 24 bits of iscr_counter value at start of the last scp symbol.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ISCRSTATUS1</name>
            <description>SCP ISCR STATUS1</description>
            <addressOffset>0x3A0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ISCRSYMSTARTHIGH</name>
                <description>highest 24 bits of iscr_counter value at start of the last scp symbol.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIGURATION</name>
            <description>SCP CONFIGURATION</description>
            <addressOffset>0x3A4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCPCONFIGURATIONWIDTH</name>
                <description>Width configuration:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>12Bit</name>
                    <description>12-bit</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Bit</name>
                    <description>16-bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONDRMDECIM</name>
                <description>DRM decimator configuration:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONDCMON</name>
                <description>DC monitor configuration:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONDCOFF</name>
                <description>DC offset controlconfiguration:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONEARLYGAIN</name>
                <description>Early gain control configuration:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONAGCMON</name>
                <description>AGC monitor configuration:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONIQCORR</name>
                <description>IQ correlatorconfiguration:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONMIXER</name>
                <description>Mixer stage configuration:</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONRESAMPLER</name>
                <description>Resampler stage configuration:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONFIR</name>
                <description>FIR Decimation filter configuration:</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONCIC</name>
                <description>CIC Decimation filter configuration:</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONNOTCH</name>
                <description>Notch filter configuration:</description>
                <lsb>11</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnabledWithThroughpu</name>
                    <description>Enabled with throughput 6</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnabledWithThroughpu2</name>
                    <description>Enabled with throughput 2.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONLATEGAIN</name>
                <description>Late gain configuration:</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONIMPULSE</name>
                <description>Impulse noise configuration:</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONFRSYMCNT</name>
                <description>Frame counters, Symbol metric configuration:</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONCICNRGMON</name>
                <description>Energy Monitor on input to CIC Decimator configuration:</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONLATENRGMON</name>
                <description>Energy Monitor on input to Late Gain configuration:</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONIQMETRIC</name>
                <description>IQ level imbalance estimation metric generation configuration:</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCPCONFIGURATIONIQIMBALANCE</name>
                <description>IQ level imbalance configuration:</description>
                <lsb>19</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnabledBeforeResampl</name>
                    <description>Enabled before resampler</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnabledAfterResample</name>
                    <description>Enabled after resampler.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
