ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>LUTSELECTCONTROL</name>
            <description>SCP LUT SELECT CONTROL</description>
            <addressOffset>0x3AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LUTSELECTMODE</name>
                <description>Mode for generation of LUT select signals:0: LUT select signals will be generated based on input signals andwrites to corresponding registers,1: LUT select signals will take value from register.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MIXERLUTSELECT</name>
                <description>Mixer LUT select value. Range 0 to 3.</description>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RESAMPLERLUTSELECT</name>
                <description>Resampler LUT select value. Range 0 to 3.</description>
                <lsb>3</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LATEGAINLUTSELECT</name>
                <description>Late Gain LUT select value. Range 0 to 1.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DCOFFSETLUTSELECT</name>
                <description>DC Offset LUT select value. Range 0 to 1.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>EARLYGAINLUTSELECT</name>
                <description>Early Gain LUT select value. Range 0 to 7.</description>
                <lsb>7</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>LATEGAINLUT[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_SCP_LATEGAINLUT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3B0</addressOffset>
            <register>
              <name>LATEFINEGAINI</name>
              <description>Description cluster: SCP LATE FINE GAIN I</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00200000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LATEIGAIN</name>
                  <description>2's complement value that multiplies I value from SCP. This is a linear gain where 0x100 represents the 0dB point, thus the fine gain is LATE_I_GAIN/0x100.</description>
                  <lsb>13</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LATEFINEGAINQ</name>
              <description>Description cluster: SCP LATE FINE GAIN Q</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00200000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LATEQGAIN</name>
                  <description>2's complement value that multiplies Q value from SCP. This is a linear gain where 0x100 represents the 0dB point, thus the fine gain is LATE_Q_GAIN/0x100.</description>
                  <lsb>13</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>MIXERLUT[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_SCP_MIXERLUT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3C0</addressOffset>
            <register>
              <name>LOBASE</name>
              <description>Description cluster: SCP LO BASE</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LOBASE</name>
                  <description>Local Oscillator base. This is an unsigned value which is combined with LO_CONTROL to generate the 26-bit control Fc:Fc = (LO_BASE &amp;lt;&amp;lt; 23) + LO_CONTROLFc is in 2's complement signed format where its value represents numbers within the range -1 to 0.9999999. To convert a ratio into the 26-bit Fc, multiply by 2^25.The digitally generated Local Oscillator (LO) frequency used in the mixer section is equal to Fc * (IF Clock Frequency/2). Hence the full-scale negative value represents a frequency of -(IF Clock Frequency/2).The input signal is frequency translated such that input frequency F moves to a frequency of F + Local Oscillator (LO) Frequency.NOTE : a real IF input implicitly carries the inverse of its positive spectrum at negative frequencies. This means that a positive Fc applied to a real IF gives an inverted spectrum, and a negative Fc gives a non-inverted one. An SCP input contains independent positive and negative frequency components, so Fc cannot invert the spectrum.</description>
                  <lsb>21</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LOCONTROL</name>
              <description>Description cluster: SCP LO CONTROL</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LOCONTROL</name>
                  <description>Local Oscillator control. This is a 2's complement value which is combined with LO_BASE to generate the 26-bit control Fc:Fc = (LO_BASE &amp;lt;&amp;lt; 23) + LO_CONTROL</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>RESAMPLERLUT[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_SCP_RESAMPLERLUT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3E0</addressOffset>
            <register>
              <name>RESAMPLINGFACTORBASE</name>
              <description>Description cluster: SCP RESAMPLING FACTOR BASE</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00800000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RESAMPBASE</name>
                  <description>Resampling factor base. This is an unsigned value which is combined with the 2's complement RESAMP_CONTROL to generate the 26-bit control Fs:Fs = (RESAMP_BASE &amp;lt;&amp;lt; 23) + RESAMP_CONTROLFs is the sample conversion ratio (I / O) used in the sample rate conversion section of the SCP.Fs is an unsigned number, where the full-scale range of values is 1 / (2^25) to ((2^26) - 1) / (2^25) = 2.98023224E-08 to 1.99999997NOTE: To convert a ratio into the 26-bit Fs, multiply by 2^25</description>
                  <lsb>21</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPLINGFACTORCONTROL</name>
              <description>Description cluster: SCP RESAMPLING FACTOR CONTROL</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RESAMPCONTROL</name>
                  <description>Resampling factor control. This is a 2's complement value which is combined with RESAMP_BASE to generate the 26-bit control Fs:Fs = (RESAMP_BASE &amp;lt;&amp;lt; 23) + RESAMP_CONTROL</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>WLAN_CTRL</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_CTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x08000</addressOffset>
          <register>
            <name>AUTOCONFIGMODE</name>
            <description>WLAN CTRL AUTO CONFIG MODE</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLAUTOCONFIGMODE</name>
                <description>Select mode used for automatic configuration:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticPhyConfigur</name>
                    <description>Automatic PHY configuration through WLAN_CTRL_AUTO_CONFIG register</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticPhyConfigur1</name>
                    <description>Automatic PHY configuration using direct lines from MAC controller</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLAUTOCONFIGPHYONLY</name>
                <description>Enable auto-configuration for PHY+MAC or PHY-only</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutoConfigureFullPh</name>
                    <description>Auto-configure full PHY+MAC pipeline</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutoConfigureOnlyPh</name>
                    <description>Auto-configure only PHY pipeline</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLAUTOCONFIGMACCRYPTO</name>
                <description>Enable auto-configuration MAC with or without Crypto</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutoConfigureMacPip</name>
                    <description>Auto-configure MAC pipeline with Crypto</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutoConfigureMacPip1</name>
                    <description>Auto-configure MAC pipeline without Crypto</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCONFIG</name>
            <description>WLAN CTRL AUTO CONFIG</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLAUTOCONFIGPHYENABLED</name>
                <description>Enable PHY for either RX or TX:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PhyDisabled</name>
                    <description>PHY disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PhyEnabled</name>
                    <description>PHY enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLAUTOCONFIGRXNTX</name>
                <description>Configure Wi-Fi RX or TX mode:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tx</name>
                    <description>TX</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rx</name>
                    <description>RX</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
