ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CONFIGPHY</name>
            <description>WLAN CTRL CONFIG PHY</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLRXNTX</name>
                <description>Configure Wi-Fi RX or TX mode:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tx</name>
                    <description>TX</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rx</name>
                    <description>RX</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTSCPRTMTD</name>
                <description>Select whether SCP outputs and RTM_TD input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTFFTDLB</name>
                <description>Select whether FFT output and DLB input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTSDVIT</name>
                <description>Select whether Stream Deparser outputs and Viterbi Decoder inputs are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTTXPFFT</name>
                <description>Select whether TXP output and FFT input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTFFTTXSCP</name>
                <description>Select whether FFT output and TX-SCP input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTMIMOCM</name>
                <description>Select whether MIMO Channel Matrix input is from DMA channels or a direct connection between peripherals:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTRTMSVD</name>
                <description>Select whether WLAN SVD input is from DMA channels or a direct connection between peripherals:</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTFFTRTMFD</name>
                <description>Select whether FFT data input to RTM FD are from DMA channels or a direct connection from FFT:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTKMODMIMORV</name>
                <description>Select whether MIMO RV input is from DMA channels or a direct connection between peripherals:</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLPHYRESETDISABLE</name>
                <description>Control for automatic PHY reset (RX mode):</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PhyResetWillBeAutoma</name>
                    <description>PHY reset will be automatically generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoAutomaticPhyResetI</name>
                    <description>No automatic PHY reset is generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLPOWERSAVEMODE</name>
                <description>Enable Power Save mode:</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLTXON</name>
                <description>Set RF TX on:</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TxOff</name>
                    <description>TX off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TxOn</name>
                    <description>TX on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLRXON</name>
                <description>Set RF RX on:</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RxOff</name>
                    <description>RX off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RxOn</name>
                    <description>RX on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLTXREADY</name>
                <description>Enable TX-SCP output:</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIGMAC</name>
            <description>WLAN CTRL CONFIG MAC</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDIRECTPHYDEAGG</name>
                <description>Select whether PHY outputs and Deaggregation inputs are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTDEAGGCRYPTO</name>
                <description>Select whether Deaggregation output and Crypto input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTCRYPTOAGG</name>
                <description>Select whether Crypto output and Aggregation input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDIRECTAGGTXP</name>
                <description>Select whether Aggregation output and TXP input are to/from DMA channels or a direct connection between peripherals:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DmaChannels</name>
                    <description>DMA channels</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnectionBetw</name>
                    <description>Direct connection between peripherals</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXHOLDOFF</name>
            <description>WLAN CTRL TX HOLDOFF</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTXHOLDOFF</name>
                <description>Specify TX hold-off to delay TX output to the DAC.Units are core clock cycles.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXEXTRAHOLDOFF</name>
            <description>WLAN CTRL TX EXTRA HOLDOFF</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTXEXTRAHOLDOFF</name>
                <description>Specify extra TX hold-off to delay TX output to the DAC.This extra hold-off can be selected through the TX vector.Units are core clock cycles.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WATCHDOG</name>
            <description>WLAN CTRL WATCHDOG</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00050000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLWATCHDOGEFSTATUS</name>
                <description>WLAN watchdog event flag status.Latched high when watchdog timer reaches programmed thresholdCan be forced high by writing 1 to this register for debug purposes (to test event flag connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANCTRLWATCHDOGEFENABLE</name>
                <description>WLAN watchdog event flag enable.ANDed with WLAN_CTRL_WATCHDOG_EF_STATUS before generating EF output from block.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANCTRLWATCHDOGEFCLEAR</name>
                <description>WLAN watchdog event flag acknowledge/clear.Write 1 to clear WLAN_CTRL_WATCHDOG_EF_STATUS.Writing 0 has no effect.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANCTRLWATCHDOGTIMEOUTMS</name>
                <description>Specify watchdog timeout in milliseconds. Zero means the watchdog event flag is disabled.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANCTRLWATCHDOGCYCLESPER1US</name>
                <description>Configure the number of core clock cycles per microsecond.</description>
                <lsb>12</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGPHYRESET</name>
            <description>WLAN CTRL DEBUG PHY RESET</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDEBUGPHYRESET</name>
                <description>Live state of the PHY reset signals0: PHY reset1: EDAGC reset2: SCP reset3: TD reset4: FD reset5: RXP reset</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGGING</name>
            <description>WLAN CTRL DEBUG</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDEBUG</name>
                <description>Enable debug registers PHY_VALID, PHY_ENABLE, MAC_VALID and MAC_ENABLE</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGPHYVALID</name>
            <description>WLAN CTRL DEBUG PHY VALID</description>
            <addressOffset>0x24</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDEBUGPHYVALID</name>
                <description>Live state of the PHY valid flow control signals0: TXFD Input1: TXFD Output2: RXTD Input3: RXTD OFDM Output4: RXTD DSSS Output5: FFT Input6: FFT Output7: TXTD Input8: TXTD Output9: RXFD FFT Input10: RXFD Output</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGPHYENABLE</name>
            <description>WLAN CTRL DEBUG PHY ENABLE</description>
            <addressOffset>0x28</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDEBUGPHYENABLE</name>
                <description>Live state of the PHY enable flow control signals0: TXFD Input1: TXFD Output2: RXTD Input3: RXTD OFDM Output4: RXTD DSSS Output5: FFT Input6: FFT Output7: TXTD Input8: TXTD Output9: RXFD FFT Input10: RXFD Output</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGMACVALID</name>
            <description>WLAN CTRL DEBUG MAC VALID</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDEBUGMACVALID</name>
                <description>Live state of the MAC valid flow control signals0: AGG WR1: AGG RD2: DEAGG WR3: DEAGG RD4: CRYPTO WR5: CRYPTO RD6: DECOMP WR</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
