ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>DEBUGMACENABLE</name>
            <description>WLAN CTRL DEBUG MAC ENABLE</description>
            <addressOffset>0x30</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLDEBUGMACENABLE</name>
                <description>Live state of the MAC enable flow control signals0: AGG WR1: AGG RD2: DEAGG WR3: DEAGG RD4: CRYPTO WR5: CRYPTO RD6: DECOMP WR</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CCABUSYCOUNT0</name>
            <description>WLAN CTRL CCA BUSY COUNT 0</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLCCABUSYCOUNTENA</name>
                <description>Enable / disable CCA busy window counter. When disabled counter is set to zero.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CCABUSYCOUNT1</name>
            <description>WLAN CTRL CCA BUSY COUNT 1</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLCCABUSYCOUNTER</name>
                <description>CCA busy window counter in Core clock cycles.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NUMPAYLOADBYTESFORDEASSERTION</name>
            <description>WLAN CTRL NUM PAYLOAD BYTES FOR DEASSERTION</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLNUMPAYLOADBYTESFORDEASSERTION</name>
                <description>Number of payload bytes after which PHY_RX_Request is deasserted.This value is set such that PHY-RX-Request is asserted till MAC hardware checkswhether MAC address of receiving packet is matching with expected address,i.e., this number should cover more than 10 bytes of MPDU.Typical value is 20 considering A-MPDU and some margin for MAC address matching.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TMCOUNTERMSB</name>
            <description>WLAN CTRL TM COUNTER MSB</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTMCOUNTERMSB</name>
                <description>MSB of Counter used for time measurement snapshots</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TMCOUNTERLSB</name>
            <description>WLAN CTRL TM COUNTER LSB</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTMCOUNTERLSB</name>
                <description>LSB of Counter used for time measurement snapshots</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADCFIRSTSAMPLESNAPSHOTMSB</name>
            <description>WLAN CTRL ADC FIRST SAMPLE SNAPSHOT MSB</description>
            <addressOffset>0x48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLADCFIRSTSAMPLESNAPSHOTMSB</name>
                <description>MSB of snapshot of time measurement counter, taken when first sample of ADC goes valid</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADCFIRSTSAMPLESNAPSHOTLSB</name>
            <description>WLAN CTRL ADC FIRST SAMPLE SNAPSHOT LSB</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLADCFIRSTSAMPLESNAPSHOTLSB</name>
                <description>LSB of snapshot of time measurement counter, taken when first sample of ADC goes valid</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TMCOUNTERCTRL</name>
            <description>WLAN CTRL TM COUNTER CTRL</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTMCOUNTERENABLE</name>
                <description>Enable signal for 48-bit time measurement counter</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXABORTCONTROL</name>
            <description>WLAN CTRL TX ABORT CONTROL</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTXABORTCONTROL</name>
                <description>Control to assert wlan_ctrl_rx_on when TX_ABORT is received.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNotAssertWlanCtrl</name>
                    <description>Do not assert wlan_ctrl_rx_on</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AssertWlanCtrlRxO</name>
                    <description>Assert wlan_ctrl_rx_on when abort_status is high</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMRTMSCPEOPSNAPSHOTMSB</name>
            <description>WLAN CTRL OFDM RTM SCP EOP SNAPSHOT MSB</description>
            <addressOffset>0x58</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLOFDMRTMSCPEOPSNAPSHOTMSB</name>
                <description>MSB of snapshot of time measurement counter, taken when OFDM Receiver Training Mode - SCP EOP goes high</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMRTMSCPEOPSNAPSHOTLSB</name>
            <description>WLAN CTRL OFDM RTM SCP EOP SNAPSHOT LSB</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLOFDMRTMSCPEOPSNAPSHOTLSB</name>
                <description>LSB of snapshot of time measurement counter, taken when OFDM Receiver Training Mode - SCP EOP goes high</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMRTMFDEOPSNAPSHOTMSB</name>
            <description>WLAN CTRL OFDM RTM FD EOP SNAPSHOT MSB</description>
            <addressOffset>0x60</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLOFDMRTMFDEOPSNAPSHOTMSB</name>
                <description>MSB of snapshot of time measurement counter, taken when OFDM Receiver Training Mode - FD EOP goes high</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMRTMFDEOPSNAPSHOTLSB</name>
            <description>WLAN CTRL OFDM RTM FD EOP SNAPSHOT LSB</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLOFDMRTMFDEOPSNAPSHOTLSB</name>
                <description>LSB of snapshot of time measurement counter, taken when OFDM Receiver Training Mode - FD EOP goes high</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TMCOUNTERSNAPSHOTMSB</name>
            <description>WLAN CTRL TM COUNTER SNAPSHOT MSB</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTMCOUNTERSNAPSHOTMSB</name>
                <description>MSB of snapshot of time measurement counter, taken when either WLAN_CTRL_TM_COUNTER_SNAPSHOT_MSB or WLAN_CTRL_TM_COUNTER_SNAPSHOT_LSB is written</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TMCOUNTERSNAPSHOTLSB</name>
            <description>WLAN CTRL TM COUNTER SNAPSHOT LSB</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLTMCOUNTERSNAPSHOTLSB</name>
                <description>LSB of snapshot of time measurement counter, taken when either WLAN_CTRL_TM_COUNTER_SNAPSHOT_MSB or WLAN_CTRL_TM_COUNTER_SNAPSHOT_LSB is written</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AFECONTROL</name>
            <description>WLAN CTRL AFE CONTROL</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLADCCLKPOLARITY</name>
                <description>ADC sample clock polarity:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PositiveEdge</name>
                    <description>positive edge</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NegativeEdge</name>
                    <description>negative edge</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLDACCLKPOLARITY</name>
                <description>DAC sample clock polarity:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PositiveEdge</name>
                    <description>positive edge</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NegativeEdge</name>
                    <description>negative edge</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLRFBUSCLKPOLARITY</name>
                <description>RF bus clock polarity:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PositiveEdge</name>
                    <description>positive edge</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NegativeEdge</name>
                    <description>negative edge</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLRFDTBENABLE</name>
                <description>RF Digital Test Bus enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RfDtbNotEnabled</name>
                    <description>RF DTB not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RfDrbEnabled</name>
                    <description>RF DRB enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RFPMUUP</name>
            <description>WLAN CTRL RF PMU UP</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLRFPMUUP</name>
                <description>Enable RF:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotEnabledPmuUpP</name>
                    <description>Not enabled (PMU_UP_P=0 and PMU_UP_N=1)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnabledPmuUpP1An</name>
                    <description>Enabled (PMU_UP_P=1 and PMU_UP_N=0)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RFBANDSEL</name>
            <description>WLAN CTRL RF BAND SEL</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLRFBANDSEL</name>
                <description>Select between low band and high band RF:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LowBand</name>
                    <description>Low band</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HighBand</name>
                    <description>High band</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSSNIFFER</name>
            <description>WLAN CTRL TBUS SNIFFER</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCTRLSNIFFSCPRTMTD</name>
                <description>Select whether SCP outputs and RTM_TD input are output to the EDC during direct connection:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFTXSCPDAC</name>
                <description>Select whether TX-SCP outputs and DAC input are output to the EDC during direct connection:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFTXPFFT</name>
                <description>Select whether TXP outputs and FFT input are output to the EDC during direct connection:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFFFT</name>
                <description>Select whether FFT outputs and MIMO/TXSCP input are output to the EDC during direct connection:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFPHYDEAGG</name>
                <description>Select whether PHY outputs and DEAGG input are output to the EDC during direct connection:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFDEAGGCRYPTO</name>
                <description>Select whether DEAGG outputs and CRYPTO input are output to the EDC during direct connection:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFAGGTXP</name>
                <description>Select whether AGG outputs and TXP input are output to the EDC during direct connection:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANCTRLSNIFFCRYPTOAGG</name>
                <description>Select whether Crypto outputs and Agg input are output to the EDC during direct connection:</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotSniffed</name>
                    <description>Not Sniffed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SniffTbusConnectionW</name>
                    <description>Sniff Tbus connection whilst in direct connection</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
