ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANCOREREVISION</name>
            <description>WLAN CORE REVISION</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCOREREVISION</name>
                <description>WiFi Core revision : Major(8).Minor(8).Maintenance(8)</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFICOREED</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WIFICOREED</headerStructName>
          <access>read-write</access>
          <addressOffset>0x09000</addressOffset>
          <register>
            <name>WLANEDRESET</name>
            <description>WLAN ED RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANEDLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDFSMCONFIG</name>
            <description>WLAN ED FSM CONFIG</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EDENABLE</name>
                <description>Enable the ED module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDDCESTCONFIG</name>
            <description>WLAN ED DC EST CONFIG</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000006</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCESTBYPASS</name>
                <description>Enable the WLAN ED DC EST module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DCESTMAVGLEN</name>
                <description>DC estimation moving averager filter length:</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2</name>
                    <description>2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4</name>
                    <description>4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8</name>
                    <description>8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDOFDMCORRCONFIG</name>
            <description>WLAN ED OFDM CORR CONFIG</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x0006DCF9</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFDMCORRENABLE</name>
                <description>Enable the WLAN ED OFDM correlation module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>OFDMCORRDETTHRESMETRIC1</name>
                <description>OFDM correlation detection metric 1 threshold. It has a range of -31 .. 0. Default value is -4.</description>
                <lsb>1</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>OFDMCORRDETTHRESMETRIC2</name>
                <description>OFDM correlation detection metric 2 threshold. It has a range of -31 .. 0. Default value is -7.</description>
                <lsb>7</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>OFDMCORRDETTHRESMETRIC3</name>
                <description>OFDM correlation detection metric 3 threshold. It has a range of -31 .. 0. Default value is -10.</description>
                <lsb>13</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDOFDMCORRCONFIG1</name>
            <description>WLAN ED OFDM CORR CONFIG 1</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00205DB6</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFDMCORRDETTHRESMETRIC4</name>
                <description>OFDM correlation detection metric 4 threshold. It has a range of -31 .. 0. Default value is -10.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>OFDMCORRDETTHRESMETRIC5</name>
                <description>OFDM correlation detection metric 5 threshold. It has a range of -31 .. 0. Default value is -10.</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OFDMCORRDETNUMCONSPASS12</name>
                <description>Number of consecutive metric pass for OFDM detection. It has a range of 0 .. 31.</description>
                <lsb>12</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>OFDMCORRDETNUMCONSPASS345</name>
                <description>Number of consecutive metric pass for OFDM detection. It has a range of 0 .. 31.</description>
                <lsb>17</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDOFDMCORRCONFIG2</name>
            <description>WLAN ED OFDM CORR CONFIG 2</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00DB6C71</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFDMCORRS2LTHRESMETRIC1</name>
                <description>OFDM correlation S2l metric 1 threshold. It has a range of -31 .. 0. Default value is -15.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>OFDMCORRS2LTHRESMETRIC2</name>
                <description>OFDM correlation S2l metric 2 threshold. It has a range of -31 .. 0. Default value is -15.</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OFDMCORRS2LTHRESMETRIC3</name>
                <description>OFDM correlation S2l metric 3 threshold. It has a range of -31 .. 0. Default value is -10.</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>OFDMCORRS2LTHRESMETRIC4</name>
                <description>OFDM correlation S2l metric 4 threshold. It has a range of -31 .. 0. Default value is -10.</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDOFDMCORRCONFIG3</name>
            <description>WLAN ED OFDM CORR CONFIG 3</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00005176</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFDMCORRS2LTHRESMETRIC5</name>
                <description>OFDM correlation S2l metric 5 threshold. It has a range of -31 .. 0. Default value is -10.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>OFDMCORRS2LNUMCONSPASS12</name>
                <description>Number of consecutive pass for S2L detection. It has a range of 0 .. 31.</description>
                <lsb>6</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>OFDMCORRS2LNUMCONSPASS345</name>
                <description>Number of consecutive pass for S2L detection. It has a range of 0 .. 31.</description>
                <lsb>11</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDDSSSCORRCONFIG</name>
            <description>WLAN ED DSSS CORR CONFIG</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000C9</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DSSSCORRENABLE</name>
                <description>Enable the WLAN ED DSSS correlation module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DSSSCORRTHRES</name>
                <description>DSSS correlation threshold. It has a range of 0 .. 255.</description>
                <lsb>1</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDRSSIESTCONFIG</name>
            <description>WLAN ED RSSI EST CONFIG</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00009F9F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIEDTHRESHOLDOFDM</name>
                <description>RSSI estimation threshold (dBm) to be used when ofdmDetected is true. It has a range of -128 .. 127. Default value is -97.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RSSIEDTHRESHOLDDSSS</name>
                <description>RSSI estimation threshold (dBm) to be used when dsssDetected is true. It has a range of -128 .. 127. Default value is -97.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDRSSIESTCONFIG1</name>
            <description>WLAN ED RSSI EST CONFIG 1</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x000043AF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIESTCOMPFACTOR</name>
                <description>RSSI estimation compensation factor (F) in dB.It has a range of 0 .. 127.This is used in computing the RSSI given the variance and corresponding analog gain in dB.rssiInDbm = varDb - gainDb - RSSI_EST_COMP_FACTOR</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RSSIESTACIENABLE</name>
                <description>Enable Adjacent Channel Interference.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RSSIESTACITHRESDB</name>
                <description>RSSI estimation ACI dB threshold. It has a range of 0 .. 63.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>RSSIESTLEEENABLE</name>
                <description>Enable Low Energy Event.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>RSSIESTLEECLEAR</name>
                <description>Clear Low Energy Event.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDRSSIESTCONFIG2</name>
            <description>WLAN ED RSSI EST CONFIG 2</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x000C2288</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIESTLEEMARGINDB</name>
                <description>Low Energy Event dB margin. It has a range of 0 .. 31.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>RSSIESTLEECONSECLOWS</name>
                <description>Number of consecutive lows for Low Energy Event. It has a range of 0 .. 15.</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>RSSIESTPOPENABLE</name>
                <description>Enable Packet Over Packet.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>RSSIESTPOPDIFFTHRES</name>
                <description>Packet over packet difference threshold. It has a range of 0 .. 255.</description>
                <lsb>10</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>RSSIESTCCASUPPRESSACI</name>
                <description>If this bit is '1', then CCA will be suppressed ('0') if ACI detected signal is '1'. Else CCA behaves normally.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>RSSIESTCCASUPPRESSAACI</name>
                <description>If this bit is '1', then CCA will be suppressed ('0') if AACI detected signal is '1'. Else CCA behaves normally.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDRSSIESTCONFIG3</name>
            <description>WLAN ED RSSI EST CONFIG 3</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000C2AE</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIESTCCAP20DETTHRES</name>
                <description>Clear Channel Assessment detection threshold. It has a range of -127 .. 0. Default value is -82.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RSSIESTCCAP20BUSYTHRES</name>
                <description>Clear Channel Assessment busy threshold. It has a range of -127 .. 0. Default value is -62.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDRSSIESTCONFIG4</name>
            <description>WLAN ED RSSI EST CONFIG 4</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000055</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIESTPOPTRIGAGCENABLE</name>
                <description>Enable POP trigger generation for AGC when POP event.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RSSIESTPOPTRIGAGCTHRESDB</name>
                <description>POP trigger for AGC threshold. It has a range of 0 .. 127. Default value is 42.</description>
                <lsb>1</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDNHCONFIG</name>
            <description>WLAN ED NH CONFIG</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00007640</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NHRESET</name>
                <description>Reset the noise histogram accumulator.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>NHENABLE</name>
                <description>Enable the noise histogram computation (Enable RSSI estimation accumulation).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>NHACCUMLEN</name>
                <description>Set the noise histogram accumulation length:</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2101</name>
                    <description>2^10-1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2151</name>
                    <description>2^15-1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2181</name>
                    <description>2^18-1</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2201</name>
                    <description>2^20-1</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NHCHLOADENABLE</name>
                <description>Enable noise histogram channel load counter.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>NHCHLOADTHRESH</name>
                <description>Noise histogram channel load threshold. It has a range from -127 .. 0.</description>
                <lsb>5</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>NHCHLOADCOUNTLEN</name>
                <description>Noise histogram channel load length:</description>
                <lsb>13</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2121</name>
                    <description>2^12-1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2161</name>
                    <description>2^16-1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2201</name>
                    <description>2^20-1</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2241</name>
                    <description>2^24-1</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR</name>
            <description>WLAN ED MONITOR</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKETDETECTED</name>
                <description>'1' indicates either OFDM/DSSS packet has been detected and TD processing is in progress</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PACKETTYPE</name>
                <description>Indicates the type of packet detected:</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unknown</name>
                    <description>UNKNOWN,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ofdm</name>
                    <description>OFDM,</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Dsss</name>
                    <description>DSSS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2LDONE</name>
                <description>'1' indicates s2l Event has occurred (either s2lPass or s2lFail)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>S2LPASS</name>
                <description>Holds the value of s2l pass/fail status. If '1' s2l Pass, '0' s2l fail(timeout). This is valid only when S2L_EVENT is high</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>OFDMDETTOS2LCOUNT</name>
                <description>Contains the count in num of 20MHz samples from the time pktDetected happens to s2lPass</description>
                <lsb>5</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ACIDET</name>
                <description>'1' indicates an ACI signal is present and hence ED detections will not happen</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>CCARSSIABOVECCATHRES</name>
                <description>'1' indicates the RSSI is above the CCA threshold (-62dBm)</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>CCARSSIABOVEDETTHRES</name>
                <description>'1' indicates the RSSI is above the Detection threshold (-82dBm)</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFOESTVALID</name>
                <description>'1' indicates CFO estimation is completed</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
