ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANEDMONITOR1</name>
            <description>WLAN ED MONITOR 1</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFOESTATS2LREAL</name>
                <description>( 24-bit complex (s23.0)) Real part of CFO estimation e^j.theeta, where theeta = (2**pi**fHz**16/20e6) - fHz is CFO in Hz .</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR2</name>
            <description>WLAN ED MONITOR 2</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFOESTATS2LIMAG</name>
                <description>( 24-bit complex (s23.0)) Imaginary part of CFO estimation e^j.theeta, where theeta = (2**pi**fHz**16/20e6) - fHz is CFO in Hz .</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR3</name>
            <description>WLAN ED MONITOR 3</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCESTATS2LREAL</name>
                <description>Real part of DC estimation at s2L detection (12-bit complex (s9.2)).</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCESTATS2LIMAG</name>
                <description>Imag part of DC estimation at s2L detection (12-bit complex (s9.2)).</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DCESTATS2LVALID</name>
                <description>DC estimation at s2L detection valid flag.</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR4</name>
            <description>WLAN ED MONITOR 4</description>
            <addressOffset>0x48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCESTATSECAGCREAL</name>
                <description>Real part of DC estimation at second AGC (12-bit complex (s9.2)).</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCESTATSECAGCIMAG</name>
                <description>Imag part of DC estimation at second AGC (12-bit complex (s9.2)).</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DCESTATSECAGCVALID</name>
                <description>DC estimation at second AGC valid flag.</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR5</name>
            <description>WLAN ED MONITOR 5</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIESTATPACKETDET</name>
                <description>RSSI estimation at packet detection (s7.0).</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RSSIESTATPACKETDETVALID</name>
                <description>RSSI estimation at packet detection valid flag.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>RSSIESTAFTERSECAGC</name>
                <description>RSSI estimation after second AGC (s7.0).</description>
                <lsb>9</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>RSSIESTAFTERSECAGCVALID</name>
                <description>RSSI estimation after second AGC valid flag.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR6</name>
            <description>WLAN ED MONITOR 6</description>
            <addressOffset>0x50</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NHACCUMVALUE</name>
                <description>Noise histogram accumulation value. It has a range of 0 .. (2^24)-1. The average noise power in dBm is got by NH_ACCUM_VALUE/NH_ACCUM_COUNT.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR7</name>
            <description>WLAN ED MONITOR 7</description>
            <addressOffset>0x54</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NHACCUMCOUNT</name>
                <description>Noise histogram accumulation count. It has a range of 0 .. (2^20)-1.The average noise power in dBm is got by NH_ACCUM_VALUE/NH_ACCUM_COUNT.</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDMONITOR8</name>
            <description>WLAN ED MONITOR 8</description>
            <addressOffset>0x58</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NHCHANNELLOADCOUNT</name>
                <description>Noise histogram channel load count. It has a range of 0 .. (2^24)-1.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDSTATUS</name>
            <description>WLAN ED STATUS</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EDEVENT</name>
                <description>Packet detection has happened. If this register contains a '1' in real time, it means the ED event has not been cleared by PHY indicating a lockup.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>S2LEVENT</name>
                <description>S2l Pass/Fail has happened. If this register contains a '1' in real time, it means the S2L event has not been cleared by PHY indicating a lockup.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LOWENERGYEVENT</name>
                <description>Low Energy Event has happened (Jammer disappearance). If this register contains a '1' in real time, it means the LEE event has not been cleared by PHY indicating a lockup.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>POPEVENT</name>
                <description>Packet Over Packet event. If this register contains a '1' in real time, it means the POP event has not been cleared by PHY indicating a lockup.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>AGCPOPTRIG</name>
                <description>Packet Over Packet indication to AGC. If this register contains a '1' in real time, it means the AGC in-progess has not been set after a POP event indicating a lockup.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>AGCTRIGOVERPACKET</name>
                <description>AGC trigger Event after packet detection (equivalent to POP_EVENT). If this register contains a '1' in real time, it means the AgcTrigger event has not been cleared by PHY indicating a lockup.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMFIFOOVERFLOWSTALL</name>
            <description>OFDM FIFO OVERFLOW STALL</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFDMFIFOOVERFLOWSTALL</name>
                <description>This field asserts if the ED ODFM FIFO has attempted to stall to prevent an overflow. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMFIFOUNDERFLOWSTALL</name>
            <description>OFDM FIFO UNDERFLOW STALL</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFDMFIFOUNDERFLOWSTALL</name>
                <description>This field asserts if the ED ODFM FIFO has attempted to stall to prevent an underflow. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RSSIFIFOOVERFLOWSTALL</name>
            <description>RSSI FIFO OVERFLOW STALL</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIFIFOOVERFLOWSTALL</name>
                <description>This field asserts if the ED RSSI FIFO has attempted to stall to prevent an overflow. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RSSIFIFOUNDERFLOWSTALL</name>
            <description>RSSI FIFO UNDERFLOW STALL</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSIFIFOUNDERFLOWSTALL</name>
                <description>This field asserts if the ED RSSI FIFO has attempted to stall to prevent an underflow. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATAFIFOOVERFLOWSTALL</name>
            <description>DATA FIFO OVERFLOW STALL</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAFIFOOVERFLOWSTALL</name>
                <description>This field asserts if the ED DATA FIFO has attempted to stall to prevent an overflow. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATAFIFOUNDERFLOWSTALL</name>
            <description>DATA FIFO UNDERFLOW STALL</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAFIFOUNDERFLOWSTALL</name>
                <description>This field asserts if the ED DATA FIFO has attempted to stall to prevent an underflow. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDDEBUG</name>
            <description>WLAN ED DEBUG</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGAGCGAINENA</name>
                <description>Enable AGC gain debug mode : overwrite agcGainDb with values in DEBUG_AGC_GAIN_AT_DET and DEBUG_AGC_GAIN_AT_2ND (when 2nd agc is active).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DEBUGAGCGAINATDET</name>
                <description>AGC gain in dB at packet detection (s7.0).</description>
                <lsb>1</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>DEBUGAGCGAINAT2ND</name>
                <description>AGC gain in dB at second agc (s7.0).</description>
                <lsb>9</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>DEBUGEDPKTTYPEENA</name>
                <description>Enable ED Packet Type debug mode : overwrite packetType with values in DEBUG_ED_PKT_TYPE.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>DEBUGEDPKTTYPE</name>
                <description>Forces the type of packet detected when DEBUG_ED_PKT_TYPE_ENA is set:</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ofdm</name>
                    <description>OFDM,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Dsss</name>
                    <description>DSSS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFICOREAGC</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WIFICOREAGC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0A000</addressOffset>
          <register>
            <name>WLANAGCRESET</name>
            <description>WLAN AGC RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANAGCPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANAGCLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCCONFIG</name>
            <description>WLAN AGC CONFIG</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00064887</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCENABLE</name>
                <description>Bit field to enable AGC module. When AGC is disabled, the RF gain at the point in time will take effect and will not be modified.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECONDAGCENABLE</name>
                <description>Switch to control whether second AGC on the HT/VHT/HE-stf fields should be done or not. If disabled, then the first AGC gain will continue till the end of packet.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AACIDETECTIONENABLE</name>
                <description>Enable for Non-adjacent channel interferer detection. AACI (Alternate Adjacent Channel Interference) is a legacy term. This logic enables early identification of the interferer and prevent pktDetected by ED module on those interfering packets.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AGCWAITTIMEAFTERTRIG</name>
                <description>After a new AGC trigger is received, the number of ADC samples to wait before kicking off the gain control process. This is to let the analog components to ramp up/down to the new packet power.</description>
                <lsb>3</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>AGCFREEZESOFTWARE</name>
                <description>When enabled, the LNA and BB gain are frozen at the current level and all AGC triggers will be ignored.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AGCFREEZEONPKTDET</name>
                <description>When enabled, the AGC will be freezed for the duration where pktDetected from ED module is active.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AGCFREEZEONACIDET</name>
                <description>When enabled, the AGC will be freezed for the duration where aciDetected from ED module is active.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MAXBBGAIN</name>
                <description>This value (in dB) indicates the Maximum Gain we can setin BaseBand. Value ranges between -128 and 127.</description>
                <lsb>13</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCCONFIG1</name>
            <description>WLAN AGC CONFIG 1</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00F44A00</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MINBBGAIN</name>
                <description>This value (in dB) indicates the Minimum Gain we can setin BaseBand. Value ranges between -128 and 127.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MAXTOTALGAIN</name>
                <description>Max allowed Total gain in dB. (total gain = lna gain dB + bb gain dB).Value ranges between -128 and 127.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MINTOTALGAIN</name>
                <description>Min allowed Total gain in dB. (total gain = lna gain dB + bb gain dB).Value ranges between -128 and 127.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
