ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANAGCBBGCCONFIG</name>
            <description>WLAN AGC BBGC CONFIG</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040810</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBINITWAITTIME</name>
                <description>Settling time in number of ADC samples after changing from current BB gain to bbInitGain.Value ranges between 0 and 127.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BBSETTIMEDEEPCLIPFIRSTAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain in response to DEEP clipping scenario during first AGC operation (on L-STF field for OFDM packets).Value ranges between 0 and 127.</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>BBSETTIMEMODCLIPFIRSTAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain in response to MODERATE clipping scenario during first AGC operation (on L-STF field for OFDM packets).Value ranges between 0 and 127.</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCBBGCCONFIG1</name>
            <description>WLAN AGC BBGC CONFIG 1</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00080810</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBSETTIMEMINCLIPFIRSTAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain in response to MINIMUM clipping scenario during first AGC operation (on L-STF field for OFDM packets).Value ranges between 0 and 127.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BBSETTIMEFINALGAINFIRSTAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain to final gain during first AGC operation (on L-STF field for OFDM packets).Value ranges between 0 and 255.</description>
                <lsb>7</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>BBSETTIMEDEEPCLIPSECONDAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain in response to DEEP clipping scenario during second AGC operation (on HT/VHT/HE-STF field for OFDM packets).Value ranges between 0 and 127.</description>
                <lsb>15</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCBBGCCONFIG2</name>
            <description>WLAN AGC BBGC CONFIG 2</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040810</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBSETTIMEMODCLIPSECONDAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain in response to MODERATE clipping scenario during second AGC operation(on HT/VHT/HE-STF field for OFDM packets).Value ranges between 0 and 127.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BBSETTIMEMINCLIPSECONDAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain in response to MINIMUM clipping scenario during second AGC operation(on HT/VHT/HE-STF field for OFDM packets).Value ranges between 0 and 127.</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>BBSETTIMEFINALGAINSECONDAGC</name>
                <description>Settling time in number of ADC samples after changing current BB gain to final gain during second AGC operation(on HT/VHT/HE-STF field for OFDM packets).Value ranges between 0 and 255.</description>
                <lsb>14</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCBBGCCONFIG3</name>
            <description>WLAN AGC BBGC CONFIG 3</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x0090C624</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBCUTBACKDEEPCLIPFIRSTAGC</name>
                <description>BB Gain in dB to be cutback for DEEP clip scenario during first AGC operation(on L-STF field for OFDM packets).Value ranges between 0 and 63 dB.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BBCUTBACKMODCLIPFIRSTAGC</name>
                <description>BB Gain in dB to be cutback for MODERATE clip scenario during first AGC operation(on L-STF field for OFDM packets).Value ranges between 0 and 63 dB.</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>BBCUTBACKMINCLIPFIRSTAGC</name>
                <description>BB Gain in dB to be cutback for MINIMUM clip scenario during first AGC operation(on L-STF field for OFDM packets).Value ranges between 0 and 63 dB.</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>BBCUTBACKDEEPCLIPSECONDAGC</name>
                <description>BB Gain in dB to be cutback for DEEP clip scenario during second AGC operation(on HT/VHT/HE-STF field for OFDM packets).Value ranges between 0 and 63 dB.</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCBBGCCONFIG4</name>
            <description>WLAN AGC BBGC CONFIG 4</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000318</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBCUTBACKMODCLIPSECONDAGC</name>
                <description>BB Gain in dB to be cutback for MODERATE clip scenario during second AGC operation(on HT/VHT/HE-STF field for OFDM packets).Value ranges between 0 and 63 dB.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BBCUTBACKMINCLIPSECONDAGC</name>
                <description>BB Gain in dB to be cutback for MINIMUM clip scenario during second AGC operation(on HT/VHT/HE-STF field for OFDM packets). Value ranges between 0 and 63 dB.</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCBBGCCONFIG5</name>
            <description>WLAN AGC BBGC CONFIG 5</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001332</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BBINITGAIN</name>
                <description>The initial Baseband gain in dB to be set after powering on AGC and in response to variance too low trigger.Value ranges between 0 and 127.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BBCLIPTRIGGAIN</name>
                <description>The initial Baseband gain in dB to be set in response to clip trigger or variance too high trigger. This value is smaller than the BB_INIT_GAIN as we know that signal is already above the optimal bit occupancy and hence want to start AGC search with a cutdown value.Value ranges between 0 and 127.</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCCLIPCOUNTCONFIG</name>
            <description>WLAN AGC CLIP COUNT CONFIG</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000DF4</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCCLIPLEVEL</name>
                <description>The maximum value of ADC output beyond which clip is declared. This maximum value setting is valid for both I and Q samples at the output of ADC.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CCCLIPTRIGTHRES</name>
                <description>The min clip count to be considered as clip trigger - to start AGC gain search.Value ranges between 0 and 255.</description>
                <lsb>10</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCCLIPCOUNTCONFIG1</name>
            <description>WLAN AGC CLIP COUNT CONFIG 1</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x000C060C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCNUMCLIPDEEPFIRSTAGC</name>
                <description>Minimum Number of clips to decide the occurence of deep saturation at first AGC. Value ranges between 0 and 255.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CCNUMCLIPMODFIRSTAGC</name>
                <description>Minimum Number of clips to decide the occurence of moderate saturation at first AGC.. Value ranges between 0 and 255.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CCNUMCLIPDEEPSECONDAGC</name>
                <description>Minimum Number of clips to decide the occurence of deep saturation at second AGC.. Value ranges between 0 and 255.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCCLIPCOUNTCONFIG2</name>
            <description>WLAN AGC CLIP COUNT CONFIG 2</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001006</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCNUMCLIPMODSECONDAGC</name>
                <description>Minimum Number of clips to decide the occurence of moderate saturation at second AGC.. Value ranges between 0 and 255.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CCCLIPCOUNTMAVGLEN</name>
                <description>Clip The window size (number of contiguous IQ samples) to be considered for counting the clips for Clip trigger.Value ranges between 0 and 63.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCVARESTCONFIG</name>
            <description>WLAN AGC VAR EST CONFIG</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x0001A255</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VECOMPENSATEDC</name>
                <description>Bit field to enable DC compensation. Flag to control if the IQ samples are to be compensated for the DC before further power/clipping measurements.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VETARGETLEVELDB</name>
                <description>The optimum variance in dB of the ADC samples to be achieved by the AGC search. This is done on the ADC samples (after DC subtraction if COMPENSATE_DC is enabled). It has a range of 0 .. 63.</description>
                <lsb>1</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>VETRIGUPPERTHRES</name>
                <description>A variance trigger will be issued if current variance goes above TARGET_LEVEL_DB + TRIG_UPPER_THRES.It has a range of -16 .. 15. Default value is 4.</description>
                <lsb>7</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>VETRIGLOWERTHRES</name>
                <description>A variance trigger will be issued if current variance goes below TARGET_LEVEL_DB + TRIG_LOWER_THRES.It has a range of -16 .. 15. Default value is -6.</description>
                <lsb>12</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCVARESTCONFIG1</name>
            <description>WLAN AGC VAR EST CONFIG 1</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00015550</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VEESTWINDOWLENGTH</name>
                <description>Variance estimation window length in number of samples.It has a range of 0 .. 63. Default value is 16.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>VEWINDOWNORMFACT</name>
                <description>Normalisation factor for the sum of products in the variance estimation. The total number of products per window is equal to VE_EST_WINDOW_LENGTH - 4.It has a format of u1.14. Default value is 1365.</description>
                <lsb>6</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCVARESTCONFIG2</name>
            <description>WLAN AGC VAR EST CONFIG 2</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000002F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VERSSICOMPFACTOR</name>
                <description>The value in dB to be subtracted from agcVarDb to get the estimate of RF input signal power in the inband. (See VE_WINDOW_NORM_FACT description). agcRssiDb = agcVarDb - agcTotalGainDb - VE_RSSI_COMP_FACTOR.It has a range of 0 .. 63. Default value is 47.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCAACIDETCONFIG</name>
            <description>WLAN AGC AACI DET CONFIG</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00271028</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDETECTTHRESDB</name>
                <description>AACI Detection threshold. If the (lnaRssiDb - agcRssiDb) &amp;gt; AD_DETECT_THRES_DB, the aaciDetected signal is asserted.It has a range of 0 .. 63. Default value is 40.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ADDISAPTIMEOUT</name>
                <description>The count in number of ADC input samples before with an AACI disappeared timeOut trigger will be issued, so the AGC gains are re-initialized and AGC operation is performed. This is used for the cases where disappearance of AACI signal is not detectable by the fall of agcVarDb (as the AACI leakage power is below the LNA noise floor).It has a range of 0 .. 262143. Default value is 40000.</description>
                <lsb>6</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCAACIDETCONFIG1</name>
            <description>WLAN AGC AACI DET CONFIG 1</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x000001E8</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDISAPMARGINDB</name>
                <description>The amount in dB by which the agcVarDb should fall in order for it to be confirmed as AACI signal disappearance. This disappearance check is enabled aaciDetected is high.It has a range of 0 .. 15. Default value is 8.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ADDETTARGETLEVELDB</name>
                <description>Provisional register to shift the target level of the agcVarDb when AACI signal is detected. This may be required for avoiding multiple AGC triggers when AACI signal has a variance &amp;gt; VE_TRIG_UPPER_THRES/VE_TRIG_LOWER_THRES.It has a range of 0 .. 63. Default value is 30.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG</name>
            <description>WLAN AGC LGC CONFIG</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00450640</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNABTFREEZEENA</name>
                <description>Flag to determine if the LNA gain should be freezed when btFreeze signal is high (from BT module). IF this flag is disabled, then even if btFreeze is high, the LNA gain will be changed based on the needs of wlanAgc.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LGINITLNAGAIN</name>
                <description>The initial LNA gain stage to be used (start of the day and after every clip/variance trigger). Stage numbers 0 through 4 are valid. This is 3-bit valueDefault value is 0.</description>
                <lsb>1</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LGRFMINGAINSTAGE</name>
                <description>The LNA gain stage which has the min Gain in DB. This is also the stage that has the max stage idx. In sheliak and vega this is stage 4 (-12dB).It has a range of 0 .. 4. Default value is 4.</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>LGSEARCHSETTLETIME</name>
                <description>The number of samples to wait for the signal level to settle after LNA gain change.It has a range of 0 .. 127. Default value is 12.</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>LGINCRSETTLETIME</name>
                <description>The number of samples to wait for the signal level to settle after WLAN increment.It has a range of 0 .. 127. Default value is 20.</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>LGRFRSSITHRES</name>
                <description>The threshold above which the RF Rssi value that is feedback from RF (a 3 bit value from 0-7) is considered to be saturating the LNA and hence LNA gain needs to be lowered.It has a range of 0 .. 7. Default value is 2.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG1</name>
            <description>WLAN AGC LGC CONFIG 1</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00A9A39D</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNANOISEFLOORTABLE0</name>
                <description>The noise floor in dBm (noise power) corresponding to the LNA gain stage 0.This value of 8-bit signed is the noise floor expressed in dBm. Default value is -98.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>LGLNANOISEFLOORTABLE1</name>
                <description>The noise floor in dBm (noise power) corresponding to the LNA gain stage 1.This value of 8-bit signed is the noise floor expressed in dBm. Default value is -96.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>LGLNANOISEFLOORTABLE2</name>
                <description>The noise floor in dBm (noise power) corresponding to the LNA gain stage 2.This value of 8-bit signed is the noise floor expressed in dBm. Default value is -90.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
