ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANAGCLGCCONFIG2</name>
            <description>WLAN AGC LGC CONFIG 2</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0002C1B5</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNANOISEFLOORTABLE3</name>
                <description>The noise floor in dBm (noise power) corresponding to the LNA gain stage 3.This value of 8-bit signed is the noise floor expressed in dBm. Default value is -76.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>LGLNANOISEFLOORTABLE4</name>
                <description>The noise floor in dBm (noise power) corresponding to the LNA gain stage 4.This value of 8-bit signed is the noise floor expressed in dBm. Default value is -64.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>LGGAINADJMAXITER</name>
                <description>The number of (check_rf_rssi_value, reduce_lna_gain, wait for gain settle) cycles before the search is stopped.It has a range of 0 .. 3. Default value is 2.</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG3</name>
            <description>WLAN AGC LGC CONFIG 3</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000C498</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNAGAINTABLE0</name>
                <description>This value of 6-bit signed is the LNA gain for stage 0. Default value is 24.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGLNAGAINTABLE1</name>
                <description>This value of 6-bit signed is the LNA gain for stage 1. Default value is 18.</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LGLNAGAINTABLE2</name>
                <description>This value of 6-bit signed is the LNA gain for stage 2. Default value is 12.</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>LGLNAGAINTABLE3</name>
                <description>This value of 6-bit signed is the LNA gain for stage 3. Default value is 0.</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG4</name>
            <description>WLAN AGC LGC CONFIG 4</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000F4</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNAGAINTABLE4</name>
                <description>This value of 6-bit signed is the LNA gain for stage 4. Default value is -12.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGRSSIINCRPOWERFACTOR</name>
                <description>The 3-bit RF_RSSI_VAL feedback from RF increments by 1 for every LG_RSSI_INCR_POWER_FACTOR increase in LNA input signal power in dBm. Unit is dB. For vega this value is 3.It has a range of 0 .. 7. Default value is 3.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LGRFRAMPUPTIME</name>
                <description>Holds number of samples to wait for before starting LNA gain search. This value is set to zero currently as the ramp up time is handled by AGC_WAIT_TIME_AFTER_TRIG.It has a range of 0 .. 127. Default value is 0.</description>
                <lsb>9</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG5</name>
            <description>WLAN AGC LGC CONFIG 5</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00491200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGNEXTLNASTAGETABLE00</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 0.It has a range of 0 .. 7.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE01</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 1.It has a range of 0 .. 7.</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE02</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 2.It has a range of 0 .. 7.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE03</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 3.It has a range of 0 .. 7.</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE04</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 4.It has a range of 0 .. 7.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE05</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 5.It has a range of 0 .. 7.</description>
                <lsb>15</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE06</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 6.It has a range of 0 .. 7.</description>
                <lsb>18</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE07</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 0 and rf rssi value is 7.It has a range of 0 .. 7.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG6</name>
            <description>WLAN AGC LGC CONFIG 6</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x006D2449</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGNEXTLNASTAGETABLE10</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 0.It has a range of 0 .. 7.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE11</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 1.It has a range of 0 .. 7.</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE12</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 2.It has a range of 0 .. 7.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE13</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 3.It has a range of 0 .. 7.</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE14</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 4.It has a range of 0 .. 7.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE15</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 5.It has a range of 0 .. 7.</description>
                <lsb>15</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE16</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 6.It has a range of 0 .. 7.</description>
                <lsb>18</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE17</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 1 and rf rssi value is 7.It has a range of 0 .. 7.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG7</name>
            <description>WLAN AGC LGC CONFIG 7</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x0091B692</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGNEXTLNASTAGETABLE20</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 0.It has a range of 0 .. 7.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE21</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 1.It has a range of 0 .. 7.</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE22</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 2.It has a range of 0 .. 7.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE23</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 3.It has a range of 0 .. 7.</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE24</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 4.It has a range of 0 .. 7.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE25</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 5.It has a range of 0 .. 7.</description>
                <lsb>15</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE26</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 6.It has a range of 0 .. 7.</description>
                <lsb>18</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE27</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 2 and rf rssi value is 7.It has a range of 0 .. 7.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG8</name>
            <description>WLAN AGC LGC CONFIG 8</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x009248DB</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGNEXTLNASTAGETABLE30</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 0.It has a range of 0 .. 7.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE31</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 1.It has a range of 0 .. 7.</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE32</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 2.It has a range of 0 .. 7.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE33</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 3.It has a range of 0 .. 7.</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE34</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 4.It has a range of 0 .. 7.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE35</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 5.It has a range of 0 .. 7.</description>
                <lsb>15</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE36</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 6.It has a range of 0 .. 7.</description>
                <lsb>18</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE37</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 3 and rf rssi value is 7.It has a range of 0 .. 7.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG9</name>
            <description>WLAN AGC LGC CONFIG 9</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00924924</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGNEXTLNASTAGETABLE40</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 0.It has a range of 0 .. 7.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE41</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 1.It has a range of 0 .. 7.</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE42</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 2.It has a range of 0 .. 7.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE43</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 3.It has a range of 0 .. 7.</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE44</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 4.It has a range of 0 .. 7.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE45</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 5.It has a range of 0 .. 7.</description>
                <lsb>15</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE46</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 6.It has a range of 0 .. 7.</description>
                <lsb>18</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>LGNEXTLNASTAGETABLE47</name>
                <description>The stage index of the next LNA stage to use, if the current lna stage is 4 and rf rssi value is 7.It has a range of 0 .. 7.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG10</name>
            <description>WLAN AGC LGC CONFIG 10</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00152F58</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNASWITCHPOINTTABLE0</name>
                <description>lnaSwitchPointDbm for LNA stage 0, where lnaSwitchPointDbm is defined as:The value of RF input power in dBm which meets the following equation:rfRssiVal3Bit = lnaSwitchPointDbm + LG_RSSI_INCR_POWER_FACTOR * (rfInPowerDbm - lnaSwitchPointDbm)'This value is 7-bit signed. Default value is -40.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>LGLNASWITCHPOINTTABLE1</name>
                <description>lnaSwitchPointDbm for LNA stage 1, where lnaSwitchPointDbm is defined as:The value of RF input power in dBm which meets the following equation:rfRssiVal3Bit = lnaSwitchPointDbm + LG_RSSI_INCR_POWER_FACTOR * (rfInPowerDbm - lnaSwitchPointDbm)'This value is 7-bit signed. Default value is -34.</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>LGLNASWITCHPOINTTABLE2</name>
                <description>lnaSwitchPointDbm for LNA stage 2, where lnaSwitchPointDbm is defined as:The value of RF input power in dBm which meets the following equation:rfRssiVal3Bit = lnaSwitchPointDbm + LG_RSSI_INCR_POWER_FACTOR * (rfInPowerDbm - lnaSwitchPointDbm)'This value is 7-bit signed. Default value is -28.</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCLGCCONFIG11</name>
            <description>WLAN AGC LGC CONFIG 11</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00003E70</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LGLNASWITCHPOINTTABLE3</name>
                <description>lnaSwitchPointDbm for LNA stage 3, where lnaSwitchPointDbm is defined as:The value of RF input power in dBm which meets the following equation:rfRssiVal3Bit = lnaSwitchPointDbm + LG_RSSI_INCR_POWER_FACTOR * (rfInPowerDbm - lnaSwitchPointDbm)'This value is 7-bit signed. Default value is -16.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>LGLNASWITCHPOINTTABLE4</name>
                <description>lnaSwitchPointDbm for LNA stage 4, where lnaSwitchPointDbm is defined as:The value of RF input power in dBm which meets the following equation:rfRssiVal3Bit = lnaSwitchPointDbm + LG_RSSI_INCR_POWER_FACTOR * (rfInPowerDbm - lnaSwitchPointDbm)'This value is 7-bit signed. Default value is -4.</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
