ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANAGCMONITOR</name>
            <description>WLAN AGC MONITOR</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BTFREEZE</name>
                <description>Input signal from BT module where '1' indicates the BT wants the LNA gain not to be changed.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EDPACKETDETECTED</name>
                <description>'1' indicates either OFDM/DSSS packet has been detected and TD processing is in progress.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>EDACIDETECTED</name>
                <description>ACI detected signal from ED module. This can be used for freezing the AGC gain. So that AGC doesn't enter trigger-&amp;gt;search-&amp;gt;settle cycle multiple times, thereby reducing the blind period.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RFRSSIDONE</name>
                <description>From RF module, indicates the completion of RSSI value computation.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RFRSSIVALUE</name>
                <description>From RF module, the 3-bit RF RSSI value where a higher value like 7 indicates severe saturation at LNA output. This is an 3-bit signed.</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>AGCSAMPLEID</name>
                <description>AGC sample index.</description>
                <lsb>7</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCMONITOR1</name>
            <description>WLAN AGC MONITOR 1</description>
            <addressOffset>0x78</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AACIDETECTED</name>
                <description>From AGC module to ED, indicating AACI signal detected, which will be then used to control packet detection and CCA busy assertion.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AGCINPROGRESS</name>
                <description>From AGC module, indicated AGC gain adjustment is in progress, so the ED Module will be in reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>SECONDAGCINPROGRESS</name>
                <description>From AGC module, indicated Second AGC gain adjustment is in progress.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>AGCRSSIDBM</name>
                <description>Inband RSSI at antenna input as seen by the AGC module. This is computed on the ADC output samples.</description>
                <lsb>3</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>AGCRSSIVALID</name>
                <description>AGC Rssi valid.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>BBGAINTORF</name>
                <description>Baseband gain (VGA) to the RF module from AGC</description>
                <lsb>12</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>LNASTAGETORF</name>
                <description>LNA gain stage to the RF Module from AGC (0-4)</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>RFRSSISTART</name>
                <description>From AGC module to RF, requesting fresh computation of 3-bit RF RSSI value to determine if LNA is saturating.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCMONITOR2</name>
            <description>WLAN AGC MONITOR 2</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TOTALGAINDB</name>
                <description>The sum of BB gain in dB and LNA gain in dB.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCMONITOR3</name>
            <description>WLAN AGC MONITOR 3</description>
            <addressOffset>0x80</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEBANDGAINCONTROLLERFSMSTATE</name>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DoGainInit</name>
                    <description>DO_GAIN_INIT</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForGainSettle</name>
                    <description>WAIT_FOR_GAIN_SETTLE_INIT</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainChangeDoneIni</name>
                    <description>GAIN_CHANGE_DONE_INIT</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForInitDoneA</name>
                    <description>WAIT_FOR_INIT_DONE_ACK</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OptGainIterInit</name>
                    <description>OPT_GAIN_ITER_INIT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EstSigLevel</name>
                    <description>EST_SIG_LEVEL</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForGainSettle7</name>
                    <description>WAIT_FOR_GAIN_SETTLE_VAR_EST</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ReadjGainInit</name>
                    <description>READJ_GAIN_INIT</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForGainSettle9</name>
                    <description>WAIT_FOR_GAIN_SETTLE_READJ</description>
                    <value>0x9</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIPCOUNTERFSMSTATE</name>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForClipTrig</name>
                    <description>WAIT_FOR_CLIP_TRIG</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForOneshot</name>
                    <description>WAIT_FOR_ONESHOT</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VARIANCEESTIMATIONFSMSTATE</name>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForVarTrig</name>
                    <description>WAIT_FOR_VAR_TRIG</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForOneshot</name>
                    <description>WAIT_FOR_ONESHOT</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AACIDETECTIONFSMSTATE</name>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DoAaciCheck</name>
                    <description>DO_AACI_CHECK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CheckAaciDisapDet</name>
                    <description>CHECK_AACI_DISAP_DET</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IncrLnaGain</name>
                    <description>INCR_LNA_GAIN</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForAgcRssiUp</name>
                    <description>WAIT_FOR_AGC_RSSI_UPDATE</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForReadjDone</name>
                    <description>WAIT_FOR_READJ_DONE</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForAaciDisap</name>
                    <description>WAIT_FOR_AACI_DISAP</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LNAGAINCONTROLLERFSMSTATE</name>
                <lsb>11</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Init</name>
                    <description>INIT</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TrigIncrDecrFreez</name>
                    <description>TRIG_INCR_DECR_FREEZE</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainAdjustWait</name>
                    <description>GAIN_ADJUST_WAIT</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainAdjustIter</name>
                    <description>GAIN_ADJUST_ITER</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WlanIncrWait</name>
                    <description>WLAN_INCR_WAIT</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AGCCONTROLLERFSMSTATE</name>
                <lsb>14</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Idle</name>
                    <description>IDLE</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InitBbGainSetup</name>
                    <description>INIT_BB_GAIN_SETUP</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TriggerState</name>
                    <description>TRIGGER_STATE</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitAftTrig</name>
                    <description>WAIT_AFT_TRIG</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WaitForLgcDone</name>
                    <description>WAIT_FOR_LGC_DONE</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TrigOptBbGain</name>
                    <description>TRIG_OPT_BB_GAIN</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AaciDet</name>
                    <description>AACI_DET</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SagcAftTrig</name>
                    <description>SAGC_AFT_TRIG</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SagcOptBbGain</name>
                    <description>SAGC_OPT_BB_GAIN</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANAGCDEBUGRFRSSI</name>
            <description>WLAN AGC DEBUG RF RSSI</description>
            <addressOffset>0x84</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANAGCDEBUGRFRSSIENABLE</name>
                <description>This field enables the overwrites of the RF RSSI done and value signals from RF module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANAGCDEBUGRFRSSIDONE</name>
                <description>This field overwrites the RF RSSI valid signal (the completion of RSSI value computation) From RF module.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANAGCDEBUGRFRSSIVALUE</name>
                <description>This field overwrites the 3-bit RF RSSI value From RF module. Higher value like 7 indicates severe saturation at LNA output. This is an 3-bit signed.</description>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANAGCDEBUGRFMAPPEDGAINENABLE</name>
                <description>This field enables the overwrites of the RF lnaStageToRf and bbGainToRf signals to RF module.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANAGCDEBUGRFLNASTAGEVALUE</name>
                <description>This field overwrites the lnaStageToRf value to RF module. u3.0.</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANAGCDEBUGRFBBGAINVALUE</name>
                <description>This field overwrites the bbGainToRf value to RF module. s7.0.</description>
                <lsb>9</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
        </cluster>
