ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <cluster>
          <name>WLAN_VITERBI</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_VITERBI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0B000</addressOffset>
          <register>
            <name>CONTROL0</name>
            <description>WLAN VITERBI CONTROL0</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANVITERBIDONEEFCLEAR</name>
                <description>0 : Do nothing1 : Clear the event flag WLAN_VITERBI_DONE_EF_STATUSThis bit automatically returns to 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LATCHEDSOFTWARERESET</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RemoveReset</name>
                    <description>Remove reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ApplyReset</name>
                    <description>Apply reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PULSEDSOFTWARERESET</name>
                <description>0 : Do nothing1 : Apply a pulsed software resetThis bit is automatically returns to 0</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MINSTATETRACEBACK</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TraceBackFromZeroSta</name>
                    <description>Trace back from zero state</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TraceBackFromMinimum</name>
                    <description>Trace back from minimum state</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PUNCTURERATE</name>
                <description>PUNCTURE_RATEOptions are</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Rate12</name>
                    <description>rate = 1/2</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rate23</name>
                    <description>rate = 2/3</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rate34</name>
                    <description>rate = 3/4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rate56</name>
                    <description>rate = 5/6</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HESIGBMODE</name>
                <description>HESIGB_MODEOptions are</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalVhtPacket</name>
                    <description>Normal VHT packet</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigBUncompressed</name>
                    <description>HE-SIG-B uncompressed 20/40 MHz ppduBW (18-bit common field, 52-bit User block field)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigBUncompressed2</name>
                    <description>HE-SIG-B uncompressed 80 MHz ppduBw (27-bit common field, 52-bit User block field)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigBCompressedN</name>
                    <description>HE-SIG-B compressed (no common field, 52-bit User block field)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PACKETLENGTHREMAINDERBITS</name>
                <description>PACKET_LENGTH_REMAINDER_BITS Options are</description>
                <lsb>12</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0Bits</name>
                    <description>0 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1Bit</name>
                    <description>1 bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Bits</name>
                    <description>2 bits</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Bits</name>
                    <description>4 bits</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>5Bits</name>
                    <description>5 bits</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6Bits</name>
                    <description>6 bits</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Bits</name>
                    <description>3 bits</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GENERATEEOP</name>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTGenerateAnEopFl</name>
                    <description>Don't generate an EOP flag at the end of the packet</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GenerateAnEopFlagAtT</name>
                    <description>Generate an EOP flag at the end of the packet</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REMOVETAILBITS</name>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputDataBytesConta</name>
                    <description>Output data bytes contain tail bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TailBitsAreNotOutput</name>
                    <description>Tail bits are not output</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL1</name>
            <description>WLAN VITERBI CONTROL1</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKETLENGTHBYTES</name>
                <description>Packet length in bytes</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>START</name>
            <description>WLAN VITERBI START</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VITERBIACTIVE</name>
                <description>ACTIVE=0 when the Wi-Fi Vietrbi is idle, and ACTIVE=1 when the Wi-Fi Viterbi is active.When ACTIVE==1, writing to this bit has no effect.When ACTIVE= =0, writing ACTIVE= 1 causes the Wi-Fi Viterbi to start an operation using theparameters set in the registers above.ACTIVE automatically returns to 0 when the Viterbi operation completes after last trace back</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPDMATBUSCONTROL</name>
            <description>WLAN VITERBI IPDMA TBUS CONTROL</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IPDMATBUSSTALLWHENCOMPLETE</name>
                <description>Controls whether TBus write port stalls upstream when the Viterbi job is complete:</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ViterbiTbusWritePort</name>
                    <description>Viterbi TBus write port discards data when the Viterbi job is complete</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ViterbiTbusWritePort1</name>
                    <description>Viterbi TBus write port stalls upstream when the Viterbi job is complete</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>WLAN VITERBI STATUS</description>
            <addressOffset>0x34</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANVITERBIDONEEFSTATUS</name>
                <description>WLAN_VITERBI_DONE_EF_STATUS is set to 1 when an VITERBI operation completes,and is cleared when 1 is written to WLAN_VITERBI_DONE_EF_CLEAR in the WLAN_VITERBI_CONTROL0 register.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COREID</name>
            <description>WLAN VITERBI CORE ID</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x000F0E00</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGURATIONID</name>
                <description>Configuration of the core.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>COREID</name>
                <description>Identifies the member of the IP group. [0x0E = Wireless LAN Viterbi]</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GROUPID</name>
                <description>Identifies core as part of an IMG IP family group. [0x0F = UCC]</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COREREVISION</name>
            <description>WLAN VITERBI CORE REVISION</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAINTENANCEREV</name>
                <description>Maintenance Release Revision.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MINORREV</name>
                <description>Core Minor Release Revision.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MAJORREV</name>
                <description>Family Major Release Revision.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_RTM_FD</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_RTM_FD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0C000</addressOffset>
          <register>
            <name>RESET</name>
            <description>WLAN RTM FD RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMFDLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMFDSTATSCOUNTERSRESET</name>
                <description>Self-clearing software reset for the statistics counters.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>WLAN RTM FD CONFIG</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000030</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDOPERATINGBW</name>
                <description>Receiver operating bandwidth:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20 MHz,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMFDPRIMEOFFSET</name>
                <description>Prime offset for 40 MHz operating bandwidth:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Low,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>High</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMFDSTA20MHZOFFSET</name>
                <description>Selects the 20MHz partition of the BSS operating bandwidth (up to 80 MHz supported):0-1: when BSS operating bandwidth is 400-3: when BSS operating bandwidth is 80</description>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRTMFDCHEAVERAGEENA</name>
                <description>Enable / disable L-LTF and L-SIG channel estimations average. L-LTF estimation is output when the average is disabled.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRTMFDCHESMOOTHINGENA</name>
                <description>Enable / disable channel estimation smoothing.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANRTMFDPARTIALAID</name>
                <description>Partial association ID : combination of the association ID and the BSSID.</description>
                <lsb>6</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>WLANRTMFDCPEDATADIS</name>
                <description>Disable CPE compensation for data OFDM symbols.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMFDCPEHEADERSDIS</name>
                <description>Disable CPE compensation for headers OFDM symbols.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMFDBSSCHECKDIS</name>
                <description>Disable BSS association checks: PARTIAL_AID and BSS_COLOR.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANRTMFDMAPROCESSINGDIS</name>
                <description>Disable midambles processing. When disabled the MIMO Channel Estimation matrix is not updated for the midambles.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>WLANRTMFDBEAMFORMSUPPORT</name>
                <description>Enable support for Beamforming. When disabled the unsupported flag will be rised when a NDP is detected.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG1</name>
            <description>WLAN RTM FD CONFIG 1</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00259A0E</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDRSDTHRESHSLOPE</name>
                <description>Repeated L-SIG detector SNR threshold interpolation slope:threshold =WLAN_RTM_FD_RSD_THRESH_SLOPE * SNRdB + WLAN_RTM_FD_RSD_THRESH_OFFSET</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRTMFDRSDTHRESHOFFSET</name>
                <description>Repeated L-SIG detector SNR threshold interpolation offset:threshold =WLAN_RTM_FD_RSD_THRESH_SLOPE * SNRdB + WLAN_RTM_FD_RSD_THRESH_OFFSET</description>
                <lsb>8</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMFDHIGHESTSUPPORTEDMCS</name>
                <description>Configure the highest supported MCS: detected packets with MCS greater than WLAN_RTM_FD_HIGHEST_SUPPORTED_MCS will be dropped.NOTE: the final highest MCS will be the minimum of this register and the internal value (i.e. HT: 7, VHT: 8 for SigBW20, 9 for SigBW40, HE-SU/MU: 9, HE-ER: 2 for SigBW20, 0 for SigBW40</description>
                <lsb>18</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANRTMFDCSIDOWNSAMPLE</name>
                <description>CSI_DOWNSAMPLE:</description>
                <lsb>22</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDownsample</name>
                    <description>No downsample</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DownsampleBy2</name>
                    <description>Downsample by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DownsampleBy4</name>
                    <description>Downsample by 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unused</name>
                    <description>Unused</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG2</name>
            <description>WLAN RTM FD CONFIG 2</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHEMUSTAIDVIF0</name>
                <description>VIF0 - STA identifier for HE-MU</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRTMFDBSSCOLORVIF0</name>
                <description>VIF0 - BSS color of the BSS of which the STA is a member.</description>
                <lsb>11</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMFDNOTUSEDVIF0</name>
                <description>Set to mark the VIF0 as not used: STA-ID and BSS color will be ignored.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMFDCSILOCKPHYONLY</name>
                <description>Set when MAC is not present; WLAN_RTM_FD_CSI_LOCK is used.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANRTMFDCSILOCK</name>
                <description>CSI lock value, use when WLAN_RTM_FD_CSI_LOCK_PHY_ONLY is set.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
