ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>GENSTATUS</name>
            <description>WLAN RTM FD GEN STATUS</description>
            <addressOffset>0x10</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDCSMNOTIDLE</name>
                <description>Indicates the training mode - frequency domain is not idle (i.e. processing packet)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMLLTFPROCESSED</name>
                <description>Indicates the legacy LTF fields processing is completed : L-LTF estimated channel</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMLHEADERDECODED</name>
                <description>Indicates the legacy header is decoded : L-SIG</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMHHEADERDECODED</name>
                <description>Indicates the non-legacy header is decoded (when it applies) : HT-SIG / VHT-SIG-A / HE-SIG-A</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMMUHEADERDECODED</name>
                <description>Indicates the multi-user header is decoded (when it applies) : VHT-SIG-B / HE-SIG-B</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMHLTFPROCESSED</name>
                <description>Indicates the non-legacy LTF fields processing is completed : HT-LTF / VHT-LTF / HE-LTFestimated channel</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMDATAPROCESSED</name>
                <description>Indicates all the data OFDM symbols are output to the RXP : L-DATA / HT-DATA / VHT-DATA / HE-DATA</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMFORMATDETECTED</name>
                <description>Indicates the packet format is detected (valid)</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRTMFDCSMPACKETFORMAT</name>
                <description>Packet format:</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LLegacy</name>
                    <description>L (legacy)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ht</name>
                    <description>HT</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Vht</name>
                    <description>VHT</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSu</name>
                    <description>HE-SU</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeMu</name>
                    <description>HE-MU</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeEr</name>
                    <description>HE-ER</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeTb</name>
                    <description>HE-TB</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMFDHBPLSIGERROR</name>
                <description>Indicates L-SIG decoding error:- invalid rate- invalid reserved bits- invalid tail bits- parity check failure</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPHTSIGERROR</name>
                <description>Indicates HT-SIG decoding error:- invalid reserved bits- invalid tail bits- CRC check failure</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPHTSIGUNSUPPORTED</name>
                <description>Indicates HT-SIG unsupported feature:- MCS &amp;gt; 7- STBC &amp;gt; 1</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPVHTSIGAERROR</name>
                <description>Indicates VHT-SIG-A decoding error:- invalid reserved bits- invalid tail bits- CRC check failure</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPVHTSIGAUNSUPPORTED</name>
                <description>Indicates VHT-SIG-A unsupported feature:- Bandwidth &amp;gt; 1- Group ID not 0 or 63 (VHT-MU)- NSTS &amp;gt; 0 if STBC = 0, NSTS &amp;gt; 1 if STBC = 1- MCS &amp;gt; 8 if Bandwidth = 0, MCS &amp;gt; 9 if Bandwidth = 1</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPHESIGAERROR</name>
                <description>Indicates HE-SIG-A decoding error:- invalid reserved bits- invalid tail bits- CRC check failure- mod(L-SIG[length], 3) == 0</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPHESIGAUNSUPPORTED</name>
                <description>Indicates HE-SIG-A unsupported feature:[HE-SU/HE-ER]- UL detected (PPDU is addressed to an AP)- MCS &amp;gt; 9 if HE-SU, MCS &amp;gt; 2 if HE-ER and Bandwidth = 0, MCS &amp;gt; 0 if HE-ER and Bandwidth = 1- Bandwidth &amp;gt; 1- NSTS &amp;gt; 0 if STBC = 0, NSTS &amp;gt; 1 if STBC = 1- HE-TB detected[HE-MU]- HE-SIGB-MCS &amp;gt; 5, HE-SIGB-MCS = 2 or HE-SIGB-MC &amp;gt; 4 if HE-SIGB-DCM enabled- HE-LTF symbols &amp;gt; 8 if Doppler = 0, HE-LTF symbols &amp;gt; 4 if Doppler = 1</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPHESIGBERROR</name>
                <description>Indicates HE-SIG-B decoding error (common and user fields):- invalid tail bits- CRC check failure</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPHESIGBUNSUPPORTED</name>
                <description>Indicates HE-SIG-B unsupported feature:- MCS &amp;gt; 9- DCM = 1 if STBC = 1- NSTS &amp;gt; 0 if STBC = 0, NSTS &amp;gt; 1 if STBC = 1</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANRTMFDHBPBSSCHECKFAIL</name>
                <description>Indicates BSS association check failure:- VHT : PARTIAL_AID not matching WLAN_RTM_FD_PARTIAL_AID- HE-SU/HE-ER : BSS_COLOR not matching WLAN_RTM_FD_BSS_COLOR- HE-MU : STA-ID not matching WLAN_RTM_FD_HEMU_STA_ID or not matchig broadcast STA-IDsNote: PARTIAL_AID and BSS_COLOR checks can be disabled by setting WLAN_RTM_FD_BSS_CHECK_DIS register to 1</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>WLANRTMFDSPATIALREUSEEVENT</name>
                <description>Indicates Spatial Reuse is detected.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANRTMFDRTMPOPERROR</name>
                <description>Indicates POP error event in the RTM-FD.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECSTATUS</name>
            <description>WLAN RTM FD RXPDEC STATUS</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDLSIGVALID</name>
                <description>Indicates when the L-SIG decoded data is available.Note: this register is cleared when soft-reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMFDHTSIGVALID</name>
                <description>Indicates when the HT-SIG / VHT-SIG_A / HE-SIG-A decoded data is available.Note: this register is cleared when soft-reset</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMFDVHTSIGBVALID</name>
                <description>Indicates when the VHT-SIG-B decoded data is available.Note: this register is cleared when soft-reset</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECLSIG</name>
            <description>WLAN RTM FD RXPDEC LSIG</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDLSIGDATA</name>
                <description>L-SIG decoded data - bits 23 .. 0</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECHTSIGL</name>
            <description>WLAN RTM FD RXPDEC HTSIG L</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHTSIGLDATA</name>
                <description>HT-SIG / VHT-SIG-A / HE-SIG-A1 decoded data - bits 23 .. 0</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECHTSIGH</name>
            <description>WLAN RTM FD RXPDEC HTSIG H</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHTSIGHDATA</name>
                <description>HT-SIG / VHT-SIG-A / HE-SIG-A decoded data - bits 47 .. 24</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECHESIGAE</name>
            <description>WLAN RTM FD RXPDEC HESIGA E</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHESIGAEDATA</name>
                <description>HE-SIG-A decoded data - bits 51 .. 48</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECVHTSIGBL</name>
            <description>WLAN RTM FD RXPDEC VHTSIGB L</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDVHTSIGBLDATA</name>
                <description>VHT-SIG-B / HE-SIG-B decoded data - bits 23 .. 0</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECVHTSIGBH</name>
            <description>WLAN RTM FD RXPDEC VHTSIGB H</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDVHTSIGBHDATA</name>
                <description>VHT-SIG-B / HE-SIG-B decoded data - bits 47 .. 24</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECHESIGBE</name>
            <description>WLAN RTM FD RXPDEC HESIGB E</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHESIGBEDATA</name>
                <description>HE-SIG-B decoded data - bits 51 .. 48</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRTMFDHESIGBCEDATA</name>
                <description>HE-SIG-B common field data - bits 26 .. 18</description>
                <lsb>4</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WLANRTMFDHEMUNUMUSEDSC</name>
                <description>HE-MU number of used sub-carriers</description>
                <lsb>13</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXPDECHESIGBC</name>
            <description>WLAN RTM FD RXPDEC HESIGB C</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHESIGBCLDATA</name>
                <description>HE-SIG-B common field data - bits 17 .. 0</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMFDHESIGBUSERINDEX</name>
                <description>HE-SIG-B user field index</description>
                <lsb>18</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER0</name>
            <description>WLAN RTM FD STATS COUNTER 0</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMOFDMCORRELATIONPASSCOUNT</name>
                <description>Number of detected OFDM packets.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER1</name>
            <description>WLAN RTM FD STATS COUNTER 1</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMLTFCORRELATIONFAILCOUNT</name>
                <description>Number of OFDM packets failed FSB detection - peak not found or peak below the threshold.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER2</name>
            <description>WLAN RTM FD STATS COUNTER 2</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMLSIGDECODEFAILCOUNT</name>
                <description>Number of OFDM packets failed L-SIG checks - parity or other conditions.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER3</name>
            <description>WLAN RTM FD STATS COUNTER 3</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHTSIGDECODEFAILCOUNT</name>
                <description>Number of OFDM packets failed HT-SIG checks - CRC or other conditions.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER4</name>
            <description>WLAN RTM FD STATS COUNTER 4</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMVHTSIGADECODEFAILCOUNT</name>
                <description>Number of OFDM packets failed VHT-SIG-A checks - CRC or other conditions.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER5</name>
            <description>WLAN RTM FD STATS COUNTER 5</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHESIGADECODEFAILCOUNT</name>
                <description>Number of OFDM packets failed HE-SIG-A checks - CRC or other conditions.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER6</name>
            <description>WLAN RTM FD STATS COUNTER 6</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHESIGBDECODEFAILCOUNT</name>
                <description>Number of OFDM packets failed HE-SIG-B checks - CRC or other conditions.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER0</name>
            <description>WLAN RTM FD FRAME COUNTER 0</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMLEGACYFRAMECOUNT</name>
                <description>Number of Legacy frames received - increments when the last DATA symbol is sent to the RXP.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER1</name>
            <description>WLAN RTM FD FRAME COUNTER 1</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHTFRAMECOUNT</name>
                <description>Number of HT frames received - increments when the last DATA symbol is sent to the RXP.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER2</name>
            <description>WLAN RTM FD FRAME COUNTER 2</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMVHTFRAMECOUNT</name>
                <description>Number of VHT frames received - increments when the last DATA symbol is sent to the RXP.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER3</name>
            <description>WLAN RTM FD FRAME COUNTER 3</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHESUFRAMECOUNT</name>
                <description>Number of HE-SU frames received - increments when the last DATA symbol is sent to the RXP.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER4</name>
            <description>WLAN RTM FD FRAME COUNTER 4</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHEERFRAMECOUNT</name>
                <description>Number of HE-ER-SU frames received - increments when the last DATA symbol is sent to the RXP.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER5</name>
            <description>WLAN RTM FD FRAME COUNTER 5</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHEMUFRAMECOUNT</name>
                <description>Number of HE-MU frames received - increments when the last DATA symbol is sent to the RXP.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
