ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>FRAMECOUNTER6</name>
            <description>WLAN RTM FD FRAME COUNTER 6</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMUNSUPPORTEDFRAMECOUNT</name>
                <description>Number of received OFDM packets with unsupporterd features - increments when fields of HT-SIG / VHT-SIG-A /HE-SIG-A / HE-SIG-B indicate capabilities/features that are not supported by STA and header is succesfully decoded.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER7</name>
            <description>WLAN RTM FD FRAME COUNTER 7</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMOTHERSTAFRAMECOUNT</name>
                <description>Number of received OFDM packets where packet ID not matcing the STA ID - increments when Partial AID (VHT), BSS Color (HE-SU/HE-ER-SU) or User Field (HE-MU) not matching the configured value and header is succesfully decoded.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER8</name>
            <description>WLAN RTM FD FRAME COUNTER 8</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMVHTNDPFRAMECOUNT</name>
                <description>Number of VHT NDP frames received - increments when the last VHT-LTF symbol is sent to the SVD.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAMECOUNTER9</name>
            <description>WLAN RTM FD FRAME COUNTER 9</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMHESUNDPFRAMECOUNT</name>
                <description>Number of HE-SU NDP frames received - increments when the last HE-LTF symbol is sent to the SVD.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER7</name>
            <description>WLAN RTM FD STATS COUNTER 7</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMS2LTIMEOUTFAILCOUNT</name>
                <description>Number of OFDM packets failed due to missing S2L event.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCTRL0</name>
            <description>WLAN RTM FD SR CTRL 0</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMNONSRGOBSSPDSRENA</name>
                <description>Enable spatial reuse in overlapping-BSS with preamble detection in non-spatial reuse group cases.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMSRGOBSSPDSRENA</name>
                <description>Enable spatial reuse in overlapping-BSS with preamble detection in spatial reuse group cases.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG0</name>
            <description>WLAN RTM FD SR CONFIG 0</description>
            <addressOffset>0x84</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000AEAE</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMNONSRGOBSSPDLEVELDB</name>
                <description>Preamble detection level in dBm for non spatial reuse group cases (s7.0). Valid Range : -82 to -62 dBm</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRTMSRGOBSSPDLEVELDB</name>
                <description>Preamble detection level in dBm for spatial reuse group cases (s7.0). Valid Range : -82 to -62 dBm</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG1</name>
            <description>WLAN RTM FD SR CONFIG 1</description>
            <addressOffset>0x88</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRGPARTIALBSSIDBITMAP0</name>
                <description>Indicates the Partial BSSID values used by members of the SRG of which the transmitting STA is a member - bits 23 downto 0. Note: Each bit of the bitmap corresponds to one of the 64 possible values of BSSID[39:44], where the lowest numbered bit corresponds to Partial BSSID value 0 and the highest numbered bit corresponds to Partial BSSID value 63</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG2</name>
            <description>WLAN RTM FD SR CONFIG 2</description>
            <addressOffset>0x8C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRGPARTIALBSSIDBITMAP1</name>
                <description>Indicates the Partial BSSID values used by members of the SRG of which the transmitting STA is a member - bits 47 downto 24. Note: Each bit of the bitmap corresponds to one of the 64 possible values of BSSID[39:44], where the lowest numbered bit corresponds to Partial BSSID value 0 and the highest numbered bit corresponds to Partial BSSID value 63</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG3</name>
            <description>WLAN RTM FD SR CONFIG 3</description>
            <addressOffset>0x90</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRGPARTIALBSSIDBITMAP2</name>
                <description>Indicates the Partial BSSID values used by members of the SRG of which the transmitting STA is a member - bits 63 downto 48. Note: Each bit of the bitmap corresponds to one of the 64 possible values of BSSID[39:44], where the lowest numbered bit corresponds to Partial BSSID value 0 and the highest numbered bit corresponds to Partial BSSID value 63</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG4</name>
            <description>WLAN RTM FD SR CONFIG 4</description>
            <addressOffset>0x94</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRGBSSCOLORBITMAP0</name>
                <description>Indicates the BSS color values used by members of the SRG of which the transmitting STA is a member - bits 23 downto 0. Note: Each bit of the bitmap corresponds to one of the 64 BSS colors, where the lowest numbered bit corresponds to BSS color value 0 and the highest numbered bit corresponds to BSS color value 63.The bit in the bitmap that corresponds to the BSS color value 0 is reserved</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG5</name>
            <description>WLAN RTM FD SR CONFIG 5</description>
            <addressOffset>0x98</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRGBSSCOLORBITMAP1</name>
                <description>Indicates the BSS color values used by members of the SRG of which the transmitting STA is a member - bits 47 downto 24. Note: Each bit of the bitmap corresponds to one of the 64 BSS colors, where the lowest numbered bit corresponds to BSS color value 0 and the highest numbered bit corresponds to BSS color value 63.The bit in the bitmap that corresponds to the BSS color value 0 is reserved</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG6</name>
            <description>WLAN RTM FD SR CONFIG 6</description>
            <addressOffset>0x9C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRGBSSCOLORBITMAP2</name>
                <description>Indicates the BSS color values used by members of the SRG of which the transmitting STA is a member - bits 63 downto 48. Note: Each bit of the bitmap corresponds to one of the 64 BSS colors, where the lowest numbered bit corresponds to BSS color value 0 and the highest numbered bit corresponds to BSS color value 63.The bit in the bitmap that corresponds to the BSS color value 0 is reserved</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCONFIG7</name>
            <description>WLAN RTM FD SR CONFIG 7</description>
            <addressOffset>0xA0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSRVHTPARTIALBSSCOLOR</name>
                <description>Partial BSS color field/</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMSRVHTBSSIDPORTION</name>
                <description>VHT specific BSSID portion</description>
                <lsb>1</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER8</name>
            <description>WLAN RTM FD STATS COUNTER 8</description>
            <addressOffset>0xA4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMSPATIALREUSEEVENTCOUNT</name>
                <description>Number of Spatial Reuse events detected.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG3</name>
            <description>WLAN RTM FD CONFIG 3</description>
            <addressOffset>0xA8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHEMUSTAIDVIF1</name>
                <description>VIF1 - STA identifier for HE-MU</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRTMFDBSSCOLORVIF1</name>
                <description>VIF1 - BSS color of the BSS of which the STA is a member.</description>
                <lsb>11</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMFDNOTUSEDVIF1</name>
                <description>Set to mark the VIF1 as not used: STA-ID and BSS color will be ignored.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG4</name>
            <description>WLAN RTM FD CONFIG 4</description>
            <addressOffset>0xAC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHEMUSTAIDVIF2</name>
                <description>VIF2 - STA identifier for HE-MU</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRTMFDBSSCOLORVIF2</name>
                <description>VIF2 - BSS color of the BSS of which the STA is a member.</description>
                <lsb>11</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMFDNOTUSEDVIF2</name>
                <description>Set to mark the VIF2 as not used: STA-ID and BSS color will be ignored.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG5</name>
            <description>WLAN RTM FD CONFIG 5</description>
            <addressOffset>0xB0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHEMUSTAIDVIF3</name>
                <description>VIF3 - STA identifier for HE-MU</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRTMFDBSSCOLORVIF3</name>
                <description>VIF3 - BSS color of the BSS of which the STA is a member.</description>
                <lsb>11</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMFDNOTUSEDVIF3</name>
                <description>Set to mark the VIF3 as not used: STA-ID and BSS color will be ignored.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG6</name>
            <description>WLAN RTM FD CONFIG 6</description>
            <addressOffset>0xB4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDHEMUBSSIDINDEX</name>
                <description>BSSID index field for a non-transmitted BSSID; set to 0 for transmitted BSSID</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE2L</name>
            <description>WLAN RTM FD SMTH FIR RATE2 L</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-write</access>
            <resetValue>0x0001C0FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE2COEF0</name>
                <description>Smoothing FIR filter, Tu/GI rate 2, coefficient 0, s0.6, default -1</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE2COEF1</name>
                <description>Smoothing FIR filter, Tu/GI rate 2, coefficient 1, s0.6, default 1</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE2COEF2</name>
                <description>Smoothing FIR filter, Tu/GI rate 2, coefficient 2, s0.6, default 7</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE2H</name>
            <description>WLAN RTM FD SMTH FIR RATE2 H</description>
            <addressOffset>0xBC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000A0F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE2COEF3</name>
                <description>Smoothing FIR filter, Tu/GI rate 2, coefficient 3, s0.6, default 15</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE2COEF4</name>
                <description>Smoothing FIR filter, Tu/GI rate 2, coefficient 4, s0.6, default 20</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE4L</name>
            <description>WLAN RTM FD SMTH FIR RATE4 L</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-write</access>
            <resetValue>0x0001C0FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE4COEF0</name>
                <description>Smoothing FIR filter, Tu/GI rate 4, coefficient 0, s0.6, default -1</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE4COEF1</name>
                <description>Smoothing FIR filter, Tu/GI rate 4, coefficient 1, s0.6, default 1</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE4COEF2</name>
                <description>Smoothing FIR filter, Tu/GI rate 4, coefficient 2, s0.6, default 7</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE4H</name>
            <description>WLAN RTM FD SMTH FIR RATE4 H</description>
            <addressOffset>0xC4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000A0F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE4COEF3</name>
                <description>Smoothing FIR filter, Tu/GI rate 4, coefficient 3, s0.6, default 15</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE4COEF4</name>
                <description>Smoothing FIR filter, Tu/GI rate 4, coefficient 4, s0.6, default 20</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE8L</name>
            <description>WLAN RTM FD SMTH FIR RATE8 L</description>
            <addressOffset>0xC8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020201</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE8COEF0</name>
                <description>Smoothing FIR filter, Tu/GI rate 8, coefficient 0, s0.6, default 1</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE8COEF1</name>
                <description>Smoothing FIR filter, Tu/GI rate 8, coefficient 1, s0.6, default 4</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE8COEF2</name>
                <description>Smoothing FIR filter, Tu/GI rate 8, coefficient 2, s0.6, default 8</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE8H</name>
            <description>WLAN RTM FD SMTH FIR RATE8 H</description>
            <addressOffset>0xCC</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000068C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE8COEF3</name>
                <description>Smoothing FIR filter, Tu/GI rate 8, coefficient 3, s0.6, default 12</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE8COEF4</name>
                <description>Smoothing FIR filter, Tu/GI rate 8, coefficient 4, s0.6, default 13</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTHFIRRATE16L</name>
            <description>WLAN RTM FD SMTH FIR RATE16 L</description>
            <addressOffset>0xD0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020282</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE16COEF0</name>
                <description>Smoothing FIR filter, Tu/GI rate 16, coefficient 0, s0.6, default 2</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE16COEF1</name>
                <description>Smoothing FIR filter, Tu/GI rate 16, coefficient 1, s0.6, default 5</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE16COEF2</name>
                <description>Smoothing FIR filter, Tu/GI rate 16, coefficient 2, s0.6, default 8</description>
                <lsb>14</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
