ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>SMTHFIRRATE16H</name>
            <description>WLAN RTM FD SMTH FIR RATE16 H</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000060B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDSMTHFIRRATE16COEF3</name>
                <description>Smoothing FIR filter, Tu/GI rate 16, coefficient 3, s0.6, default 11</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRTMFDSMTHFIRRATE16COEF4</name>
                <description>Smoothing FIR filter, Tu/GI rate 16, coefficient 4, s0.6, default 12</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CHEEXCESSDELAY</name>
            <description>WLAN RTM FD CHE EXCESS DELAY</description>
            <addressOffset>0xD8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDCHEEXCESSDELAY0</name>
                <description>Excess Delay estimate at channel smoothing for the first stream, s0.9</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANRTMFDCHEEXCESSDELAY1</name>
                <description>Excess Delay estimate at channel smoothing for the second stream, s0.9</description>
                <lsb>10</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CHEDMALENGTH</name>
            <description>WLAN RTM FD CHE DMA LENGTH</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMFDCHEDMALENGTH</name>
                <description>Transfer specified number of channel estimates to the EDC through the channel estimates TBus read port. Register value decrements as the channel estimates are transferred.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_RTM_TD</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_RTM_TD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0D000</addressOffset>
          <register>
            <name>RESET</name>
            <description>WLAN RTM TD RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMTDLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMTDSTATSCOUNTERSRESET</name>
                <description>Self-clearing software reset for the statistics counters.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL0</name>
            <description>WLAN RTM TD CONTROL 0</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDCONTROLVALID</name>
                <description>Indicates the control registers WLAN_RTM_TD_CONTROL_0 and WLAN_RTM_TD_CONTROL_1 are valid.Note: default value set when software reset</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ControlRegistersNotY</name>
                    <description>Control registers not yet set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OnlyWlanRtmTdPack</name>
                    <description>Only WLAN_RTM_TD_PACKET_FORMAT is valid</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LegacyFieldsDecoding</name>
                    <description>Legacy fields decoding control registers are valid</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AllTheControlRegiste</name>
                    <description>All the control registers are valid</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDPACKETFORMAT</name>
                <description>Packet format:Note: default value set when software reset</description>
                <lsb>2</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LLegacy</name>
                    <description>L (legacy)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ht</name>
                    <description>HT</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Vht</name>
                    <description>VHT</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSu</name>
                    <description>HE-SU</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeMu</name>
                    <description>HE-MU</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeEr</name>
                    <description>HE-ER</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeTb</name>
                    <description>HE-TB</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDDATAGUARDFORMAT</name>
                <description>Guard duration for DATA symbols :</description>
                <lsb>5</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>04UsLegacyShort</name>
                    <description>0.4us (legacy short),</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>08UsLegacyLong</name>
                    <description>0.8us (legacy long),</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Us</name>
                    <description>1.6us,</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32Us</name>
                    <description>3.2us</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDNUMPREAMBLEOFDMSYM</name>
                <description>Number of preamble / header OFDM symbols, counting after L-SIG (i.e. for legacy packet the value is zero)Note: default value set when software reset</description>
                <lsb>7</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMTDHELTFFORMAT</name>
                <description>HE-LTF format :0: 1x HE-LTF (3.2us)+ 0.8us GI,1: 1x HE-LTF (3.2us)+ 1.6us GI,2: 2x HE-LTF (6.4us)+ 0.8us GI,3: 2x HE-LTF (6.4us)+ 1.6us GI,4: 4x HE-LTF (12.8us) + 0.8us GI,5: 4x HE-LTF (12.8us) + 3.2us GI,6-7: ReservedNote: default value set when software reset</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>WLANRTMTDHEMIDAMBLE</name>
                <description>Midambles configuration :Note: default value set when software reset</description>
                <lsb>15</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoMidambles</name>
                    <description>No midambles,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MidamblesEvery10Ofdm</name>
                    <description>Midambles every 10 OFDM data symbols,</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MidamblesEvery20Ofdm</name>
                    <description>Midambles every 20 OFDM data symbols</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDDETECTVALID</name>
                <description>Indicates the detection control register fields are valid.Note: default value set when software reset</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DetectionControlRegi</name>
                    <description>Detection control register fields not yet set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WlanRtmTdHeDetec</name>
                    <description>WLAN_RTM_TD_HE_DETECTED and WLAN_RTM_TD_LRATE_DETECTED are valid</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDHEDETECTED</name>
                <description>HE detection flag :Note: default value set when software reset</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonHeDetected</name>
                    <description>non-HE detected,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeDetected</name>
                    <description>HE detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDLRATEDETECTED</name>
                <description>L-SIG 6 Mbps detection flag :Note: default value set when software reset</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LSigRateNot6Mbps</name>
                    <description>L-SIG rate not 6 Mbps,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LSigRateIs6Mbps</name>
                    <description>L-SIG rate is 6 Mbps</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMNUMHELTFOFDMSYM</name>
                <description>Number of HE-LTF OFDM symbols in the preamble section (do NOT include the midables HE-LTFs)Note: default value set when software reset</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL1</name>
            <description>WLAN RTM TD CONTROL 1</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDNUMDATAOFDMSYM</name>
                <description>Number of data and midamble (HE only) OFDM symbols. Considered valid if WLAN_RTM_TD_CONTROL_VALID is 2 or 3.Note: default value set when software reset</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG0</name>
            <description>WLAN RTM TD CONFIG 0</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00102FC0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDOPERATINGBW</name>
                <description>Receiver operating bandwidth:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20 MHz,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDPRIMEOFFSET</name>
                <description>Prime offset for 40 MHz operating bandwidth:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Low,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>High</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDDCGTARGETBITOCC</name>
                <description>Digital gain target bit occupancy in dB (u6.0).Default value corresponds to 12 bits SCP (full scale) and 18 dB headroom.</description>
                <lsb>2</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRTMTDDCGDIGGAINHTSTFENA</name>
                <description>Enable / disable digital gain compensation for HT-STF/VHT-STF/HE-STF (2nd AGC enabled).</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANRTMTDDCGDCOFFSETHTSTFENA</name>
                <description>Enable / disable DC offset compensation for HT-STF/VHT-STF/HE-STF (2nd AGC enabled).</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANRTMTDDCGDIGGAINLSTFENA</name>
                <description>Enable / disable digital gain compensation for L-STF.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRTMTDDCGDCOFFSETLSTFENA</name>
                <description>Enable / disable DC offset compensation for L-STF.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMTDSBWTHRESHOLD</name>
                <description>Signal bandwidth detection threshold (u4.0).</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRTMTDCCOROTATIONDIS</name>
                <description>Disable / enable coarse carrier frequency offset correction.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMTDFCOROTATIONDIS</name>
                <description>Disable / enable fine carrier frequency offset correction.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMTDFCORESIDUALDIS</name>
                <description>Disable / enable residual frequency offset correction.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANRTMTDFCODCCOMPDIS</name>
                <description>Disable / enable fine DC offset compensation in FCO.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANRTMTDFCODCTOLERANCE</name>
                <description>?? Tolerance for the FCO-DC estimation calculation (u-8.12).</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG1</name>
            <description>WLAN RTM TD CONFIG 1</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00225C62</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDFSBENERGYSHIFT</name>
                <description>Fine symbol boundary energy scale shift (u3.0).</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANRTMTDFSBENERGYTHRESH</name>
                <description>Fine symbol boundary peak detection threshold ratio (u0.7).</description>
                <lsb>3</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANRTMTDFSBCORRTHRESHOLD</name>
                <description>Fine symbol boundary energy correlation threshold ratio (u0.8).</description>
                <lsb>10</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRTMTDRXWAKEUPTIMEUS</name>
                <description>Standby to Active time in us (u4.2).Note: Used to enable RX prior to expiry of the packet duration counter when Power Save mode is active.</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG2</name>
            <description>WLAN RTM TD CONFIG 2</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDSFOPPMCONVFACT</name>
                <description>Sampling Frequency Offset, time tracking conversion factor: value of [resampler factor] * OpBW/fc,where OpBw is the operating bandwidth and fc is the channel centre frequency. (u-4.20)Note: default value set for resampler factor = 1, OpBW = 20MHz and fc = 5GHz</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRTMTDSFOBYPASS</name>
                <description>Bypass Sample Frequency Offset when set to 1</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRTMTDFSBDETECTLENCRR</name>
                <description>Fine symbol boundary detection length correction factor (s5.0).</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
