ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CONFIG3</name>
            <description>WLAN RTM TD CONFIG 3</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000400</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDCCACONTROLDIS</name>
                <description>Disable / enable CCA control for correlation indication and status known (ED).Timer non-zero flag always zero when disabled.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMTDSECONDAGCDIS</name>
                <description>Disable / enable AGC control for the second estimation (ED/AGC).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMTDSECONDAGCADJUST</name>
                <description>Second AGC start wait time adjustment in number of samples. (s6.0)</description>
                <lsb>2</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANRTMTDSECONDAGCLENSEL</name>
                <description>Second AGC estimation window length selection: ceil(log2(0.8*Fs)) - 3, where Fs is the ADC sampling rate.Note: default value is set assuming Fs equals 40MHz</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMTDJRLENABLE</name>
                <description>Enable/disable Jammer Rejection Logic : ED threshold and minimum variance for OFDM correlation PASS increased toED RSSI snapshot + EdThresholdMargin when Jammer is detected.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WLANRTMTDJRLDETECTIONTHRESHOLD</name>
                <description>Jammer Detection Threshold. Total number of s2lFails required to trigger Jammer detection - 1 (u3.0).</description>
                <lsb>13</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRTMTDJRLEDTHRESHOLDMARGIN</name>
                <description>Headroom added to the minimum variance for OFDM correlation once Jammer signal is detected in dB (u3.0).</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANRTMTDDCGDCOFFSETHTSTFMODE</name>
                <description>0: DC offset compensation for HT-STF/VHT-STF/HE-STF based on RTM-DCG DC estimation (2nd AGC enabled).1: DC offset compensation for HT-STF/VHT-STF/HE-STF based on ED DC estimation.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANRTMTDDCGDCOFFSETLSTFMODE</name>
                <description>0: DC offset compensation for L-STF based on RTM-DCG DC estimation.1: DC offset compensation for L-STF based on ED DC estimation.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENSTATUS</name>
            <description>WLAN RTM TD GEN STATUS</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDCSMNOTIDLE</name>
                <description>Indicates the training mode - time domain is not idle (i.e. processing packet)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMTDCSMS2LDETECTED</name>
                <description>Indicates the S2L event is asserted by the ED</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMTDCSMCCOESTDONE</name>
                <description>Indicates the coarse frequency offset is estimated</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANRTMTDCSMFSBPEAKFOUND</name>
                <description>Indicates the FSB index is calculated : LTF correlation</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRTMTDCSMFCOESTDONE</name>
                <description>Indicates the fine frequency offset is estimated</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRTMTDCSMDATAPROCESSED</name>
                <description>Indicates all the OFDM symbols are output to the FFT</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANRTMTDCCATIMERNONZERO</name>
                <description>CCA timer non-zero</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG0</name>
            <description>WLAN RTM TD EDAGC DEBUG 0</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCDEBUGS2LENA</name>
                <description>Enable/disable ED-AGC debug support : ED-AGC S2L-over signal from register WLAN_RTM_TD_EDAGC_DEBUG_S2LOVER.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRTMTDEDAGCDEBUGCFOENA</name>
                <description>Enable/disable ED-AGC debug support : ED-AGC CFO signals from registers WLAN_RTM_TD_EDAGC_CFO_RE/WLAN_RTM_TD_EDAGC_CFO_IM.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRTMTDEDAGCDEBUGDCENA</name>
                <description>Enable/disable ED-AGC debug support : ED-AGC DC signals from registers WLAN_RTM_TD_EDAGCDC_S2L_RE/WLAN_RTM_TD_EDAGCDC_S2L_IM and WLAN_RTM_TD_EDAGCDC_2ND_RE/WLAN_RTM_TD_EDAGCDC_2ND_IM.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANRTMTDEDAGCDEBUGVARENA</name>
                <description>Enable/disable ED-AGC debug support : ED-AGC prime variance signals from registers WLAN_RTM_TD_EDAGC_PRIME20_VAR/WLAN_RTM_TD_EDAGC_PRIME40_VAR.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRTMTDEDAGCDEBUGS2LOVER</name>
                <description>S2LOver flag emulation : overwrites input signal cin_s2l_over_event.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG1</name>
            <description>WLAN RTM TD EDAGC DEBUG 1</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCCFORE</name>
                <description>ED CFO emulation : overwrites input signal cin_edagccfo_re (s0.23).</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG2</name>
            <description>WLAN RTM TD EDAGC DEBUG 2</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCCFOIM</name>
                <description>ED CFO emulation : overwrites input signal cin_edagccfo_im (s0.23).</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG3</name>
            <description>WLAN RTM TD EDAGC DEBUG 3</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCPRIME20VAR</name>
                <description>ED Prime20 variance emulation : overwrites input signal cin_edprime20_var (u20.0).</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG4</name>
            <description>WLAN RTM TD EDAGC DEBUG 4</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCPRIME40VAR</name>
                <description>ED Prime20 variance emulation : overwrites input signal cin_edprime40_var (u20.0).</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCGSTATUS0</name>
            <description>WLAN RTM TD DCG STATUS 0</description>
            <addressOffset>0x34</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDCGDCOFFSETLSTF</name>
                <description>DC offset estimation for L-STF - complex (s-1.12).</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCGSTATUS1</name>
            <description>WLAN RTM TD DCG STATUS 1</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDCGDIGITALGAINLSTFDB</name>
                <description>Digital gain estimation for L-STF in dBs (s6.2).</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCGSTATUS2</name>
            <description>WLAN RTM TD DCG STATUS 2</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDCGDCOFFSETHTSTF</name>
                <description>DC offset estimation for HT-STF/VHT-STF/HE-STF - complex (s-1.12).</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCGSTATUS3</name>
            <description>WLAN RTM TD DCG STATUS 3</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDCGDIGITALGAINHTSTFDB</name>
                <description>Digital gain estimation for HT-STF/VHT-STF/HE-STF in dBs (s6.2).</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOSTATUS0</name>
            <description>WLAN RTM TD CFO STATUS 0</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDCCOFREQUENCYOFFSET</name>
                <description>Coarse frequency offset estimation (s-5.20).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOSTATUS1</name>
            <description>WLAN RTM TD CFO STATUS 1</description>
            <addressOffset>0x48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDFCOFREQUENCYOFFSET</name>
                <description>Fine frequency offset estimation (s-5.20).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FSBSTATUS</name>
            <description>WLAN RTM TD FSB STATUS</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDFSBLONGGIINDEX</name>
                <description>FSB index for the long guard interval (s7.0).</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRTMTDFSBSHORTGIINDEX</name>
                <description>FSB index for the short guard interval (s7.0).</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>JRLSTATUS</name>
            <description>WLAN RTM TD JRL STATUS</description>
            <addressOffset>0x50</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDJRLSTATUS</name>
                <description>Jammer detection status (cleared on low energy detection):</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoJammerHasBeenDetec</name>
                    <description>no Jammer has been detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>JammerHasBeenDetecte</name>
                    <description>Jammer has been detected (number of consecutive S2L fails equals JRL_DETECTION_THRESHOLD)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDJRLS2LFAILSCNT</name>
                <description>Consecutive number of S2L fails after every ED.</description>
                <lsb>1</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRTMTDJRLEDRSSISNAPSHOT</name>
                <description>ED RSSI (in dBm) snapshot taken after the latest ED-done event.</description>
                <lsb>4</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG4</name>
            <description>WLAN RTM TD CONFIG 4</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00501062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDCFOPPMCONVFACT</name>
                <description>Carrier Frequency Offset, to PPM conversion factor: value of OpBW/fc,where OpBw is the operating bandwidth and fc is the channel centre frequency. (u-4.20)Note: default value set for OpBW = 20MHz and fc = 5GHz</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRTMTDCORECLKFREQMHZ</name>
                <description>Core clock frequency in MHz. (u8.0)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER0</name>
            <description>WLAN RTM TD STATS COUNTER 0</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMLOWENERGYEVENTCOUNT</name>
                <description>Number of low energy events detected.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER1</name>
            <description>WLAN RTM TD STATS COUNTER 1</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMPOPEVENTCOUNT</name>
                <description>Number of packet-over-packet events detected.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG5</name>
            <description>WLAN RTM TD CONFIG 5</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000281D</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMRSSICONVFACTOR</name>
                <description>The LTF-RSSI conversion factor. s7.0This factor represents the conversion from voltage domain (power in dBm) in analog to digital representation of IQ's.LTF_RSSI_DBM = LTF_POWER_DB - AGC_GAIN_DB - DGC_GAIN_DB - WLAN_RTM_RSSI_CONV_FACTOR</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRTMTDAGCSAMPRATEMHZ</name>
                <description>AGC sampling rate MHz. (u8.0)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRTMTDSECAGCSTARTIDOFFS</name>
                <description>Second AGC start ID offset (at AGC sampling rate). (s7.0)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RSSISTATUS</name>
            <description>WLAN RTM TD RSSI STATUS</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDRSSILTFDBM</name>
                <description>The RSSI computation of HT-LTF/VHT-LTF/HE-LTF is an indicative of the DATA field power in dBm.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINEDCEST</name>
            <description>WLAN RTM TD FINE DC EST</description>
            <addressOffset>0x68</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDFINEDCESTIM</name>
                <description>Fine DC estimation imaginary part S-1.12.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMTDFINEDCESTRE</name>
                <description>Fine DC estimation real part S-1.12.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER2</name>
            <description>WLAN RTM TD STATS COUNTER 2</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMMIDPACKETDETECTCOUNT</name>
                <description>Number of mid-packet detected.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGGING</name>
            <description>WLAN RTM TD DEBUG</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDEBUG</name>
                <description>Enable debug registers WLAN_RTM_TD_DEBUG_VALID and WLAN_RTM_TD_DEBUG_ENABLE</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
