ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>DEBUGVALID</name>
            <description>WLAN RTM TD DEBUG VALID</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDEBUGVALID</name>
                <description>Live state of the valid flow control signals0: valid_up_l1: valid_dw_l2: dcg_valid_up3: dcg_fco_valid_up4: dcg_valid_dw5: atn_valid_up6: atn_valid_dw7: cco_valid_up8: cco_valid_dw9: cco_atn_valid10: atn_cco_valid11: fsb_valid_up12: fsb_valid_dw13: fco_valid_up14: fco_valid_dw15: fco_atn_valid16: atn_fco_valid17: rsd_atn_valid18: sbw_valid_up19: sbw_valid_dw</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGENABLE</name>
            <description>WLAN RTM TD DEBUG ENABLE</description>
            <addressOffset>0x78</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDDEBUGENABLE</name>
                <description>Live state of the enable flow control signals0: enable_up_l1: enable_dw_l2: dcg_enable_up3: dcg_fco_enable_up4: dcg_enable_dw5: atn_enable_up6: atn_enable_dw7: cco_enable_up8: cco_enable_dw9: cco_atn_enable10: atn_cco_enable11: fsb_enable_up12: fsb_enable_dw13: fco_enable_up14: fco_enable_dw15: fco_atn_enable16: atn_fco_enable17: rsd_atn_enable18: sbw_enable_up19: sbw_enable_dw</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL2</name>
            <description>WLAN RTM TD CONTROL 2</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDSCOCCUPANCYLEVEL</name>
                <description>Sub-carriers occupancy level:0: High : &amp;gt;= 81.25 percent of sub-carriers in a OFDM symbol are used1: Mid: &amp;gt;= 20.3125 percent of sub-carriers in a OFDM symbol are used2: Low: &amp;lt;20.3125 percent of sub-carriersin a OFDM symbolare usedConsidered valid if WLAN_RTM_TD_CONTROL_VALID is 3.Note: default value set when software reset</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG5</name>
            <description>WLAN RTM TD EDAGC DEBUG 5</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCDCS2LIM</name>
                <description>ED DC estimation emulation : overwrites input signal cin_edagcdc_s2l_im (s-1.12).</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMTDEDAGCDCS2LRE</name>
                <description>ED DC estimation emulation : overwrites input signal cin_edagcdc_s2l_re (s-1.12).</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDAGCDEBUG6</name>
            <description>WLAN RTM TD EDAGC DEBUG 6</description>
            <addressOffset>0x84</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRTMTDEDAGCDC2NDIM</name>
                <description>ED DC estimation emulation : overwrites input signal cin_edagcdc_2nd_im (s-1.12).</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRTMTDEDAGCDC2NDRE</name>
                <description>ED DC estimation emulation : overwrites input signal cin_edagcdc_2nd_re (s-1.12).</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_FFT</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_FFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0F000</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>WLAN FFT CONTROL</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000004C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFTDONEEFCLEAR</name>
                <description>0 : Do nothing1 : Clear the event flag WLAN_FFT_DONE_EF_STATUSThis bit automatically returns to 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FFTBYPASS</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PerformFftIfftOpera</name>
                    <description>Perform FFT/IFFT operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMTDBYPASS</name>
                <description>Set the Receiver Training Mode - Time Domain in bypass:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNotBypassRxTrainin</name>
                    <description>Do not bypass Rx Training Mode Time Domain</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BypassRxTrainingMode</name>
                    <description>Bypass Rx Training Mode Time Domain</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRTMFDBYPASS</name>
                <description>Set the Receiver Training Mode - Frequency Domain in bypass:Note: The RTM-FD is set in bypass when FFT_BYPASS is 1.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNotBypassRxTrainin</name>
                    <description>Do not bypass Rx Training Mode Time Domain</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BypassRxTrainingMode</name>
                    <description>Bypass Rx Training Mode Time Domain</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IFFT</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PerformFftOperation</name>
                    <description>Perform FFT operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PerformIfftOperation</name>
                    <description>Perform IFFT operation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LDPCENABLED</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LdpcDecodingIsDisabl</name>
                    <description>LDPC decoding is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LdpcDecodingIsEnable</name>
                    <description>LDPC decoding is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANFFTCONFIGAUTOMATIC</name>
                <description>Enable automatic configuration of the WLAN_FFT.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ManualConfigurationM</name>
                    <description>Manual configuration mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticConfigurati</name>
                    <description>Automatic configuration mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANFFTDYNAMICSIZE</name>
                <description>Dynamic FFT size enable.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FftSizeConfiguredByT</name>
                    <description>FFT size configured by the FFT_RADIX_PASS1/IFFT_RADIX_PASS1 registers.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FftSizeConfiguredByS</name>
                    <description>FFT size configured by sideband signal.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IFFTRADIXPASS1</name>
                <description>Select the radix used on the first IFFT pass.Options are0-5 : reserved6 : radix=647 : radix=1288 : radix=2569 : radix=51210-15 : reserved</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>FFTRADIXPASS1</name>
                <description>Select the radix used on the first FFT pass.Options are0-5 : reserved6 : radix=647 : radix=1288 : radix=2569 : radix=51210-15 : reserved</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FFTINPUTSHIFT</name>
                <description>0 : No data shift at the input of the FFT engine.Input to FFT engine is in [0..N-1] order, where N is size of FFT.1 : Data at the input of the FFT engine is shifted such that thesecond half of input vector is swapped with the first half.Input to FFT engine is in [N/2..N-1,0,..N/2-1] order.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANEDMIDPACKET</name>
                <description>Mid-packet energy detection flag:</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DsssOrOfdmPacketDete</name>
                    <description>DSSS or OFDM packet detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MidPacketDetected</name>
                    <description>MID packet detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANFFTDISABLEPHYRESET</name>
                <description>Disable automatic PHY reset.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PhyWillAutomatically</name>
                    <description>PHY will automatically reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PhyWillNotAutomatica</name>
                    <description>PHY will not automatically reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCMENABLED</name>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DcmDecodingIsDisable</name>
                    <description>DCM decoding is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DcmDecodingIsEnabled</name>
                    <description>DCM decoding is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANFFTDYNAMICGAIN</name>
                <description>Dynamic FFT gain (stages shift values):</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FftGainConfiguredByT</name>
                    <description>FFT gain configured by the WLAN_FFT_SHIFT_VALUES registers.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FftGainConfiguredByS</name>
                    <description>FFT gain configured by sideband signal.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LATCHEDSOFTWARERESET</name>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RemoveReset</name>
                    <description>Remove reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ApplyReset</name>
                    <description>Apply reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PULSEDSOFTWARERESET</name>
                <description>0 : Do nothing1 : Apply a pulsed software resetThis bit is automatically returns to 0</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SHIFTVALUES</name>
            <description>WLAN FFT SHIFT VALUES</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SHIFTVALUESTAGE1P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 1.Options are as above</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE2P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 2.Options are as above</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE3P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 3.Options are as above</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE4P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 4.Options are as above</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE5P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 5.Options are as above</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE6P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 6.Options are as above</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE7P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 7.Options are as above</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE8P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 8.Options are as above</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SHIFTVALUESTAGE9P1</name>
                <description>SHIFT SELECT for Pass 1 / Stage 9.Options are as above</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
