ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>OFDMCONFIG</name>
            <description>WLAN FFT OFDM CONFIG</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INSERTGUARD</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNothing</name>
                    <description>Do nothing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForTransmitInsertGu</name>
                    <description>For transmit, insert Guard to the FFT output data stream</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INSERTSUBCARRIERS</name>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNothing</name>
                    <description>Do nothing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForTransmitInsertNu</name>
                    <description>For transmit, insert null sub-carriers into the FFT input data stream.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REMOVESUBCARRIERS</name>
                <description>0: Do nothing1: For receive, remove the null sub-carriers from the FFT output data stream.Pilots will be outputted first following by data sub-carriers.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GUARDDURATION</name>
                <description>Specifies the guard duration to be inserted or removed:</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>04Us</name>
                    <description>0.4us</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>08Us</name>
                    <description>0.8us</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Us</name>
                    <description>1.6us</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32Us</name>
                    <description>3.2us</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXPCPECFOEST</name>
                <description>When set enables the CFO estimation based on the CPE.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>RXPCPESTBC</name>
                <description>Selects STBC mode. HT-packets only.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonStbc</name>
                    <description>non-STBC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Stbc</name>
                    <description>STBC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXPCPEBYPASS</name>
                <description>CPE compensation control.0 : CPE compensation1 : BypassThis field is used when REMOVE_SUB_CARRIERS is active (RX mode).In both cases pilots will be discarded but when bypass is not activeCPE compensation will be performed.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>OPERATINGWINDOW</name>
                <description>For receive selects the operating window when the channel bandwidth is not equal to the signal bandwidth0 : -3 Most lower operating window1 : -1 Lower operating window2 : +1 Upper operating window3 : +3 Most upper operating windowWhen the channel bandwidth is 40MHz and the signal bandwidth is 20MHz, the operating window should be configured toeither value 1 (lower operating window) or 2 (upper operating window). When the channel bandwidth is 80MHz and the signalbandwidth is 20MHz, the operating window should be configured to either value 1, 2, 3, or 4. 80MHz cbw/ 40MHz sbwshould follow the first case.</description>
                <lsb>10</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>HELTFTYPE</name>
                <description>Type of HE-LTF preamble. For HE formats only.</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1XHeLtf</name>
                    <description>1x HE-LTF</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2XHeLtf</name>
                    <description>2x HE-LTF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4XHeLtf</name>
                    <description>4x HE-LTF</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIGNALBANDWIDTH</name>
                <description>Selects the signal bandwidth0 : 20MHz1 : 40MHz2 : 80MHz3 : reservedMust be equal or less than CHANNEL_BANDWIDTH.For receive, see the OPERATING_WINDOW description.For transmit, when signal bandwidth is less than channel bandwidth, input OFDM symbol will be duplicatedbefore performing inverse FFT. If channel bandwidth is two times signal bandwidth then OFDM symbol will beduplicated and if channel bandwidth is four times signal bandwidth then OFDM symbol will be quadrupled.</description>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RXCHANNELBANDWIDTH</name>
                <description>Selects the channel bandwidth</description>
                <lsb>17</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80Mhz</name>
                    <description>80MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXCHANNELBANDWIDTH</name>
                <description>Selects the channel bandwidth</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80Mhz</name>
                    <description>80MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMCONFIG2</name>
            <description>WLAN FFT OFDM CONFIG 2</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKETTYPE</name>
                <description>Selects packet type:0 : Legacy1 : HT-MF2 : HT-GF3 : VHT4 : HE-SU5 : HE-MU6 : HE-ER7 : HE-TBPackets 0-3 (Legacy, HT_MF, HT_GF, VHT) are in Pre-HE group with OFDM symbol length of 3.2us.HE packet has 12.8us OFDM symbol length.NOTE: Whenever packet_type is configured the initial state of scrambler will be set accordingly.Scrambler is used within CPE block to generate PN sequence for pilot sign generation. PN sequencehas 127 elements and cyclically repeats after 127 OFDM symbols.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>HEMUPPDUSIGBW</name>
                <description>Operating BW of the BSS (Basic Service Set):NOTE: only used for HE-MU packets</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20 MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80Mhz</name>
                    <description>80 MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PPDU20MHZOFFSET</name>
                <description>Selects the 20MHz partition of the PPDU bandwidth (up to 80 MHz supported):0-1: when BSS operating bandwidth is 40 MHz0-3: when BSS operating bandwidth is 80 MHzNOTE: only used when HE-MU packet and HEMU_PPDU_SIGBW &amp;gt;= 40 MHz</description>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RESOURCEUNIT</name>
                <description>Used to determine the positions of pilot and null sub-carriers.Valid range of values for SIGNAL_BANDWIDTH = 20 MHz are [0-8, 37-40, 53-54, 61].Valid range of values for SIGNAL_BANDWIDTH = 40 MHz are [0-17, 37-44, 53-56, 61-62, 65].Only applicable for HE packets.(SIGNAL_BANDWIDTH in WLAN_FFT_OFDM_CONFIG register)</description>
                <lsb>8</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>PEDURATION</name>
                <description>Duration of Packet Extension in microseconds. Only applicable for HE packets.</description>
                <lsb>15</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>ROTATIONMODE</name>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoRotation</name>
                    <description>No rotation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RotationByGammaFacto</name>
                    <description>Rotation by gamma factor for 40MHz signal bandwidth</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RotationByGammaFacto2</name>
                    <description>Rotation by gamma factor for 80MHz signal bandwidth</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DUPLICATIONMODE</name>
                <lsb>22</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDuplication</name>
                    <description>No duplication</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OfdmSymbolDuplicated</name>
                    <description>OFDM symbol duplicated prior to IFFT</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OfdmSymbolQuadrupled</name>
                    <description>OFDM symbol quadrupled prior to IFFT</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>RXPCPECHSTREAM1PILOT[%s]</name>
            <description>Description collection: WLAN FFT RXP CPE CH STREAM1 PILOT</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXPCPECHSTREAM1PILOT</name>
                <description>Channel estimate for stream 1 on the pilot subcarrier.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>RXPCPECHSTREAM2PILOT[%s]</name>
            <description>Description collection: WLAN FFT RXP CPE CH STREAM2 PILOT</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXPCPECHSTREAM2PILOT</name>
                <description>Channel estimate for stream 2 on the pilot subcarrier.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMPMONPASS1A</name>
            <description>WLAN FFT AMP MON PASS1A</description>
            <addressOffset>0x50</addressOffset>
            <access>read-only</access>
            <resetValue>0x00008888</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMPMONSTAGE1P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 1 : format as above</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>AMPMONSTAGE2P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 2 : format as above</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>AMPMONSTAGE3P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 3 : format as above</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>AMPMONSTAGE4P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 415 : full_scale14 : 3 dB below full scale13 : 6 dB below full scale..8 : 21 dB below full scale0-7 : reserved</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMPMONPASS1B</name>
            <description>WLAN FFT AMP MON PASS1B</description>
            <addressOffset>0x54</addressOffset>
            <access>read-only</access>
            <resetValue>0x00008888</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMPMONSTAGE5P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 5 : format as above</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>AMPMONSTAGE6P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 6 : format as above</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>AMPMONSTAGE7P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 7 : format as above</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>AMPMONSTAGE8P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 815 : full_scale14 : 3 dB below full scale13 : 6 dB below full scale..8 : 21 dB below full scale0-7 : reserved</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SATCOUNTPASS1A</name>
            <description>WLAN FFT SAT COUNT PASS1A</description>
            <addressOffset>0x58</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SATCOUNTSTAGE1P1</name>
                <description>Number of saturations in pass1 stage 1</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SATCOUNTSTAGE2P1</name>
                <description>Number of saturations in pass1 stage 2</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SATCOUNTSTAGE3P1</name>
                <description>Number of saturations in pass1 stage 3</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>SATCOUNTSTAGE4P1</name>
                <description>Number of saturations in pass1 stage 4</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SATCOUNTPASS1B</name>
            <description>WLAN FFT SAT COUNT PASS1B</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SATCOUNTSTAGE5P1</name>
                <description>Number of saturations in pass1 stage 5</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SATCOUNTSTAGE6P1</name>
                <description>Number of saturations in pass1 stage 6</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SATCOUNTSTAGE7P1</name>
                <description>Number of saturations in pass1 stage 7</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>SATCOUNTSTAGE8P1</name>
                <description>Number of saturations in pass1 stage 8</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>WLAN FFT STATUS</description>
            <addressOffset>0x60</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFTDONEEFSTATUS</name>
                <description>FFT_DONE_EF_STATUS is set to 1 when an FFT operation completes,and is cleared when 1 is written to FFT_DONE_EF_CLEAR in the WLAN_FFT_CONTROL register.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINALSHIFTVALUE</name>
            <description>WLAN FFT FINAL SHIFT VALUE</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINALSHIFTVALUE</name>
                <description>Signed 2's compliment shift value to be applied after the final stage of an FFT.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXRADIX</name>
            <description>WLAN FFT MAX RADIX</description>
            <addressOffset>0x68</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000100</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXRADIX</name>
                <description>MAX RADIX for FFT Engine</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
