ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>COREID</name>
            <description>WLAN FFT CORE ID</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-only</access>
            <resetValue>0x000F0C00</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGURATIONID</name>
                <description>Configuration of the core.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>COREID</name>
                <description>Identifies the member of the IP group. [0x0C = FFT]</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GROUPID</name>
                <description>Identifies core as part of an IMG IP family group. [0x0F = UCC]</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COREREVISION</name>
            <description>WLAN FFT CORE REVISION</description>
            <addressOffset>0x70</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAINTENANCEREV</name>
                <description>Maintenance Release Revision.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MINORREV</name>
                <description>Core Minor Release Revision.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MAJORREV</name>
                <description>Family Major Release Revision.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STAGE9MONPASS1</name>
            <description>WLAN FFT STAGE9 MON PASS1</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SATCOUNTSTAGE9P1</name>
                <description>Number of saturations in pass1 stage 9</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>AMPMONSTAGE9P1</name>
                <description>Amplitude Monitor - Pass 1 Stage 9</description>
                <lsb>6</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPECONFIG</name>
            <description>WLAN FFT CPE CONFIG</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x000F1062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTCFOPPMCONVFACT</name>
                <description>Carrier Frequency Offset, to PPM conversion factor: value of OpBW/fc,where OpBw is the operating bandwidth and fc is the channel centre frequency. (u-4.20)Note: default value set for OpBW = 20MHz and fc = 5GHz</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANFFTCPEESTNUMSYM</name>
                <description>Number of CPE estimations used for the CPE based frequency offset estimation.</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>WLANFFTCPEESTHEMUMODE</name>
                <description>CPE based frequency offset estimation mode for HE-MU packets:</description>
                <lsb>21</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UseHeSigBAndDataSy</name>
                    <description>Use HE-SIG-B and Data symbols CPE estimations (final HE-SIG-B in ppm is sum to the Data ppm estimations)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseHeSigBSymbolsCp</name>
                    <description>Use HE-SIG-B symbols CPE estimations only</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseDataSymbolsCpeEst</name>
                    <description>Use Data symbols CPE estimations only (if there is only one data Symbol then the HE-SIG-B is used)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANFFTCPECFOESTDIS</name>
                <description>Disable the CFO estimation based on the CPE : ignore RXP_CPE_CFO_EST field</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPESTATUS</name>
            <description>WLAN FFT CPE STATUS</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTCPEFREQUENCYOFFSET</name>
                <description>CPE based frequency offset estimation (s-5.20).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>EXTRACTEDPILOT[%s]</name>
            <description>Description collection: WLAN FFT EXTRACTED PILOT</description>
            <addressOffset>0x80</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFTEXTRACTEDPILOTE</name>
                <description>FFT_EXTRACTED_PILOT_E is updated on every even pilot extracted from FFT output stream.The 6 MSBs of the real and imaginary part are stored.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>FFTEXTRACTEDPILOTO</name>
                <description>FFT_EXTRACTED_PILOT_O is updated on every odd pilot extracted from FFT output stream.The 6 MSBs of the real and imaginary part are stored.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCSCONFIG</name>
            <description>WLAN FFT MCS CONFIG</description>
            <addressOffset>0xA0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCSVALUE</name>
                <description>Modulation and coding scheme</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPECONFIG2</name>
            <description>WLAN FFT CPE CONFIG 2</description>
            <addressOffset>0xA4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTSFOPPMCONVFACT</name>
                <description>Sampling Frequency Offset, time tracking conversion factor: value of [resampler factor] * OpBW/fc,where OpBw is the operating bandwidth and fc is the channel centre frequency. (u-4.20)Note: default value set for resampler factor = 1, OpBW = 20MHz and fc = 5GHz</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANFFTCPERESAMPLERENA</name>
                <description>Enable CPE estimation based SFO error update to the SCP resampler.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPECONFIG3</name>
            <description>WLAN FFT CPE CONFIG 3</description>
            <addressOffset>0xA8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPCPEFIELD</name>
                <description>Selects packet type:0: LSIG (L)1: LDATA (L)2: HTSIG (L)3: HTDATA (HT)4: VHTSIGA (L)5: VHTSIGB (HT)6: VHTDATA (VHT)7: RLSIG (L)8: HESIGA_SU (HT)9: HESIGA_X (HT)10 : HESIGA_ER (HT)11 : HESIGA_MU (HT)12 : HESIGB (VHT)13 : HEDATA_SU (HE)14 : HEDATA_ER (HE)15 : HEDATA_MU (HE)Packet types 0-3 (Legacy, HT_MF, HT_GF, VHT) are in Pre-HE group with OFDM symbol length of 3.2us.HE packet has 12.8us OFDM symbol length.NOTE: Whenever field is configured the initial state of scrambler will be set accordingly.Scrambler is used within CPE block to generate PN sequence for pilot sign generation. PN sequencehas 127 elements and cyclically repeats after 127 OFDM symbols.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDMODE</name>
            <description>WLAN FFT TBUS RD MODE</description>
            <addressOffset>0xAC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTTBUSRDDISCARD</name>
                <description>Discard PBus debug mode output (WLAN_FFT_TBUS_RD_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIRECTCTRL</name>
            <description>WLAN FFT DIRECT CTRL</description>
            <addressOffset>0xB0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTDIRECTINPUT</name>
                <description>Selects whether TXP input comes from previous pipeline stage or EDC (tbus).</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANFFTDIRECTOUTPUT</name>
                <description>Selects whether TXP output goes to next pipeline stage or EDC (tbus).</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTINGSTSNUM</name>
            <description>WLAN FFT STARTING STS NUM</description>
            <addressOffset>0xB4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTINGSTSNUM</name>
                <description>Starting STS num for cyclic shift delay</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2X</name>
                    <description>2x</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1X</name>
                    <description>1x</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3X</name>
                    <description>3x</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDSIGNATURE</name>
            <description>WLAN FFT TBUS RD SIGNATURE</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTTBUSRDSIGNATURE</name>
                <description>TBus debug output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGGING</name>
            <description>WLAN FFT DEBUG</description>
            <addressOffset>0xBC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTDEBUG</name>
                <description>Enable debug registers WLAN_FFT_DEBUG_VALID and WLAN_FFT_DEBUG_ENABLE</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGVALID</name>
            <description>WLAN FFT DEBUG VALID</description>
            <addressOffset>0xC0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTDEBUGVALID</name>
                <description>Live state of the valid flow control signals0: FFT WR1: Unused - Tied to 02: Unused - Tied to 03: Null SC Insertion Input4: Null SC Insertion Output5: FFT Input FIFO Input6: FFT Input FIFO Output7: Engine Input8: Engine Output9: RTM FFT Input10: RTM FFT Output11: FFT Output FIFO Input12: FFT Output FIFO Output13: Raw FFT Output14: Unused - Tied to 015: Unused - Tied to 016: Unused - Tied to 017: FFT RD</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGENABLE</name>
            <description>WLAN FFT DEBUG ENABLE</description>
            <addressOffset>0xC4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTDEBUGENABLE</name>
                <description>Live state of the enable flow control signals0: FFT WR1: Unused - Tied to 02: Unused - Tied to 03: Null SC Insertion Input4: Null SC Insertion Output5: FFT Input FIFO Input6: FFT Input FIFO Output7: Engine Input8: Engine Output9: RTM FFT Input10: RTM FFT Output11: FFT Output FIFO Input12: FFT Output FIFO Output13: Raw FFT Output14: Unused - Tied to 015: Unused - Tied to 016: Unused - Tied to 017: FFT RD</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DYNAMICGAINCONFIG</name>
            <description>WLAN FFT DYNAMIC GAIN CONFIG</description>
            <addressOffset>0xC8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00125255</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTDYNAMICGAINSHIFTHIGH</name>
                <description>FFT gain configuration (shift values) when WLAN_FFT_DYNAMIC_GAIN is set and SC occupancy is High</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANFFTDYNAMICGAINSHIFTMID</name>
                <description>FFT gain configuration (shift values) when WLAN_FFT_DYNAMIC_GAIN is set and SC occupancy is Mid</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANFFTDYNAMICGAINSHIFTLOW</name>
                <description>FFT gain configuration (shift values) when WLAN_FFT_DYNAMIC_GAIN is set and SC occupancy is Low</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IGNOREWRSYNC</name>
            <description>WLAN FFT IGNORE WR SYNC</description>
            <addressOffset>0xCC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANFFTIGNOREWRSYNC</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
