ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <cluster>
          <name>WLAN_TXP_TOP</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_TXP_TOP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x10000</addressOffset>
          <register>
            <name>WLANTXPCONTROL</name>
            <description>WLAN TXP CONTROL</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPSOFTWARERESET</name>
                <description>This register is used to perform a software reset on the WLAN_TXP.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal Operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPDISCARDEXTRAINPUT</name>
                <description>Selects whether extra input after end of packet should be silently discarded.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNotSilentlyDiscard</name>
                    <description>Do not silently discard.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SilentlyDiscard</name>
                    <description>Silently discard.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPTXMODE</name>
                <description>Selects the modulation mode for the TXP.Note DSSS/CCK Modulation is only valid when WLAN_TXP_WIFI_11B_SUPPORT = 1. In such a case the DSSS PLCP preamble and header are added to the stream.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OfdmModulationDepen</name>
                    <description>OFDM Modulation. Depending on WLAN_TXP_STREAM_*_SIZE, all WLAN_TXP_NUM_OUTPUT_STREAM number of TBus read ports can be active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DsssCckModulationO</name>
                    <description>DSSS/CCK Modulation. Only TBus read port 1 is active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSCRAMBLERBYPASS</name>
                <description>Causes the OFDM/DSSS scrambler to be bypassed depending on the modulation in WLAN_TXP_TX_MODE.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ScramblerActive</name>
                    <description>Scrambler active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ScramblerBypassed</name>
                    <description>Scrambler bypassed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPENCODERSELECT</name>
                <description>Selects encoding scheme to be performed. Relevant when WLAN_TXP_TX_MODE is 0.Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1. When WLAN_TXP_LDPC_ENCODER_PRESENT = 0 only convolutional encoding can be performed.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ConvolutionalEncodin</name>
                    <description>Convolutional Encoding. Both inputs to the Stream Parser can be active depending on WLAN_TXP_NUM_CONV_ENCODER.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LdpcEncodingOnlyOne</name>
                    <description>LDPC Encoding. Only one input to the Stream Parser is active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPNUMCONVENCODERACTIVE</name>
                <description>Selects the number of convolutional encoders active in pipeline. Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 0.Note this field is only valid if WLAN_TXP_NUM_CONV_ENCODER = 2. When WLAN_TXP_NUM_CONV_ENCODER = 1 only one convolutional encoder can be active.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1ConvolutionEncoderA</name>
                    <description>1 Convolution Encoder active. Convolutional Encoder Parser bypassed and only one active input to Stream Parser.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2ConvolutionEncoderA</name>
                    <description>2 Convolution Encoder active. Convolutional Encoder Parser alternates bits into each Convolutional Encoder. Both inputs to Stream Parser active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPENCODERCODERATE</name>
                <description>Selects the code rate (k/n) of encoder selected from WLAN_TXP_ENCODER_SELECT. Where k is the number of information bits and n is the number of information plus parity bits.Relevant when WLAN_TXP_TX_MODE is 0.Note if WLAN_TXP_ENCODER_SELECT is 0.1) The convolutional encoder is a rate 1/2 code and appropriate puncturing is performed to bring the code rate to the desired value.2) Both convolutional encoders get same code rate.</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Indicates12CodeRate</name>
                    <description>Indicates 1/2 code rate.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Indicates23CodeRate</name>
                    <description>Indicates 2/3 code rate.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Indicates34CodeRate</name>
                    <description>Indicates 3/4 code rate.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Indicates56CodeRate</name>
                    <description>Indicates 5/6 code rate.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPNUMSAMPPERSYM</name>
                <description>This is the number of samples per symbol. Represents values in the range 1 - 1024, where a value of zero written to the register would result in one sample per symbol.</description>
                <lsb>10</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANTXPGENERATEEOP</name>
                <description>Generate an EOP flag at the end of the packet:</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTGenerateAnEopFl</name>
                    <description>Don't generate an EOP flag at the end of the packet</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GenerateAnEopFlagAtT</name>
                    <description>Generate an EOP flag at the end of the packet</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPSTREAMSIZES</name>
            <description>WLAN TXP STREAM SIZES</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPSTREAM1SIZE</name>
                <description>Selects the number of valid bits at the Stream 1 output of the Stream Parser. Relevant when WLAN_TXP_TX_MODE is 0.Note stream size of 4-bits is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StreamInActive</name>
                    <description>Stream In-active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize1Bit</name>
                    <description>Stream size 1 bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize2Bits</name>
                    <description>Stream size 2 bits.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize3Bits</name>
                    <description>Stream size 3 bits.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize4Bits</name>
                    <description>Stream size 4 bits.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSTREAM2SIZE</name>
                <description>Selects the number of valid bits at the Stream 2 output of the Stream Parser. Relevant when WLAN_TXP_TX_MODE is 0.Note stream size of 4-bits is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1. Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM &amp;gt;= 2.</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StreamInActive</name>
                    <description>Stream In-active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize1Bit</name>
                    <description>Stream size 1 bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize2Bits</name>
                    <description>Stream size 2 bits.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize3Bits</name>
                    <description>Stream size 3 bits.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize4Bits</name>
                    <description>Stream size 4 bits.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSTREAM3SIZE</name>
                <description>Selects the number of valid bits at the Stream 3 output of the Stream Parser. Relevant when WLAN_TXP_TX_MODE is 0.Note stream size of 4-bits is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1. Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM &amp;gt;= 3.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StreamInActive</name>
                    <description>Stream In-active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize1Bit</name>
                    <description>Stream size 1 bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize2Bits</name>
                    <description>Stream size 2 bits.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize3Bits</name>
                    <description>Stream size 3 bits.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize4Bits</name>
                    <description>Stream size 4 bits.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSTREAM4SIZE</name>
                <description>Selects the number of valid bits at the Stream 4 output of the Stream Parser. Relevant when WLAN_TXP_TX_MODE is 0.Note stream size of 4-bits is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1. Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM = 4.</description>
                <lsb>12</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StreamInActive</name>
                    <description>Stream In-active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize1Bit</name>
                    <description>Stream size 1 bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize2Bits</name>
                    <description>Stream size 2 bits.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize3Bits</name>
                    <description>Stream size 3 bits.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StreamSize4Bits</name>
                    <description>Stream size 4 bits.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPSCRAMBLERSTATE</name>
            <description>WLAN TXP SCRAMBLER STATE</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPSCRAMBLERSTATE</name>
                <description>OFDM or DSSS scrambler initial state. The scrambler state is pseudo-random for OFDM and fixed for DSSS. Scrambler state can be changed to any value by writing to this register.Current scrambler state can be observed by reading from register.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPNUMOPSYM</name>
            <description>WLAN TXP NUM OP SYM</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPNUMOPSYM</name>
                <description>Denotes the number of output symbols expected from the TXP.Represents values in the range 1 - 65536, where a value of zero written to the register would result in one symbol. The TXP will give TXP_FIELD_END indication after these many number of symbols have been given out. One symbol consists of NUM_SAMP_PER_SYM samples.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER1CONTROL</name>
            <description>WLAN TXP INTERLEAVER 1 CONTROL</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER1NROWS</name>
                <description>This field specifies the number of active rows in the TXP Bit Interleaver.Note that each 'row' element holds Nbpsc bits of data.Valid values are shown below; other values are reserved and should not be used.Legacy: 3HT20: 4HT40: 6VHT80:9HE: 1, 3, 6, 9, 12Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1NCOLS</name>
                <description>This field specifies the number of active columns in the TXP Bit Interleaver (i.e. row width).Valid values are shown below; other values are reserved and should not be used.Legacy: 16HT20: 13HT40: 18VHT80:26HE: 4, 8, 13, 16, 17, 24, 26, 39Note that the maximum number of columns is 18 when WLAN_TXP_WIFI_AC_SUPPORT = 0.Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1BUFFERSIZE</name>
                <description>This register specifies the number of buffer storage elements required for TXP Bit Interleaver operation.Note that each buffer storage element holds Nbpsc bits of data.It is defined as WLAN_TXP_INTERLEAVER_1_NROWS multiplied by WLAN_TXP_INTERLEAVER_1_NCOLS - the value in this register is ONLY valid when it is derived from valid values in those two registers.</description>
                <lsb>11</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1CONSTMAPMODE</name>
                <description>Specifies the constellation mapping mode.Valid values are below.Other values are reserved and should not be used.000:BPSK (Constellation size M = 2) (Nbpsc = 1, Nbpsc/2 = 1 rounded up from 0.5)001:QPSK (Constellation size M = 4) (Nbpsc = 2, Nbpsc/2 = 1)010:16-QAM (Constellation size M =16) (Nbpsc = 4, Nbpsc/2 = 2)011:64-QAM (Constellation size M =64) (Nbpsc = 6, Nbpsc/2 = 3)100: 256-QAM (Constellation size M = 256) (Nbpsc = 8, Nbpsc/2 = 4)Relevant when WLAN_TXP_TX_MODE is 0. Note mapping mode of 256-QAM is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER2CONTROL</name>
            <description>WLAN TXP INTERLEAVER 2 CONTROL</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER2NROWS</name>
                <description>This field specifies the number of active rows in the TXP Bit Interleaver.Note that each 'row' element holds Nbpsc bits of data.Valid values are shown below; other values are reserved and should not be used.Legacy: 3HT20: 4HT40: 6VHT80:9HE: 1, 3, 6, 9, 12Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2NCOLS</name>
                <description>This field specifies the number of active columns in the TXP Bit Interleaver (i.e. row width).Valid values are shown below; other values are reserved and should not be used.Legacy: 16HT20: 13HT40: 18VHT80:26HE: 4, 8, 13, 16, 17, 24, 26, 39Note that the maximum number of columns is 18 when WLAN_TXP_WIFI_AC_SUPPORT = 0.Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2BUFFERSIZE</name>
                <description>This register specifies the number of buffer storage elements required for TXP Bit Interleaver operation.Note that each buffer storage element holds Nbpsc bits of data.It is defined as WLAN_TXP_INTERLEAVER_2_NROWS multiplied by WLAN_TXP_INTERLEAVER_2_NCOLS - the value in this register is ONLY valid when it is derived from valid values in those two registers.</description>
                <lsb>11</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2CONSTMAPMODE</name>
                <description>Specifies the constellation mapping mode.Valid values are below.Other values are reserved and should not be used.000:BPSK (Constellation size M = 2) (Nbpsc = 1, Nbpsc/2 = 1 rounded up from 0.5)001:QPSK (Constellation size M = 4) (Nbpsc = 2, Nbpsc/2 = 1)010:16-QAM (Constellation size M =16) (Nbpsc = 4, Nbpsc/2 = 2)011:64-QAM (Constellation size M =64) (Nbpsc = 6, Nbpsc/2 = 3)100: 256-QAM (Constellation size M = 256) (Nbpsc = 8, Nbpsc/2 = 4)Relevant when WLAN_TXP_TX_MODE is 0. Note mapping mode of 256-QAM is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
