ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANTXPINTERLEAVER3CONTROL</name>
            <description>WLAN TXP INTERLEAVER 3 CONTROL</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER3NROWS</name>
                <description>This field specifies the number of active rows in the TXP Bit Interleaver.Note that each 'row' element holds Nbpsc bits of data.Valid values are shown below; other values are reserved and should not be used.Legacy: 3HT20: 4HT40: 6VHT80:9HE: 1, 3, 6, 9, 12Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3NCOLS</name>
                <description>This field specifies the number of active columns in the TXP Bit Interleaver (i.e. row width).Valid values are shown below; other values are reserved and should not be used.Legacy: 16HT20: 13HT40: 18VHT80:26HE: 4, 8, 13, 16, 17, 24, 26, 39Note that the maximum number of columns is 18 when WLAN_TXP_WIFI_AC_SUPPORT = 0.Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3BUFFERSIZE</name>
                <description>This register specifies the number of buffer storage elements required for TXP Bit Interleaver operation.Note that each buffer storage element holds Nbpsc bits of data.It is defined as WLAN_TXP_INTERLEAVER_3_NROWS multiplied by WLAN_TXP_INTERLEAVER_3_NCOLS - the value in this register is ONLY valid when it is derived from valid values in those two registers.</description>
                <lsb>11</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3CONSTMAPMODE</name>
                <description>Specifies the constellation mapping mode.Valid values are below.Other values are reserved and should not be used.000:BPSK (Constellation size M = 2) (Nbpsc = 1, Nbpsc/2 = 1 rounded up from 0.5)001:QPSK (Constellation size M = 4) (Nbpsc = 2, Nbpsc/2 = 1)010:16-QAM (Constellation size M =16) (Nbpsc = 4, Nbpsc/2 = 2)011:64-QAM (Constellation size M =64) (Nbpsc = 6, Nbpsc/2 = 3)100: 256-QAM (Constellation size M = 256) (Nbpsc = 8, Nbpsc/2 = 4)Relevant when WLAN_TXP_TX_MODE is 0. Note mapping mode of 256-QAM is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER4CONTROL</name>
            <description>WLAN TXP INTERLEAVER 4 CONTROL</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER4NROWS</name>
                <description>This field specifies the number of active rows in the TXP Bit Interleaver.Note that each 'row' element holds Nbpsc bits of data.Valid values are shown below; other values are reserved and should not be used.Legacy: 3HT20: 4HT40: 6VHT80:9HE: 1, 3, 6, 9, 12Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4NCOLS</name>
                <description>This field specifies the number of active columns in the TXP Bit Interleaver (i.e. row width).Valid values are shown below; other values are reserved and should not be used.Legacy: 16HT20: 13HT40: 18VHT80:26HE: 4, 8, 13, 16, 17, 24, 26, 39Note that the maximum number of columns is 18 when WLAN_TXP_WIFI_AC_SUPPORT = 0.Relevant when WLAN_TXP_TX_MODE is 0.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4BUFFERSIZE</name>
                <description>This register specifies the number of buffer storage elements required for TXP Bit Interleaver operation.Note that each buffer storage element holds Nbpsc bits of data.It is defined as WLAN_TXP_INTERLEAVER_4_NROWS multiplied by WLAN_TXP_INTERLEAVER_4_NCOLS - the value in this register is ONLY valid when it is derived from valid values in those two registers.</description>
                <lsb>11</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4CONSTMAPMODE</name>
                <description>Specifies the constellation mapping mode.Valid values are below.Other values are reserved and should not be used.000:BPSK (Constellation size M = 2) (Nbpsc = 1, Nbpsc/2 = 1 rounded up from 0.5)001:QPSK (Constellation size M = 4) (Nbpsc = 2, Nbpsc/2 = 1)010:16-QAM (Constellation size M =16) (Nbpsc = 4, Nbpsc/2 = 2)011:64-QAM (Constellation size M =64) (Nbpsc = 6, Nbpsc/2 = 3)100: 256-QAM (Constellation size M = 256) (Nbpsc = 8, Nbpsc/2 = 4)Relevant when WLAN_TXP_TX_MODE is 0. Note mapping mode of 256-QAM is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPLDPCCONTROL</name>
            <description>WLAN TXP LDPC CONTROL</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPLDPCZBLOCKSIZE</name>
                <description>Selects the Z-block size of the LDPC encoder. Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1.Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ZBlockSize27Bits</name>
                    <description>Z-Block Size 27 bits.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZBlockSize54Bits</name>
                    <description>Z-Block Size 54 bits.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZBlockSize81Bits</name>
                    <description>Z-Block Size 81 bits.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InvalidValue</name>
                    <description>Invalid value.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPLDPCNUMPARITYREPETITIONBLOCKS</name>
                <description>Defines the number of LDPC blocks equal to or below which:1) The number of parity bits is 1 less than the value configured in WLAN_TXP_LDPC_PARITY_BITS if WLAN_TXP_LDPC_REPETITION_ACTIVE is 0.2) The number of repetition bits is 1 more than the value configured in WLAN_TXP_LDPC_REPETITION_BITS if WLAN_TXP_LDPC_REPETITION_ACTIVE is 1.Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1. Note :1) This field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.2) Represents values in the range 0 to 65535 if WLAN_TXP_WIFI_AC_SUPPORT = 1 or 0 to 1023 otherwise.</description>
                <lsb>4</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPLDPCNUMMESSAGEBLOCKS</name>
            <description>WLAN TXP LDPC NUM MESSAGE BLOCKS</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPLDPCNUMMESSAGEBLOCKS</name>
                <description>Defines the number of LDPC blocks equal to or below which the number of message bits is 1 less than the value configured in WLAN_TXP_LDPC_MESSAGE_BITS. Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1.Note:1) This field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.2) Represents values in the range 0 to 65535 if WLAN_TXP_WIFI_AC_SUPPORT = 1 or 0 to 1023 otherwise.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPLDPCMESSAGEPARITYBITS</name>
            <description>WLAN TXP LDPC MESSAGE PARITY BITS</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPLDPCMESSAGEBITS</name>
                <description>Defines the number of valid message bits in k information bits of a LDPC code word, the remaining bits are zero padded in order to perform block encoding (shortening).Value written to this field and WLAN_TXP_LDPC_NUM_MESSAGE_BLOCKS should be chosen such that the number of valid message bits lie in the range 1 to k-bits. Where the maximum value of k-bits supported by the code word can be obtained from WLAN_TXP_LDPC_Z_BLOCK_SIZE and WLAN_TXP_LDPC_CODE_RATE.Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1. Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANTXPLDPCPARITYBITS</name>
                <description>Defines the number of valid parity bits in (n-k) parity bits of a LDPC code word, the remaining bits are discarded. Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1.Note :1) Value written to this field and WLAN_TXP_LDPC_NUM_PARITY_REPETITION_BLOCKS should be chosen such that the number of valid parity bits lie in the range 1 to (n-k)-bits. Where the maximum value of (n-k)-bits supported by the code word can be obtained from WLAN_TXP_LDPC_Z_BLOCK_SIZE and WLAN_TXP_LDPC_CODE_RATE.2) In case WLAN_TXP_LDPC_REPETITION_ACTIVE is 1 the number of valid parity bits has to be equal to the maximum value of (n-k) bits.3) This field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>12</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPLDPCREPETITION</name>
            <description>WLAN TXP LDPC REPETITION</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPLDPCREPETITIONBITS</name>
                <description>Defines the number of repetition bits to be given out by the LDPC encoder after the message and parity bits. Relevant when WLAN_TXP_TX_MODE is 0, WLAN_TXP_ENCODER_SELECT is 1 and WLAN_TXP_LDPC_REPETITION_ACTIVE is set to 1.Repetition starts with the first valid message bits and continues with the valid parity bits. The valid message and parity bits are resent in this order until the required number of repetition bits have been sent out of the LDPC encoder.Note:1) This field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.2) Note the value written to this field and WLAN_TXP_LDPC_NUM_PARITY_REPETITION_BLOCKS should be chosen such that the number of repetition bits lie in the range 1 to 65535 if WLAN_TXP_WIFI_AC_SUPPORT = 1 or 1 to 8191 otherwise.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANTXPLDPCREPETITIONACTIVE</name>
                <description>Selects if the message and parity bits need to be repeated. Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1.Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RepetitionInActive</name>
                    <description>Repetition In-active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RepetitionActive</name>
                    <description>Repetition Active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x30</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>WLANTXPLDPCHSUBROTATION[%s]</name>
            <description>Description collection: WLAN TXP LDPC H SUB ROTATION</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F7F7F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPLDPCHSUBROTATION0</name>
                <description>Defines the amount of right cyclic shift that needs to be performed on the 3n identity sub-matrix to form the H (parity check) matrix. Valid range is 0 to the Z-block size defined by WLAN_TXP_LDPC_Z_BLOCK_SIZE. Value of 127 defines a null matrix.Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1. Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANTXPLDPCHSUBROTATION1</name>
                <description>Defines the amount of right cyclic shift that needs to be performed on the 3n + 1 identity sub-matrix to form the H (parity check) matrix. Valid range is 0 to the Z-block size defined by WLAN_TXP_LDPC_Z_BLOCK_SIZE. Value of 127 defines a null matrix.Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1. Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>8</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>WLANTXPLDPCHSUBROTATION2</name>
                <description>Defines the amount of right cyclic shift that needs to be performed on the 3n + 2 identity sub-matrix to form the H (parity check) matrix. Valid range is 0 to the Z-block size defined by WLAN_TXP_LDPC_Z_BLOCK_SIZE. Value of 127 defines a null matrix.Relevant when WLAN_TXP_TX_MODE is 0 and WLAN_TXP_ENCODER_SELECT is 1. Note this field is only valid if WLAN_TXP_LDPC_ENCODER_PRESENT = 1.</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPAGGRMPDUDELIMITER</name>
            <description>WLAN TXP AGGR MPDU DELIMITER</description>
            <addressOffset>0xF4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPAGGRMPDUDELIMITER</name>
                <description>Defines the first 16 bits of MPDU delimiter</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPAGGRNUMFLUSHBYTES</name>
            <description>WLAN TXP AGGR NUM FLUSH BYTES</description>
            <addressOffset>0xF8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPAGGRNUMFLUSHBYTES</name>
                <description>Defines the number of zero flush bytes that need to be added by the TXP Aggregation module at the end of a field. Represents values in the range 0 - 1023.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPAGGRNUMPAYLOADBYTES</name>
            <description>WLAN TXP AGGR NUM PAYLOAD BYTES</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPAGGRNUMPAYLOADBYTES</name>
                <description>Defines the number of payload bytes (including 4 byte of CRC-32 if WLAN_TXP_AGGR_ADD_CRC32 is 1) that need to be sent as part of MPDU data by the TXP Aggregation.Represents values in the range 0 - 1048575.</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPAGGRSERVICEBYTES</name>
            <description>WLAN TXP AGGR SERVICE BYTES</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPAGGRSERVICEBYTES</name>
                <description>Defines the first service byte that needs to be added to the output of the TXP Aggregation module, where:1) Bits [7-0] represent the first byte which is needed to compute the descrambler initial state.2) Bits [15-8] represent the second byte which is the CRC-8 computed over VHT Sig-B field or zero for formats other than VHT.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPAGGRNUMNULLMPDU</name>
            <description>WLAN TXP AGGR NUM NULL MPDU</description>
            <addressOffset>0x104</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPAGGRNUMNULLMPDU</name>
                <description>Defines the number of zero length MPDUs with:1) EOF set to 0 that need to be added between two consecutive MPDUs in an A-MPDU to provide the minimum MPDU Start Spacing field.2) EOF set to 1 that need to be added after the last non-zero length MPDU to provide EOF padding.Sent by the TXP Aggregation.Represents values in the range 0 - 262143.</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
