ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANTXPAGGRCONTROL</name>
            <description>WLAN TXP AGGR CONTROL</description>
            <addressOffset>0x108</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPAGGRADDDELIMITER</name>
                <description>Defines whether MPDU Delimiter needs to be transferred before MPDU data to form an A-MPDU subframe by the TXP Aggregation.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MpduDelimiterNotTran</name>
                    <description>MPDU Delimiter not transferred.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MpduDelimiterTransfe</name>
                    <description>MPDU Delimiter transferred.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPAGGRADDCRC32</name>
                <description>Enable or Disable CRC-32 computation on the MPDU data in the TXP Aggregation.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Crc32NotComputed</name>
                    <description>CRC-32 not computed.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crc32ComputedAndApp</name>
                    <description>CRC-32 computed and appended after payload.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPAGGRNUMPADBYTES</name>
                <description>Defines the number of zero pad bytes that need to be appended after the MPDU data for all A-MPDU sub-frames by the TXP Aggregation, except the last one, so that the (WLAN_TXP_AGGR_NUM_PAYLOAD_BYTES + WLAN_TXP_AGGR_NUM_PAD_BYTES) is a multiple of 4.Represents values in the range 0 - 3.</description>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPAGGRNUMEOFPADBYTES</name>
                <description>Defines the number of zero pad bytes that need to be appended after the last A-MPDU sub-frame by the TXP Aggregation to make A-MPDU length equal to PSDU length or a multiple of 4, whichever occurs first.Represents values in the range 0 - 3.</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANTXPAGGRTXFIELD</name>
                <description>Selects the field for which TXP Aggregation is being configured.Note if VHT Sig-B field is being processed the input data is sent to the TXP Aggregation circular buffer. TXP Aggregation should only receive 4 input bytes in this case.Note this field is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LegacyOrHtHighThrou</name>
                    <description>Legacy or HT (High Throughput) fields.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtVeryHighThroughp</name>
                    <description>VHT (Very High Throughput) all other fields.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtVeryHighThroughp4</name>
                    <description>VHT (Very High Throughput) Sig-B field20 MHz,4 bytes taken out of the TXP Aggregation.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtVeryHighThroughp5</name>
                    <description>VHT (Very High Throughput) Sig-B field40 MHz,7 bytes taken out of the TXP Aggregation.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtVeryHighThroughp6</name>
                    <description>VHT (Very High Throughput) Sig-B field80 MHz, 15 bytes taken out of the TXP Aggregation.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtVeryHighThroughp7</name>
                    <description>VHT (Very High Throughput) Sig-B field 160 MHz, 30 bytes taken out of the TXP Aggregation.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPAGGRVHTBITINDEX</name>
                <description>Selects the bit index from which tail bit zero forcing of the output of the OFDM scrambler is enabled for the first flush bytes sent out of the TXP Aggregation at the end of a field.Relevant when WLAN_TXP_AGGR_TX_FIELD is 011 - 111; WLAN_TXP_ENCODER_SELECT is 0; and WLAN_TXP_AGGR_NUM_FLUSH_BYTES is not 0.Note this field is only valid if WLAN_TXP_WIFI_AC_SUPPORT = 1.</description>
                <lsb>11</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANTXPAGGRBYPASS</name>
                <description>Causes the TXP Aggregation to be bypassed.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AggregationNormalOpe</name>
                    <description>Aggregation normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AggregationBypassed</name>
                    <description>Aggregation bypassed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXP11BMODECONTROL</name>
            <description>WLAN TXP 11B MODE CONTROL</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXP11BPACKETFORMAT</name>
                <description>Selects the 802.11b data packet format.Note this field is only valid if WLAN_TXP_WIFI_11B_SUPPORT = 1.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LongDataPacketFormat</name>
                    <description>Long data packet format.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ShortDataPacketForma</name>
                    <description>Short data packet format.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXP11BDATARATE</name>
                <description>Selects the transmission data rate.Note this field is only valid if WLAN_TXP_WIFI_11B_SUPPORT = 1.</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Mbps</name>
                    <description>1 Mbps.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Mbps</name>
                    <description>2 Mbps.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>55Mbps</name>
                    <description>5.5 Mbps.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11Mbps</name>
                    <description>11 Mbps.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXP11BLOCKEDCLOCKS</name>
                <description>Indicates that the transmit frequency and symbol clocks are derived from the same oscillator. This bit shall be set by the PHY layer based on its implementation configuration.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER1CONTROL2</name>
            <description>WLAN TXP INTERLEAVER 1 CONTROL 2</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER1INIREADPOINTER</name>
                <description>Registers WLAN_TXP_INTERLEAVER_n_INI_ROW_SWAP_TYPE/INI_COL_OFFSET/INI_ROW_OFFSET/INI_READ_POINTER control Stage 3 interleaving.To turn off Hardware Stage 3 interleaving set all four registers to 0.To turn on Hardware Stage 3 interleaving configure all four registers correctly with non-zero values.This register specifies the initial value of the read pointer for reading the first element of bits from the read buffer.The value in this register is calculated as follows:((WLAN_TXP_INTERLEAVER_n_INI_ROW_OFFSET * WLAN_TXP_INTERLEAVER_n_NCOLS) + WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1INIROWOFFSET</name>
                <description>Registers WLAN_TXP_INTERLEAVER_n_INI_ROW_SWAP_TYPE/INI_COL_OFFSET/INI_ROW_OFFSET/INI_READ_POINTER control Stage 3 interleaving.To turn off Hardware Stage 3 interleaving set all four registers to 0.To turn on Hardware Stage 3 interleaving configure all four registers correctly with non-zero values.Stage 3 Interleaver, Initial Row Offset. This is the row which holds the first Nbpsc read bits after rotation has been applied.Note that a Row is made up of elements, each element holds Nbpsc bits.Row Offset is computed from the equation in section 2.2.3 (Third interleaver stage), is given in Table 3.Note 1. WLAN_TXP_INTERLEAVER_n_INI_ROW_OFFSET has the range 0 to WLAN_TXP_INTERLEAVER_n_NROWS-1Note 2. The valid values for this register can be found in the HW TRM, see section 7.4.9 (TXP Interleaver).These are derived from the Row Offset equation in the same location.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1INICOLOFFSET</name>
                <description>Registers WLAN_TXP_INTERLEAVER_n_INI_ROW_SWAP_TYPE/INI_COL_OFFSET/INI_ROW_OFFSET/INI_READ_POINTER control Stage 3 interleaving.To turn off Hardware Stage 3 interleaving set all four registers to 0.To turn on Hardware Stage 3 interleaving configure all four registers correctly with non-zero values.Stage 3 Interleaver, Initial Column offset.This is the column which holds the first Nbpsc read bits after rotation has been applied.Note that a Column is made up of elements, each element holds Nbpsc bits.Note 1. WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET has the range 0 to WLAN_TXP_INTERLEAVER_n_NCOLS-1.Note 2. The valid values for this register can be found in the HW TRM, see section 7.4.9 (TXP Interleaver).These are derived from the Row Offset equation in the same location.</description>
                <lsb>12</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1INIROWSWAPTYPE</name>
                <description>Registers WLAN_TXP_INTERLEAVER_n_INI_ROW_SWAP_TYPE/INI_COL_OFFSET/INI_ROW_OFFSET/INI_READ_POINTER control Stage 3 interleaving.To turn off Hardware Stage 3 interleaving set all four registers to 0.To turn on Hardware Stage 3 interleaving configure all four registers correctly with non-zero values.This register is used to specify the row swapping type in use in the column WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET.It is only used when the modulation, set in register WLAN_TXP_INTERLEAVER_n_CONST_MAP_MODE, is set to a modulation scheme that requires row swapping - i.e. not BPSK (Nbpsc = 1) or QPSK (Nbpsc = 2).The value in this register is calculated as follows:For16-QAM (Nbpsc = 4): WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET percent2i.e. 0x0 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is an even number0x1 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is an odd numberFor64-QAM (Nbpsc = 6): WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET percent3i.e. 0x0 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 0,3,6, 9,12,etc0x1 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 1,4,7,10,13,etc0x2 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 2,5,8,11,14,etcFor 256-QAM (Nbpsc = 8): WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET percent4i.e. 0x0 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 0,4, 8,12,etc0x1 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 1,5, 9,13,etc0x2 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 2,6,10,14,etc0x3 when WLAN_TXP_INTERLEAVER_n_INI_COL_OFFSET is 3,7,11,15,etc</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER1LDPCMODE</name>
                <description>Defines the data processing mode when WLAN_TXP_ENCODER_SELECT=1 (i.e. LDPC Encoder is selected).When WLAN_TXP_ENCODER_SELECT=0 this register setting is not relevant.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LdpcToneMappingNotEn</name>
                    <description>LDPC Tone Mapping not enabled.Bypass the Interleaver logic such that received data is output unmodified (i.e. non-VHT frames)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LdpcToneMappingEnabl</name>
                    <description>LDPC Tone Mapping enabled.Apply LDPC Tone Mapping to data received in the Interleaver as configured in register WLAN_TXP_INTERLEAVER_n_CONTROL (i.e. VHT frames).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER2CONTROL2</name>
            <description>WLAN TXP INTERLEAVER 2 CONTROL 2</description>
            <addressOffset>0x114</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER2INIREADPOINTER</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_READ_POINTER</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2INIROWOFFSET</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_ROW_OFFSET</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2INICOLOFFSET</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_COL_OFFSET</description>
                <lsb>12</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2INIROWSWAPTYPE</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_ROW_SWAP_TYPE</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER2LDPCMODE</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_LDPC_MODE</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER3CONTROL2</name>
            <description>WLAN TXP INTERLEAVER 3 CONTROL 2</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER3INIREADPOINTER</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_READ_POINTER</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3INIROWOFFSET</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_ROW_OFFSET</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3INICOLOFFSET</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_COL_OFFSET</description>
                <lsb>12</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3INIROWSWAPTYPE</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_ROW_SWAP_TYPE</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER3LDPCMODE</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_LDPC_MODE</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPINTERLEAVER4CONTROL2</name>
            <description>WLAN TXP INTERLEAVER 4 CONTROL 2</description>
            <addressOffset>0x11C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPINTERLEAVER4INIREADPOINTER</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_READ_POINTER</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4INIROWOFFSET</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_ROW_OFFSET</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4INICOLOFFSET</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_COL_OFFSET</description>
                <lsb>12</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4INIROWSWAPTYPE</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_INI_ROW_SWAP_TYPE</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANTXPINTERLEAVER4LDPCMODE</name>
                <description>For description see WLAN_TXP_INTERLEAVER_1_LDPC_MODE</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
