ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANTXPMAPPERANDPILOTCONTROL</name>
            <description>WLAN TXP MAPPER AND PILOT CONTROL</description>
            <addressOffset>0x120</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPRESOURCEUNITALLOCATION</name>
                <description>Used to determine the number of non null sub-carriers.Valid ranges of values are [0-8, 9-17, 37-40, 41-44, 53-56, 61-62, 65].Only applicable for HE packets.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANTXPPACKETTYPE</name>
                <description>Selects packet type:0 : Legacy1 : HT_MF2 : HT_GF3 : VHT4 : HE_SU5 : HE_MU6 : HE_ER_SU7 : HE_TBPackets 0-3 (Legacy, HT_MF, HT_GF, VHT) are in Pre-HE group with OFDM symbollength of 3.2us. HE packets have 12.8us OFDM symbol length.</description>
                <lsb>7</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPDACHOLDOFF</name>
                <description>Selects DAC output hold-off</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DacOutputHoldOffSpe</name>
                    <description>DAC output hold-off specified by WLAN_CTRL_TX_HOLDOFF</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DacOutputHoldOffSpe1</name>
                    <description>DAC output hold-off specified by WLAN_CTRL_TX_HOLDOFF+WLAN_CTRL_TX_EXTRA_HOLDOFF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPPREAMBLESTART</name>
                <description>Selects condition to start the preamble generator</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StartPreambleGenerat</name>
                    <description>Start preamble generator after first byte of TX vector is received</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StartPreambleGenerat1</name>
                    <description>Start preamble generator after first payload byte after the AMPDU delimiter is received</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSIGNALBANDWIDTH</name>
                <description>Selects samples per symbolNOTE: signal_bandwidth can have different value than channel bandwidth.Please sse the note for the WLAN_TXP_CHANNEL_BANDWIDTH field.</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80Mhz</name>
                    <description>80MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPCHANNELBANDWIDTH</name>
                <description>Selects samples per symbolNOTE: Channel bandwidth can have different value than signal bandwidth in case of Legacy packet type.For Legacy packet type signal bandwidth will always be 20MHz. In this case if channel bandwidth isset to 40MHz Legacy packet will be duplicated and if channel bandwidth is set to 80MHz Legacy packetwill be copied over four segments. Duplication will be handled after TXP (IFFT) and TXP will performcoresponding scaling of I and Q components (over 52, 104 or 208 non-null sub-carriers).Channel bandwidth is not auto-configured and it should be configured to STA Operating bandwidth.</description>
                <lsb>14</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80Mhz</name>
                    <description>80MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPCHAINMODE</name>
                <description>Selects chain mode. HT-packets only.0 : 1x11 : 2x2 (chain 1)2 : 2x2 (chain 2)3 : reservedIt determines the sign of pilots.</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANTXPPILOTBYPASS</name>
                <description>Pilots insertion control.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InsertPilots</name>
                    <description>Insert pilots</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPHELTFTYPE</name>
                <description>Type of HE-LTF preamble. For HE formats only.</description>
                <lsb>19</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1XHeLtf</name>
                    <description>1x HE-LTF</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2XHeLtf</name>
                    <description>2x HE-LTF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4XHeLtf</name>
                    <description>4x HE-LTF</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPHEGI</name>
                <description>Guard interval for HE frames.</description>
                <lsb>21</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>08Us</name>
                    <description>0.8us</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Us</name>
                    <description>1.6us</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32Us</name>
                    <description>3.2us</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPEVENTSTATUS</name>
            <description>WLAN TXP EVENT STATUS</description>
            <addressOffset>0x124</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPFIELDENDSTATUS</name>
                <description>This field indicates the current status of the txp_field_end event. Value of 1 indicates field has ended. Write any value to register to clear flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPSTATE</name>
            <description>WLAN TXP STATE</description>
            <addressOffset>0x128</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPSTREAMPARSEROUTPUTSTATE</name>
                <description>This is a read-only field. Value read out indicates the output state of the Stream Parser in the TXP Core.0: Output enabled, normal operation.1: Output disabled after required symbols and samples have been sent out. Re-enable by asserting a soft or hard reset on the entire TXP (this will also reset any data in the pipeline).Writing to field would not change its value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANTXPAGGRIDLE</name>
                <description>This is a read-only field. Value read out indicates the state of the TXP Aggregation.0: Aggregation busy, should not be reconfigured to process next job.1: Aggregation idle, can be reconfigured to process next job.Writing to field would not change its value.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPCONFIG</name>
            <description>WLAN TXP CONFIG</description>
            <addressOffset>0x12C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000427</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPLDPCENCODERPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the LDPC encoder in the TXP.0: LDPC encoder not present.1: LDPC encoder present.Writing to field would not change its value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANTXPWIFIACSUPPORT</name>
                <description>This is a read-only field. Value read out indicates 802.11ac support in the TXP.0: 802.11ac not supported.1: 802.11ac supported.Writing to field would not change its value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANTXPWIFI11BSUPPORT</name>
                <description>This is a read-only field. Value read out indicates 802.11b support in the TXP.0: 802.11b not supported.1: 802.11b supported.Writing to field would not change its value.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANTXPNUMCONVENCODER</name>
                <description>This is a read-only field. Value read out indicates the number of convolutional encoders present in the TXP. Writing to field would not change its value.</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANTXPNUMOUTPUTSTREAM</name>
                <description>This is a read-only field. Value read out indicates the number of output streams present in the TXP. Writing to field would not change its value.</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPCOREOPCONTROL</name>
            <description>WLAN TXP CORE OP CONTROL</description>
            <addressOffset>0x130</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPCORESTREAM1OPDISCARD</name>
                <description>Discard debug mode output when WLAN_TXP_CORE_STREAM_1_OP_MODE = 1:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPCORESTREAM2OPDISCARD</name>
                <description>Discard debug mode output when WLAN_TXP_CORE_STREAM_2_OP_MODE = 1:Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM &amp;gt;= 2.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPCORESTREAM3OPDISCARD</name>
                <description>Discard debug mode output when WLAN_TXP_CORE_STREAM_3_OP_MODE = 1:Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM &amp;gt;= 3.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPCORESTREAM4OPDISCARD</name>
                <description>Discard debug mode output when WLAN_TXP_CORE_STREAM_4_OP_MODE = 1:Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM = 4.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPCORESTREAM1OPSIGNATURE</name>
            <description>WLAN TXP CORE STREAM 1 OP SIGNATURE</description>
            <addressOffset>0x13C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPCORESTREAM1OPSIGNATURE</name>
                <description>Debug signature from TXP Core Stream 1 output.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPCORESTREAM2OPSIGNATURE</name>
            <description>WLAN TXP CORE STREAM 2 OP SIGNATURE</description>
            <addressOffset>0x148</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPCORESTREAM2OPSIGNATURE</name>
                <description>Debug signature from TXP Core Stream 2 output.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPCORESTREAM3OPSIGNATURE</name>
            <description>WLAN TXP CORE STREAM 3 OP SIGNATURE</description>
            <addressOffset>0x154</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPCORESTREAM3OPSIGNATURE</name>
                <description>Debug signature from TXP Core Stream 3 output.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPCORESTREAM4OPSIGNATURE</name>
            <description>WLAN TXP CORE STREAM 4 OP SIGNATURE</description>
            <addressOffset>0x160</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPCORESTREAM4OPSIGNATURE</name>
                <description>Debug signature from TXP Core Stream 4 output.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORLSIGCONTROL</name>
            <description>WLAN TXP HEADER GENERATOR L SIG CONTROL</description>
            <addressOffset>0x164</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORLSIGRATE</name>
                <description>The value of the L-SIG rate field, only used if WLAN_TXP_TX_MODE is 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORLSIGLENGTH</name>
                <description>The value of the L-SIG length field, only used if WLAN_TXP_TX_MODE is 0.</description>
                <lsb>5</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANTXPTXVECTORPARSERBYPASS</name>
                <description>If set to 1, bypass the Tx Vector Parser.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>WLANTXPPREAMBLEHEADERGENERATORSBYPASS</name>
                <description>If set to 1, bypass both the preamble and header generators.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORHTSIG1CONTROL</name>
            <description>WLAN TXP HEADER GENERATOR HT SIG1 CONTROL</description>
            <addressOffset>0x168</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG1MCS</name>
                <description>The value of the HT-SIG1 MCS field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.Note this field is also used for the VHT header, i.e. ifWLAN_TXP_PACKET_TYPE is 2.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG1HTLENGTH</name>
                <description>The value of the HT-SIG1 HT length field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
