ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANTXPHEADERGENERATORHTSIG2CONTROL</name>
            <description>WLAN TXP HEADER GENERATOR HT SIG2 CONTROL</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2SMOOTHING</name>
                <description>The value of the HT-SIG2 Smoothing field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2NOTSOUNDING</name>
                <description>The value of the HT-SIG2 Not Sounding field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2AGGREGATION</name>
                <description>The value of the HT-SIG2 Aggregation field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2STBC</name>
                <description>The value of the HT-SIG2 STBC field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2FECCODING</name>
                <description>The value of the HT-SIG2 FEC Coding field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2SHORTGI</name>
                <description>The value of the HT-SIG2 Short GI field, only used if WLAN_TXP_TX_MODE is 0and WLAN_TXP_PACKET_TYPE is 1 or 5.Note this field is also used for the VHT header, i.e. ifWLAN_TXP_PACKET_TYPE is 2.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHTSIG2NUMEXTSS</name>
                <description>The value of the HT-SIG2 Number of Extension Spatial Streams field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 1 or 5.</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORVHTSIGA1CONTROL</name>
            <description>WLAN TXP HEADER GENERATOR VHT SIG A1 CONTROL</description>
            <addressOffset>0x170</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA1GROUPID</name>
                <description>The value of the VHT-SIG-A1 Group ID field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA1NSTSPARTIALAID</name>
                <description>The value of the VHT-SIG-A1 NSTS Partial Aid field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>10</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA1TXOPPSNOTALLOWED</name>
                <description>The value of the VHT-SIG-A1 TXOP PS Not Allowed field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORVHTSIGA2CONTROL</name>
            <description>WLAN TXP HEADER GENERATOR VHT SIG A2 CONTROL</description>
            <addressOffset>0x174</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA2SHORTGINSYMDISAMBIG</name>
                <description>The value of the VHT-SIG-A2 Short GI Number of Symbols Disambiguation field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA2SUMU0CODING</name>
                <description>The value of the VHT-SIG-A2 Single User / Multi User 0 Coding field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA2LDPCEXTRASYM</name>
                <description>The value of the VHT-SIG-A2 LDPC Extra Symbol field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGA2BEAMFORMED</name>
                <description>The value of the VHT-SIG-A2 Beamformed field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORVHTSIGBCONTROL</name>
            <description>WLAN TXP HEADER GENERATOR VHT SIG B CONTROL</description>
            <addressOffset>0x178</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORVHTSIGBLENGTH</name>
                <description>Length field in the VHT-SIG-B header, equal to ceil(APEP length / 4)where APEP length comes from the Tx Vector.For 20 MHz only the least-significant 17 bits are used.For 40 MHz only the least-significant 19 bits are used.Only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 3.</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORHESIGA1CONTROL0</name>
            <description>WLAN TXP HEADER GENERATOR HE SIG A1 CONTROL 0</description>
            <addressOffset>0x17C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1FORMAT</name>
                <description>The value of the HE-SIG-A1 FORMAT field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1BEAMCHANGE</name>
                <description>The value of the HE-SIG-A1 BEAM_CHANGE field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1ULDL</name>
                <description>The value of the HE-SIG-A1 UL_DL field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1DCM</name>
                <description>The value of the HE-SIG-A1 DCM field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1BSSCOLOR</name>
                <description>The value of the HE-SIG-A1 BSS_COLOR field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1GIPLUSHELTFSIZE</name>
                <description>The value of the HE-SIG-A1 GI_PLUS_HE_LTF_SIZE field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>10</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1NSTSANDMIDAMBLEPERIODICITY</name>
                <description>The value of the HE-SIG-A1 NSTS_AND_MIDAMBLE_PERIODICITY field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORHESIGA1CONTROL1</name>
            <description>WLAN TXP HEADER GENERATOR HE SIG A1 CONTROL 1</description>
            <addressOffset>0x180</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1SPATIALREUSE1</name>
                <description>The value of the HE-SIG-A1 SPATIAL_REUSE_1 field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1SPATIALREUSE2</name>
                <description>The value of the HE-SIG-A1 SPATIAL_REUSE_2 field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1SPATIALREUSE3</name>
                <description>The value of the HE-SIG-A1 SPATIAL_REUSE_3 field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA1SPATIALREUSE4</name>
                <description>The value of the HE-SIG-A1 SPATIAL_REUSE_4 field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPHEADERGENERATORHESIGA2CONTROL</name>
            <description>WLAN TXP HEADER GENERATOR HE SIG A2 CONTROL</description>
            <addressOffset>0x184</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA2TXOP</name>
                <description>The value of the HE-SIG-A2 TXOP field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA2PREFECPADDINGFACTOR</name>
                <description>The value of the HE-SIG-A1 PRE_FEC_PADDING_FACTORfield,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>7</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA2PEDISAMBIGUITY</name>
                <description>The value of the HE-SIG-A2 PE_DISAMBIGUITY field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA2DOPPLER</name>
                <description>The value of the HE-SIG-A1 DOPPLER field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANTXPHEADERGENERATORHESIGA2RESERVED</name>
                <description>The value of the HE-SIG-A2 RESERVED field,only used if WLAN_TXP_TX_MODE is 0 and WLAN_TXP_PACKET_TYPE is 4 or up.</description>
                <lsb>11</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPREFECPADPHY</name>
            <description>WLAN TXP PRE FEC PAD PHY</description>
            <addressOffset>0x18C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPREFECPADPHY</name>
                <description>Remainder of num_pad_bits/8.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPOSTFECCONTROL0</name>
            <description>WLAN TXP POST FEC CONTROL 0</description>
            <addressOffset>0x190</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPOSTFECBYPASS</name>
                <description>If set to 1, bypass the post-FEC padder.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPTBUSRDCONTROL</name>
            <description>WLAN TXP TBUS RD CONTROL</description>
            <addressOffset>0x194</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPSTREAM1TBUSRDDISCARD</name>
                <description>Discard PBus debug mode output when WLAN_TXP_STREAM_1_TBUS_RD_MODE = 1:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSTREAM2TBUSRDDISCARD</name>
                <description>Discard PBus debug mode output when WLAN_TXP_STREAM_2_TBUS_RD_MODE = 1:Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM &amp;gt;= 2.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSTREAM3TBUSRDDISCARD</name>
                <description>Discard PBus debug mode output when WLAN_TXP_STREAM_3_TBUS_RD_MODE = 1:Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM &amp;gt;= 3.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPSTREAM4TBUSRDDISCARD</name>
                <description>Discard PBus debug mode output when WLAN_TXP_STREAM_4_TBUS_RD_MODE = 1:Note this field is only valid if WLAN_TXP_NUM_OUTPUT_STREAM = 4.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPOSTFECBITSBEFOREPADLSB</name>
            <description>WLAN TXP POST FEC BITS BEFORE PAD LSB</description>
            <addressOffset>0x198</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPOSTFECBITSBEFOREPADLSB</name>
                <description>Number of data bits before the post-FEC padding - LSB</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPOSTFECBITSBEFOREPADMSB</name>
            <description>WLAN TXP POST FEC BITS BEFORE PAD MSB</description>
            <addressOffset>0x19C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPOSTFECBITSBEFOREPADMSB</name>
                <description>Number of data bits before the post-FEC padding - MSB</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPOSTFECBITSAFTERPADLSB</name>
            <description>WLAN TXP POST FEC BITS AFTER PAD LSB</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPOSTFECBITSAFTERPADLSB</name>
                <description>Number of data bits after the post-FEC padding - LSB</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPOSTFECBITSAFTERPADMSB</name>
            <description>WLAN TXP POST FEC BITS AFTER PAD MSB</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPOSTFECBITSAFTERPADMSB</name>
                <description>Number of data bits after the post-FEC padding - MSB</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPPEDURATIONANDDCMCONTROL</name>
            <description>WLAN TXP PE DURATION AND DCM CONTROL</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPPEDURATION</name>
                <description>Packet Extension Duration in microseconds</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANTXPDCMENABLE</name>
                <description>If set to 1, enable Dual Carrier Modulation.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANTXPDCMSINGLEBITPADDING</name>
                <description>If set to 1, enable single-bit padding in BPSK bitstream every WLAN_TXP_DCM_BIT_INSERT_PERIOD bits.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANTXPDCMBITINSERTPERIOD</name>
                <description>Period at which the zero bit is inserted.Relevant only if WLAN_TXP_DCM_SINGLE_BIT_PADDING is 1.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Every50Bits</name>
                    <description>Every 50 bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Every116Bits</name>
                    <description>Every 116 bits</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
