ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANTXPTXPOWERCONTROL</name>
            <description>WLAN TXP TX POWER CONTROL</description>
            <addressOffset>0x1AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPTXPOWERELEZEROGALUT</name>
                <description>TX power value for which IQ imbalance values are stored in 0th index of Gain Angle LUT.Value is in dBm and it can be in the range of -10dBm to +20dBm.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANTXPTXPOWERELEZERODPDLUT</name>
                <description>TX power value for which DPD coefficient values are stored in 0th index of LUT.Value is in dBm and it can be in the range of -10dBm to +10dBm.</description>
                <lsb>6</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPNUMHELTF</name>
            <description>WLAN TXP NUM HE LTF</description>
            <addressOffset>0x1B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPNUMHELTF</name>
                <description>Number of HE-LTF symbols. Encoded as follows:0: 11: 22: 43: 64: 85-7: Reserved</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANTXPSTARTINGSTSNUM</name>
                <description>Starting STS number.</description>
                <lsb>3</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANTXPHELTFMODE</name>
                <description>HE-LTF mode.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPDIRECTCTRL</name>
            <description>WLAN TXP DIRECT CTRL</description>
            <addressOffset>0x1B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPDIRECTINPUT</name>
                <description>Selects whether TXP input comes from previous pipeline stage or EDC (tbus).</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPDIRECTOUTPUT</name>
                <description>Selects whether TXP output goes to next pipeline stage or EDC (tbus).</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANTXPAUTOCONFIGPHYONLY</name>
                <description>Defines auto-configuration for WLAN_TXP_DIRECT_INPUT:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TxpInputComesFromPre</name>
                    <description>TXP input comes from previous pipeline stage (i.e. MAC).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TxpInputComesFromEdc</name>
                    <description>TXP input comes from EDC (tbus)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPDEBUG</name>
            <description>WLAN TXP DEBUG</description>
            <addressOffset>0x1F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPDEBUG</name>
                <description>Enable debug registers WLAN_TXP_DEBUG_VALID and WLAN_TXP_DEBUG_ENABLE</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPDEBUGVALID</name>
            <description>WLAN TXP DEBUG VALID</description>
            <addressOffset>0x1F4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPDEBUGVALID</name>
                <description>Live state of the valid flow control signals0: TXP WR1: Vector Parser Output2: Header Generator Output3: Preamble Generator Output4: Aggregation Input5: DSSS PLCP Input6: TXP Core Input7: DSSS Input8: DSSS Output9: Scrambler Output10: BCC Encoder Output11: Post-FEC Padding Output12: HE-ER-SU Logic Output13: Repacker Output14: DCM Logic Output15: Stream Parser Output16: ODFM Modulator Input17: Interleaver Input18: Interleaver Output19: Mapper Input20: Mapper Output21: Pilot Insertion Output22: TXP RD</description>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPDEBUGENABLE</name>
            <description>WLAN TXP DEBUG ENABLE</description>
            <addressOffset>0x1F8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPDEBUGENABLE</name>
                <description>Live state of the enable flow control signals0: TXP WR1: Vector Parser Output2: Header Generator Output3: Preamble Generator Output4: Aggregation Input5: DSSS PLCP Input6: TXP Core Input7: DSSS Input8: DSSS Output9: Scrambler Output10: BCC Encoder Output11: Post-FEC Padding Output12: HE-ER-SU Logic Output13: Repacker Output14: DCM Logic Output15: Stream Parser Output16: ODFM Modulator Input17: Interleaver Input18: Interleaver Output19: Mapper Input20: Mapper Output21: Pilot Insertion Output22: TXP RD</description>
                <lsb>0</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXPDEBUGSIDEBAND</name>
            <description>WLAN TXP DEBUG SIDEBAND</description>
            <addressOffset>0x1FC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXPDEBUGSIDEBAND</name>
                <description>Live state of the sideband signal</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DataField</name>
                    <description>Data Field</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LStf</name>
                    <description>L-STF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LLtf</name>
                    <description>L-LTF</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HtStfForHtFormatHe</name>
                    <description>HT-STF for HT format, HE-STF for HE formats</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HtLtf1ForHtFormatH</name>
                    <description>HT-LTF1 for HT format, HE-LTF for HE formats</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LSig</name>
                    <description>L-SIG</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HtSig</name>
                    <description>HT-SIG</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtSigA1</name>
                    <description>VHT-SIG-A1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtSigA2</name>
                    <description>VHT-SIG-A2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtSigB20Mhz</name>
                    <description>VHT-SIG-B 20MHz</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VhtSigB40Mhz</name>
                    <description>VHT-SIG-B 40MHz</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigA</name>
                    <description>HE-SIG-A</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXSCP</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_TXSCP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x11000</addressOffset>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CONFIG[%s]</name>
            <description>Description collection: TXSCP CONFIG</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0x000000FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXSCPCFRPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the CFR block in the TX SCP.0: CFR not present.1: CFR present.Writing to field would not change its value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TXSCPDPDPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the DPD block in the TX SCP.0: DPD not present.1: DPD present.Writing to field would not change its value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TXSCPIQIMBALANCEPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the IQ imbalance block in the TX SCP.0: IQ imbalance not present.1: IQ imbalance present.Writing to field would not change its value.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TXSCPINTERPOLATORPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the Interpolator block in the TX SCP.0: Interpolator not present.1: Interpolator present.Writing to field would not change its value.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TXSCPRESAMPLERPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the Resampler block in the TX SCP.0: Resampler not present.1: Resampler present.Writing to field would not change its value.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TXSCPMIXERPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the Mixer block in the TX SCP.0: Mixer not present.1: Mixer present.Writing to field would not change its value.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>TXSCPGAINANGLEPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the Gain Angle block in the TX SCP.0: Gain Angle not present.1: Gain Angle present.Writing to field would not change its value.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TXSCPDCOFFSETPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the DC Offset block in the TX SCP.0: DC Offset not present.1: DC Offset present.Writing to field would not change its value.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TXSCPCFRPREINTERPPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the pre interpolator block in the TX SCP.0: Pre interpolator not present.1: Pre interpolator present.Writing to field would not change its value.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXSCPPCFPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the PCF block in the TX SCP.0: PCF not present.1: PCF present.Writing to field would not change its value.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>TXSCPPREINTERPIQIMBALANCEPRESENT</name>
                <description>This is a read-only field. Value read out indicates the presence of the pre interpolator IQ Imbalance block in the TX SCP.0: Pre interpolator IQ Imbalance not present.1: Pre interpolator IQ Imbalance present.Writing to field would not change its value.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
