ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CTRL[%s]</name>
            <description>Description collection: TXSCP CTRL</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000708</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIXEROUTGAIN</name>
                <description>Selects Mixer output gain:0: Gain of 1.0 is applied to the output of Mixer rotator (default).1: Gain of 2.0 is applied to the output of Mixer rotator (used to compensate for 0.5 gain in real input mode).Relevant when MIXER_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MIXERINVERTSPECTRUM</name>
                <description>Selects Mixer spectrum inversion:0: The mixer output spectrum is not inverted.1: The mixer output spectrum is inverted by swapping I and Q.The mixer design under normal operation inverts the output I and Q samples even if this field is set to 0. To re-invert set field to 1.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RESAMPSCALINGFACTOR</name>
                <description>X8 output scaled by a factor of:</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>025</name>
                    <description>0.25</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>050</name>
                    <description>0.50</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>1.00</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>200</name>
                    <description>2.00</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IQIMBALANCEDISABLE</name>
                <description>Used to set the bypass mode of the IQ imbalance compensation block:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IqImbalanceCompensat</name>
                    <description>IQ imbalance compensation is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IqImbalanceCompensta</name>
                    <description>IQ imbalance compenstation block is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DPDDISABLE</name>
                <description>Used to set the bypass mode of the DPD block:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DpdIsActive</name>
                    <description>DPD is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DpdIsPoweredDownAndD</name>
                    <description>DPD is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFRDISABLE</name>
                <description>Used to set the bypass mode of the CFR block:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CfrIsActive</name>
                    <description>CFR is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CfrIsPoweredDownAndD</name>
                    <description>CFR is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPLINGDISABLE</name>
                <description>Used to set the bypass mode for the resampling operation:</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResamplingOperationA</name>
                    <description>Resampling operation active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResamplingOperationP</name>
                    <description>Resampling operation powered down. The input data to the resampler is sent unaltered to the Mixer.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCOFFSETDISABLE</name>
                <description>Used to set the bypass mode of the DC Offset block:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DcOffsetBlockIsActiv</name>
                    <description>DC Offset block is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DcOffsetBlockIsPower</name>
                    <description>DC Offset block is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GAINANGLEDISABLE</name>
                <description>Used to set the bypass mode of the Gain Angle block:</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GainAngleBlockIsActi</name>
                    <description>Gain Angle block is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GainAngleBlockIsPowe</name>
                    <description>Gain Angle block is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MIXERDISABLE</name>
                <description>Used to set the bypass mode of the Mixer block:</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MixerBlockIsActive</name>
                    <description>Mixer block is active.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MixerBlockIsPoweredD</name>
                    <description>Mixer block is powered down and data passes around it unaltered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTERPDISABLE</name>
                <description>Used to set the bypass mode of the interpolator in TX-SCP block:</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InterpolatorIsActive</name>
                    <description>Interpolator is active (Interpolation factor I = 2).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>InterpolatorIsPowere</name>
                    <description>Interpolator is powered down. Data passes around it unaltered (Interpolation factor I = 1).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PCFENABLE</name>
                <description>Used to set the bypass mode of the PCF in TX-SCP block:</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PcfIsPoweredDownAndD</name>
                    <description>PCF is powered down and data passes around it unaltered.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PcfIsActive</name>
                    <description>PCF is active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PREINTERPOLCFRENABLE</name>
                <description>Used to set the bypass mode of the pre interpolator CFR in TX-SCP block:</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PreInterpolatorCfrIs</name>
                    <description>Pre interpolator CFR is powered down and data passes around it unaltered.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PreInterpolatorCfrIs1</name>
                    <description>Pre interpolator CFR is active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NUMZEROPAD</name>
                <description>Number of padding zeros to add to the input at the end of the packet.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>RESETCTRL[%s]</name>
            <description>Description collection: TXSCP RESET CTRL</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOFTWARERESET1</name>
                <description>Software reset for TX-SCP1.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE1</name>
                <description>Clears Resampler_1 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE1</name>
                <description>Clears Mixer_1 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>SOFTWARERESET2</name>
                <description>Software reset for TX-SCP2.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE2</name>
                <description>Clears Resampler_2 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE2</name>
                <description>Clears Mixer_2 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SOFTWARERESET3</name>
                <description>Software reset for TX-SCP3.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE3</name>
                <description>Clears Resampler_3 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE3</name>
                <description>Clears Mixer_3 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>SOFTWARERESET4</name>
                <description>Software reset for TX-SCP4.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE4</name>
                <description>Clears Resampler_4 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE4</name>
                <description>Clears Mixer_4 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SOFTWARERESET5</name>
                <description>Software reset for TX-SCP5.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE5</name>
                <description>Clears Resampler_5 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE5</name>
                <description>Clears Mixer_5 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>SOFTWARERESET6</name>
                <description>Software reset for TX-SCP6.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE6</name>
                <description>Clears Resampler_6 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE6</name>
                <description>Clears Mixer_6 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>SOFTWARERESET7</name>
                <description>Software reset for TX-SCP7.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE7</name>
                <description>Clears Resampler_7 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE7</name>
                <description>Clears Mixer_7 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>SOFTWARERESET8</name>
                <description>Software reset for TX-SCP8.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset Asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESAMPCLEARPHASE8</name>
                <description>Clears Resampler_8 phase:0: Resampler phase accumulators run normally.1: Resampler phase accumulators are forced to zero.Relevant when RESAMPLING_DISABLE = 0.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>MIXERCLEARPHASE8</name>
                <description>Clears Mixer_8 phase:0: Mixer phase accumulators run normally.1: Mixer phase accumulators are forced to zero.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
