ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PACKETSETTINGS[%s]</name>
            <description>Description collection: TXSCP PACKET SETTINGS</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SBWSELECTION</name>
                <description>Represents the index of SBW parameter set. This index is used to select the SBW parametersfrom one of the four sets.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MVAVGENABLE</name>
                <description>Used to enable the post-resampler moving average filter:0: post-RS filter is powered down and data passes around it unaltered.1: post-RS moving average filter with 2 tap is enabled.2: post-RS moving average filter with 4 tap is enabled.3: post-RS moving average filter with 8 tap is enabled.4: post-RS moving average filter with 12 tap is enabled.5: post-RS moving average filter with 16 tap is enabled.6-7: Reserved.</description>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CFRMAGNITUDETHRESHOLD</name>
                <description>Clipping threshold for CFR module with CORDIC gain compensated i.e A/gain_codic</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRSETTINGS</name>
            <description>TXSCP PWR SETTINGS</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXPOWERGAINANGLELUTINDEX</name>
                <description>TX power index of Gain Angle LUT of TXSCP. This index is used to pick power dependent gain/angle coefficients fromthe Gain Angle LUT.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>TXPOWERDPDLUTINDEX</name>
                <description>TX power index of DPD LUT of TXSCP. This index is used to pick power dependent DPD coefficients from the DPD LUT.</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TXSCPDIRECTINPUT</name>
                <description>Selects whether TXSCP input comes from previous pipeline stage or EDC (tbus).</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSCPBITPACKINGMODE</name>
                <description>In packing mode, Converts 12-bit real and img phase inputs (at in[15:4]) to a 24-bit output with real in out[23:12] and img in out[11:0]</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StandardMode</name>
                    <description>Standard mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PackingMode</name>
                    <description>Packing mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>1</dim>
            <dimIncrement>0x024</dimIncrement>
            <name>TXSCPRESAMPCOEFF[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_TXSCP_TXSCPRESAMPCOEFF</headerStructName>
            <access>read-write</access>
            <addressOffset>0x14</addressOffset>
            <register>
              <name>RESAMPCOEFF0</name>
              <description>Description cluster: TXSCP RESAMP COEFF0</description>
              <addressOffset>0x00</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR1OR31</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR0OR32</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF1</name>
              <description>Description cluster: TXSCP RESAMP COEFF1</description>
              <addressOffset>0x04</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR3OR29</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR2OR30</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF2</name>
              <description>Description cluster: TXSCP RESAMP COEFF2</description>
              <addressOffset>0x08</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR5OR27</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR4OR28</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF3</name>
              <description>Description cluster: TXSCP RESAMP COEFF3</description>
              <addressOffset>0x0C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR7OR25</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR6OR26</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF4</name>
              <description>Description cluster: TXSCP RESAMP COEFF4</description>
              <addressOffset>0x10</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR9OR23</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR8OR24</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF5</name>
              <description>Description cluster: TXSCP RESAMP COEFF5</description>
              <addressOffset>0x14</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR11OR21</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR10OR22</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF6</name>
              <description>Description cluster: TXSCP RESAMP COEFF6</description>
              <addressOffset>0x18</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR13OR19</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR12OR20</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF7</name>
              <description>Description cluster: TXSCP RESAMP COEFF7</description>
              <addressOffset>0x1C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR15OR17</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>OR14OR18</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RESAMPCOEFF8</name>
              <description>Description cluster: TXSCP RESAMP COEFF8</description>
              <addressOffset>0x20</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>OR16</name>
                  <description>Coefficient of resampler filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x014</dimIncrement>
            <name>TXSCPINTERPCOEFF[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_TXSCP_TXSCPINTERPCOEFF</headerStructName>
            <access>read-write</access>
            <addressOffset>0x38</addressOffset>
            <register>
              <name>INTERPCOEFF0</name>
              <description>Description cluster: TXSCP INTERP COEFF0</description>
              <addressOffset>0x00</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>B3</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>B1</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>INTERPCOEFF1</name>
              <description>Description cluster: TXSCP INTERP COEFF1</description>
              <addressOffset>0x04</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>B7</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>B5</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>INTERPCOEFF2</name>
              <description>Description cluster: TXSCP INTERP COEFF2</description>
              <addressOffset>0x08</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>B11</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>B9</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>INTERPCOEFF3</name>
              <description>Description cluster: TXSCP INTERP COEFF3</description>
              <addressOffset>0x0C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>B15</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>B13</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>INTERPCOEFF4</name>
              <description>Description cluster: TXSCP INTERP COEFF4</description>
              <addressOffset>0x10</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>B19</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>2</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>B17</name>
                  <description>Coefficient of interpolation filter in 2's complement format with range -1 to +1.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>14</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
