ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OUTPUTCTRL[%s]</name>
            <description>Description collection: TXSCP OUTPUT CTRL</description>
            <addressOffset>0x88</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGDACEN</name>
                <description>Enables the DAC port:Note For the DAC output port to operate correctly, DBG_DIGEN must be set to 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheDacOutputPortIsDi</name>
                    <description>The DAC output port is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheDacOutputPortIsEn</name>
                    <description>The DAC output port is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DEBUGDIGEN</name>
                <description>Enables the digital debug port:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheDigitalDebugOutpu</name>
                    <description>The digital debug output port is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheDigitalDebugOutpu1</name>
                    <description>The digital debug output port is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DEBUGDWELL</name>
                <description>Specifies the number of times that each output sample is repeated.If the output sequence is A, B, C, D, ... then the DAC/Debug sample sequence is :DWELL=0 :A, B, C, D, ...DWELL=1 :A, A, B, B, C, C, D, D,...' ' ' ''DWELL=7 :A, A,A,A, A,A,A,A, B, B, B, ,...</description>
                <lsb>2</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TXSCPFORMAT</name>
                <description>Specifies the output sample format as follows:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2SComplementSamples</name>
                    <description>2's complement samples.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OffsetBinarySamples</name>
                    <description>Offset binary samples.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSCPDESTINATION</name>
                <description>Selects the destination of the resampler output:</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DestinationIsTxscpTb</name>
                    <description>Destination is TXSCP TBus Rd port</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DestinationIsOnBoar</name>
                    <description>Destination is on-board DAC.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DestinationIsTxscpS</name>
                    <description>Destination is TXSCP_SAMPLE register.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSCPDACHOLDOFF</name>
                <description>Specifies the number of DAC clock cycles to hold-off the DAC output to allow the synchroniser to fill.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>TXSCPDEBUG</name>
                <description>Enable flow control debug registers TXSCP_SAMPLE_I_EXT and TXSCP_SAMPLE_Q_EXT</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSCPDACDELAY</name>
                <description>Specifies the number of DAC clock cycles to delay the DAC output after a reset.</description>
                <lsb>14</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>TXSCPSBWPARAM[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_TXSCP_TXSCPSBWPARAM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x8C</addressOffset>
            <register>
              <name>BASEVAL</name>
              <description>Description cluster: TXSCP BASE VAL</description>
              <addressOffset>0x00</addressOffset>
              <access>read-write</access>
              <resetValue>0x00800000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXSCPBASE</name>
                  <description>Peripheral resampling factor base. This is an unsigned value which is combined with the 2's complement TXSCP_CONTROL to generate the 26-bit control FsO:FsO = (TXSCP_BASE &amp;lt;&amp;lt; 23) + TXSCP_CONTROLFsO is the sample conversion ratio (I / O) used in the requirements section of the TX-SCP. FsO is an unsigned number, where the full-scale value represents a ratio of 1.999999.In normal operation, FsO is expected to take values in the range 0.0 to 1.9999. The larger number range provided here may be useful for system testing.Note: To convert a ratio into the 26-bit FsO, multiply by 2^25.Relevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>21</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>FACTORVAL</name>
              <description>Description cluster: TXSCP FACTOR VAL</description>
              <addressOffset>0x04</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXSCPCONTROL</name>
                  <description>Resampling factor control. This is a 2's complement value which is combined with TXSCP_BASE to generate the 28-bit control FsO:FsO = (TXSCP_BASE &amp;lt;&amp;lt; 23) + TXSCP_CONTROLRelevant when RESAMPLING_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>MIXERLOBASE</name>
              <description>Description cluster: TXSCP MIXER LO BASE</description>
              <addressOffset>0x08</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MIXLOBASE</name>
                  <description>Local Oscillator base. This is a 2's complement value which is combined with LO_CONTROL to generate the 26-bit control Fc:Fc = (LO_BASE &amp;lt;&amp;lt; 23) + LO_CONTROLFc is in 2's complement signed format where its value represents numbers within the range -1 to 0.9999999. To convert a ratio into the 26-bit Fc, multiply by 2^25.The digitally generated Local Oscillator (LO) frequency used in the mixer section is equal to Fc * (IF Clock Frequency/2).Hence the full-scale negative value represents a frequency of -(IF Clock Frequency/2).The input signal is frequency translated such that input frequency F moves to a frequency of F + Local Oscillator (LO) Frequency.Relevant when MIXER_DISABLE = 0.</description>
                  <lsb>21</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>MIXERLOCONTROL</name>
              <description>Description cluster: TXSCP MIXER LO CONTROL</description>
              <addressOffset>0x0C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MIXLOCONTROL</name>
                  <description>Local Oscillator control. This is a 2's complement value which is combined with LO_BASE to generate the 26-bit control Fc:Fc = (LO_BASE &amp;lt;&amp;lt; 23) + LO_CONTROLRelevant when MIXER_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>GAINANGLECOARSE</name>
            <description>TXSCP GAIN ANGLE COARSE</description>
            <addressOffset>0xCC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FCTOFSDACRATIO</name>
                <description>This field represents ratio of mixer-center-frequency to DAC-sampling frequency. It is in unsigned 8.12 format.</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>GACOARSEGAIN</name>
                <description>Selects coarse gain applied in the gain angle block:00: I and Q outputs are (multiplier result &amp;gt;&amp;gt; 8).01: I and Q outputs are (multiplier result &amp;gt;&amp;gt; 10).10: I and Q outputs are (multiplier result &amp;gt;&amp;gt; 6).11: Reserved.Relevant when GAIN_ANGLE_DISABLE = 0.</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>13</dim>
            <dimIncrement>0x00C</dimIncrement>
            <name>TXSCPGAINANGLE[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_TXSCP_TXSCPGAINANGLE</headerStructName>
            <access>read-write</access>
            <addressOffset>0xD0</addressOffset>
            <register>
              <name>GAINANGLEFINEI</name>
              <description>Description cluster: TXSCP GAIN ANGLE FINE I</description>
              <addressOffset>0x00</addressOffset>
              <access>read-write</access>
              <resetValue>0x00200000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>GAIGAIN</name>
                  <description>2's complement value that multiplies I value from mixer. This is a linear gain where 0x100 represents the 0dB point, thus the gain is I_GAIN/0x100.Relevant when GAIN_ANGLE_DISABLE = 0.</description>
                  <lsb>13</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>GAINANGLEFINEQ</name>
              <description>Description cluster: TXSCP GAIN ANGLE FINE Q</description>
              <addressOffset>0x04</addressOffset>
              <access>read-write</access>
              <resetValue>0x00200000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>GAQGAIN</name>
                  <description>2's complement value that multiplies Q value from mixer. This is a linear gain where 0x100 represents the 0dB point, thus the gain is Q_GAIN/0x100.Relevant when GAIN_ANGLE_DISABLE = 0.</description>
                  <lsb>13</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>GAINANGLEIQ</name>
              <description>Description cluster: TXSCP GAIN ANGLE IQ</description>
              <addressOffset>0x08</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>GAITOQGAIN</name>
                  <description>2's complement value that multiplies I value before addition to Q value in the gain angle block.Qout = Q + (I * I_TO_Q_GAIN &amp;gt;&amp;gt; 10)Relevant when GAIN_ANGLE_DISABLE = 0.</description>
                  <lsb>13</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>DCOFFSET</name>
            <description>TXSCP DC OFFSET</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCOFFSETINTQ</name>
                <description>This field represents the 12 integer bits (23:12) of DC offset cancellation value for the Q channel. The DC offset for the Q channel is a 2's complement value with12 integer bits (23:12) and 12 fractional bits (11:0).Relevant when DC_OFFSET_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DCOFFSETINTI</name>
                <description>This field represents the 12 integer bits (23:12) of DC offset cancellation value for the I channel. The DC offset for the I channel is a 2's complement value with12 integer bits (23:12) and 12 fractional bits (11:0).Relevant when DC_OFFSET_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>13</dim>
            <dimIncrement>0x028</dimIncrement>
            <name>TXSCPDPDCOEFF[%s]</name>
            <description>Unspecified</description>
            <headerStructName>WIFIPHY_TXSCP_TXSCPDPDCOEFF</headerStructName>
            <access>read-write</access>
            <addressOffset>0x170</addressOffset>
            <register>
              <name>DPDCOEFF10</name>
              <description>Description cluster: TXSCP DPD COEFF10</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA10</name>
                  <description>DPD Coefficient A10. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF20</name>
              <description>Description cluster: TXSCP DPD COEFF20</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA20</name>
                  <description>DPD Coefficient A20. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF30</name>
              <description>Description cluster: TXSCP DPD COEFF30</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA30</name>
                  <description>DPD Coefficient A30. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF11</name>
              <description>Description cluster: TXSCP DPD COEFF11</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA11</name>
                  <description>DPD Coefficient A11. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF21</name>
              <description>Description cluster: TXSCP DPD COEFF21</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA21</name>
                  <description>DPD Coefficient A21. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF31</name>
              <description>Description cluster: TXSCP DPD COEFF31</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA31</name>
                  <description>DPD Coefficient A31. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF12</name>
              <description>Description cluster: TXSCP DPD COEFF12</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA12</name>
                  <description>DPD Coefficient A12. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF22</name>
              <description>Description cluster: TXSCP DPD COEFF22</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA22</name>
                  <description>DPD Coefficient A22. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDCOEFF32</name>
              <description>Description cluster: TXSCP DPD COEFF32</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPDCOEFFA32</name>
                  <description>DPD Coefficient A32. Relevant when DPD_DISABLE = 0.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DPDSHIFT</name>
              <description>Description cluster: TXSCP DPD SHIFT</description>
              <addressOffset>0x024</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>KSHIFT1</name>
                  <description>Variable Shifting at the output of the mixed multiplier, K=2</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>KSHIFT2</name>
                  <description>Variable Shifting at the output of the mixed multiplier, K=3</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>QSHIFT0</name>
                  <description>Variable Shifting at the output of the complex multiplier, Q=0</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>QSHIFT1</name>
                  <description>Variable Shifting at the output of the complex multiplier, Q=1</description>
                  <lsb>10</lsb>
                  <msb>12</msb>
                </field>
                <field>
                  <name>QSHIFT2</name>
                  <description>Variable Shifting at the output of the complex multiplier, Q=2</description>
                  <lsb>13</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
