ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>IQIMBINPHASEDLY</name>
            <description>TXSCP IQ IMB INPHASE DLY</description>
            <addressOffset>0x378</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000007</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQINPHASEDELAY</name>
                <description>Delay line for Inphase stream. This is a unsigned value.The maximum supported value is 14.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF1</name>
            <description>TXSCP IQ IMB COEFF1</description>
            <addressOffset>0x37C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB0</name>
                <description>Filter Coefficient B0 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB1</name>
                <description>Filter Coefficient B1 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF2</name>
            <description>TXSCP IQ IMB COEFF2</description>
            <addressOffset>0x380</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB2</name>
                <description>Filter Coefficient B2 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB3</name>
                <description>Filter Coefficient B3 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF3</name>
            <description>TXSCP IQ IMB COEFF3</description>
            <addressOffset>0x384</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB4</name>
                <description>Filter Coefficient B4 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB5</name>
                <description>Filter Coefficient B5 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF4</name>
            <description>TXSCP IQ IMB COEFF4</description>
            <addressOffset>0x388</addressOffset>
            <access>read-write</access>
            <resetValue>0x00400000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB6</name>
                <description>Filter Coefficient B6 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB7</name>
                <description>Filter Coefficient B7 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF5</name>
            <description>TXSCP IQ IMB COEFF5</description>
            <addressOffset>0x38C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB8</name>
                <description>Filter Coefficient B8 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB9</name>
                <description>Filter Coefficient B9 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF6</name>
            <description>TXSCP IQ IMB COEFF6</description>
            <addressOffset>0x390</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB10</name>
                <description>Filter Coefficient B10 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB11</name>
                <description>Filter Coefficient B11 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF7</name>
            <description>TXSCP IQ IMB COEFF7</description>
            <addressOffset>0x394</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB12</name>
                <description>Filter Coefficient B12 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IQFILTERB13</name>
                <description>Filter Coefficient B13 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQIMBCOEFF8</name>
            <description>TXSCP IQ IMB COEFF8</description>
            <addressOffset>0x398</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQFILTERB14</name>
                <description>Filter Coefficient B14 for Quadrature phase stream. This is a Q10 format (i.e. output of filter is right-shifted by 10 bits) 2's complement value.Relevant when IQ_IMBALANCE_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DACUNDERFLOWFLAG</name>
            <description>TXSCP DAC UNDERFLOW FLAG</description>
            <addressOffset>0x39C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DACUNDERFLOWFLAG</name>
                <description>This register is set to '1' if no valid data present on the DAC output, once data has started to flow out through it. To reset this flag write any value to the register.Note that the behaviour of this register is different from the similarly-named DAC_UNDERFLOW event flag available in TXSCP_EVENT_FLAG_STATUS.Setting DAC_UNDERFLOW_CLEAR will also clear this register.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MIXERDEBUGFCACCUM</name>
            <description>TXSCP MIXER DEBUG FCACCUM</description>
            <addressOffset>0x3A0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIXDEBUGFCACCUM</name>
                <description>This is a read only register and provides the fcaccum value from the mixer for debug purposes.Relevant when MIXER_DISABLE = 0.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLE</name>
            <description>TXSCP SAMPLE</description>
            <addressOffset>0x3A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLEQ</name>
                <description>Quadrature output sample. Valid when SAMPLE_VALID = 1. Write any value to this register to acknowledge sample has been read, this will not overwrite the resampler output.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SAMPLEI</name>
                <description>In phase output sample. Valid when SAMPLE_VALID = 1. Write any value to this register to acknowledge sample has been read, this will not overwrite the resampler output.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLEVALID</name>
            <description>TXSCP SAMPLE VALID</description>
            <addressOffset>0x3A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLEVALID</name>
                <description>Output sample valid. Software must poll for SAMPLE_VALID = 1 before reading SAMPLE_I or SAMPLE_Q.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTFLAGENABLE</name>
            <description>TXSCP EVENT FLAG ENABLE</description>
            <addressOffset>0x3AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXENDENABLE</name>
                <description>TX End Event Flag Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DACUNDERFLOWENABLE</name>
                <description>DAC Underflow Event Flag Enable</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTFLAGSTATUS</name>
            <description>TXSCP EVENT FLAG STATUS</description>
            <addressOffset>0x3B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXENDSTATUS</name>
                <description>This flag is set to '1' after the last sample of the transmit packet has been written to the DAC output.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DACUNDERFLOWSTATUS</name>
                <description>This flag is set to '1' if no valid data present on the DAC output, once data has started to flow out through it. This will ONLY be set if the DAC underflow occurs before the TX_END event flag is set.Note that the behaviour of this flag is different from the TXSCP_DAC_UNDERFLOW_FLAG register, which has no dependence on TX_END.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTFLAGCLEAR</name>
            <description>TXSCP EVENT FLAG CLEAR</description>
            <addressOffset>0x3B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXENDCLEAR</name>
                <description>TX End Event Flag Clear</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DACUNDERFLOWCLEAR</name>
                <description>DAC Underflow Event Flag Clear</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLEIEXT</name>
            <description>TXSCP SAMPLE I EXT</description>
            <addressOffset>0x3B8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLEIEXT</name>
                <description>When TXSCP_DEBUG=0: In phase output sample. Valid when SAMPLE_VALID = 1. To acknowledge sample has been read, write any value to TXSCP_SAMPLE register.When TXSCP_DEBUG=1: Live state of the valid flow control signals0: TX-SCP WR1: Pre-Interpolalation CFR Input2: Pre-Interpolalation CFR Output3: Interpolalation Filter Output4: Post-Interpolalation CFR Output5: Resampler CFR Output6: Mixer Output7: DPD Output8: Gain Angle Output9: IQ Imbalance Output10: Phase Compensation Filter Output11: DC Offset Output12: Synchroniser Input13: Synchroniser Output Pre-Holdoff14: Synchroniser Output Post-Holdoff15: Pre-interpolation IQ Imbalance</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLEQEXT</name>
            <description>TXSCP SAMPLE Q EXT</description>
            <addressOffset>0x3BC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLEQEXT</name>
                <description>When TXSCP_DEBUG=0: Quadrature output sample. Valid when SAMPLE_VALID = 1. To acknowledge sample has been read, write any value to TXSCP_SAMPLE register.When TXSCP_DEBUG=1: Live state of the enable flow control signals0: TX-SCP WR1: Pre-Interpolalation CFR Input2: Pre-Interpolalation CFR Output3: Interpolalation Filter Output4: Post-Interpolalation CFR Output5: Resampler CFR Output6: Mixer Output7: DPD Output8: Gain Angle Output9: IQ Imbalance Output10: Phase Compensation Filter Output11: DC Offset Output12: Synchroniser Input13: Synchroniser Output Pre-Holdoff14: Synchroniser Output Post-Holdoff15: Pre-interpolation IQ Imbalance</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PACKETSETTINGS2[%s]</name>
            <description>Description collection: TXSCP PACKET SETTINGS2</description>
            <addressOffset>0x3C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PREINTERPCFRMAGTHRESHOLD</name>
                <description>Threshold for CFR block prior to interpolation filter.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF1</name>
            <description>TXSCP PCF COEFF1</description>
            <addressOffset>0x3C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF0</name>
                <description>Filter Coefficient 0 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF1</name>
                <description>Filter Coefficient 1 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF2</name>
            <description>TXSCP PCF COEFF2</description>
            <addressOffset>0x3C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF2</name>
                <description>Filter Coefficient 2 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF3</name>
                <description>Filter Coefficient 3 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF3</name>
            <description>TXSCP PCF COEFF3</description>
            <addressOffset>0x3CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF4</name>
                <description>Filter Coefficient 4 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF5</name>
                <description>Filter Coefficient 5 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF4</name>
            <description>TXSCP PCF COEFF4</description>
            <addressOffset>0x3D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF6</name>
                <description>Filter Coefficient 6 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF7</name>
                <description>Filter Coefficient 7 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF5</name>
            <description>TXSCP PCF COEFF5</description>
            <addressOffset>0x3D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF8</name>
                <description>Filter Coefficient 8 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF9</name>
                <description>Filter Coefficient 9 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF6</name>
            <description>TXSCP PCF COEFF6</description>
            <addressOffset>0x3D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF10</name>
                <description>Filter Coefficient 10 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF11</name>
                <description>Filter Coefficient 11 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
