ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>PCFCOEFF7</name>
            <description>TXSCP PCF COEFF7</description>
            <addressOffset>0x3DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF12</name>
                <description>Filter Coefficient 12 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF13</name>
                <description>Filter Coefficient 13 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF8</name>
            <description>TXSCP PCF COEFF8</description>
            <addressOffset>0x3E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF14</name>
                <description>Filter Coefficient 14 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF15</name>
                <description>Filter Coefficient 15 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF9</name>
            <description>TXSCP PCF COEFF9</description>
            <addressOffset>0x3E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF16</name>
                <description>Filter Coefficient 16 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF17</name>
                <description>Filter Coefficient 17 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF10</name>
            <description>TXSCP PCF COEFF10</description>
            <addressOffset>0x3E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF18</name>
                <description>Filter Coefficient 18 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF19</name>
                <description>Filter Coefficient 19 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF11</name>
            <description>TXSCP PCF COEFF11</description>
            <addressOffset>0x3EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF20</name>
                <description>Filter Coefficient 20 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF21</name>
                <description>Filter Coefficient 21 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF12</name>
            <description>TXSCP PCF COEFF12</description>
            <addressOffset>0x3F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF22</name>
                <description>Filter Coefficient 22 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF23</name>
                <description>Filter Coefficient 23 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF13</name>
            <description>TXSCP PCF COEFF13</description>
            <addressOffset>0x3F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF24</name>
                <description>Filter Coefficient 24 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PCFCOEFF25</name>
                <description>Filter Coefficient 25 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFCOEFF14</name>
            <description>TXSCP PCF COEFF14</description>
            <addressOffset>0x3F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFCOEFF26</name>
                <description>Filter Coefficient 26 for PCF. This is a 12-bit 2s complement value. Relevant when PCF_ENABLE = 1.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCFSHIFT</name>
            <description>TXSCP PCF SHIFT</description>
            <addressOffset>0x3FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCFSHIFT</name>
                <description>Variable Shifting at the output of the PCF.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_BIT_DEINT</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_BIT_DEINT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x12000</addressOffset>
          <register>
            <name>CONFIG00</name>
            <description>WLAN BIT DEINT CONFIG 00</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGMODULATION</name>
                <description>Specify the modulation of the LLR data being processed by the Wireless LAN Bit Deinterleaver.Valid values are below.Other values are reserved and should not be used.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BpskConstellationSi</name>
                    <description>BPSK (Constellation size M = 2) (Nbpsc = 1, 1 LLRper data word)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QpskConstellationSi</name>
                    <description>QPSK (Constellation size M = 4) (Nbpsc = 2, 1 LLRper data word)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16QamConstellation</name>
                    <description>16-QAM (Constellation size M =16) (Nbpsc = 4, 2 LLRs per data word)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64QamConstellation</name>
                    <description>64-QAM (Constellation size M =64) (Nbpsc = 6, 3 LLRs per data word)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256QamConstellatio</name>
                    <description>256-QAM (Constellation size M = 256) (Nbpsc = 8, 4 LLRs per data word)</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG01</name>
            <description>WLAN BIT DEINT CONFIG 01</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGNROWS</name>
                <description>Specifies the number of active Rows the Bit Deinterleaver should use when processing LLR data.Note that each element in a row contains 4 sub-elements, where each sub-element holds one LLR.The number of LLRs stored in a Row element varies based on the modulation scheme in use.Valid values are below.Other values are reserved and should not be used.Legacy: 3 (BPSK) or6 (non-BPSK)HT/VHT 20 MHz:4 (BPSK) or8 (non-BPSK)HT/VHT 40 MHz:6 (BPSK) or 12 (non-BPSK)VHT80 MHz:9 (BPSK) or 18 (non-BPSK)</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG02</name>
            <description>WLAN BIT DEINT CONFIG 02</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGNCOLS</name>
                <description>Specifies the number of active Columns the Bit Deinterleaver should use when processing LLR data.Valid values are below.Other values are reserved and should not be used.Legacy: 16HT/VHT 20 MHz:13HT/VHT 40 MHz:18VHT80 MHz:26Note that the maximum number of columns is 18 when BUILD_WLAN_AC = 0.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG03</name>
            <description>WLAN BIT DEINT CONFIG 03</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGINIROWOFFSET</name>
                <description>Initial Row Offset.This is the row in which the first element of LLRs are written.Note that a Row is made up of elements, each of which holds four sub-elements capable of storing one LLR.Note 1. CONFIG_INI_ROW_OFFSET has the range 0 to CONFIG_N_ROWS-1Note 2. If the value in this register is non-zero then registers CONFIG_INI_WRITE_POINTER and CONFIG_INI_ROW_SWAP_TYPE should be configured appropriately.Note 3. The value in this register is derived from the Row Offset equation, see section 2.4.1 (Bit Deinterleaver Stage one (Frequency rotation)) for the RowOffset formula.Where Row Offset in this register is the value from the RowOffset equation divided by S.Note 4. S defines the number of LLRs stored in each element of the BDI buffer grid for the current modulation scheme.S is defined as: S=Max((log2(M)/2),1) or S=Max(Nbpsc/2),1)Where M (Constellation size) and Nbpsc are defined in the description for register CONFIG_MODULATION</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG04</name>
            <description>WLAN BIT DEINT CONFIG 04</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGINICOLOFFSET</name>
                <description>Initial Column index.This is the column in which the first LLR is written.Note that a column is made up of elements, each of which holds four sub-elements capable of storing one LLR.Note 1. CONFIG_INI_COL_OFFSET has the range 0 to CONFIG_N_COLS-1.Note 2. If the value in this register is non-zero then registers CONFIG_INI_WRITE_POINTER and CONFIG_INI_ROW_SWAP_TYPE should be configured appropriately.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG05</name>
            <description>WLAN BIT DEINT CONFIG 05</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGBUFFERSIZE</name>
                <description>This register specifies the number of buffer storage elements required for the Bit Deinterleaver operation.Note that an element consists of four sub-elements each capable of storing one LLR.It is defined as CONFIG_N_ROWS multiplied by CONFIG_N_COLS.The value in this register is ONLY valid when it is derived from valid values in CONFIG_N_ROWS and CONFIG_N_COLS.Other values are not valid and must not be used.When register CONFIG_USE_AS_BUFFER = 1 the usage of this register is relaxed - this is described further in the description of register CONFIG_USE_AS_BUFFER.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG06</name>
            <description>WLAN BIT DEINT CONFIG 06</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGINIWRITEPOINTER</name>
                <description>This register specifies the initial value of the write pointer for writing the first element of LLR data into the write buffer.The value in this register is calculated as follows:((CONFIG_INI_ROW_OFFSET * CONFIG_N_COLS) + CONFIG_INI_COL_OFFSET)Note 1. Check the descriptions of CONFIG_INI_ROW_OFFSET and CONFIG_INI_COL_OFFSET for further notes on the values in these registers.Note 2. Note that row swapping may be required by the data being written into the elements of the write buffer.This row swapping is performed by the logic in the Bit Deinterleaver and does not need to be accounted for in this register, since this register defines the first write element, and not the organisation of the LLR data within that element.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG07</name>
            <description>WLAN BIT DEINT CONFIG 07</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGINIROWSWAPTYPE</name>
                <description>This register is used to specify the row swapping type in use in the column CONFIG_INI_COL_OFFSET.It is only used when the modulation, set in register CONFIG_MODULATION, is set to a modulation scheme that requires row swapping - i.e. not BPSK (Nbpsc = 1) or QPSK (Nbpsc = 2).The value in this register is calculated as follows:For16-QAM (Nbpsc = 4): CONFIG_INI_COL_OFFSET percent2i.e. 0x0 when CONFIG_INI_COL_OFFSET is an even number0x1 when CONFIG_INI_COL_OFFSET is an odd numberFor64-QAM (Nbpsc = 6): CONFIG_INI_COL_OFFSET percent3i.e. 0x0 when CONFIG_INI_COL_OFFSET is 0,3,6, 9,12,etc0x1 when CONFIG_INI_COL_OFFSET is 1,4,7,10,13,etc0x2 when CONFIG_INI_COL_OFFSET is 2,5,8,11,14,etcFor 256-QAM (Nbpsc = 8): CONFIG_INI_COL_OFFSET percent4i.e. 0x0 when CONFIG_INI_COL_OFFSET is 0,4, 8,12,etc0x1 when CONFIG_INI_COL_OFFSET is 1,5, 9,13,etc0x2 when CONFIG_INI_COL_OFFSET is 2,6,10,14,etc0x3 when CONFIG_INI_COL_OFFSET is 3,7,11,15,etc</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG08</name>
            <description>WLAN BIT DEINT CONFIG 08</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGUSEASBUFFER</name>
                <description>This register is used to set the Deinterleaver into a buffer only mode.0x0: Operate as normal Bit Deinterleaver0x1: Operate as a Simple FIFO Buffer onlyWhen the Simple FIFO Buffer mode is selected the Bit Deinterleaver does not perform the usual Deinterleaving, but operates only as a FIFO buffer where both the write pointer and the read pointer use a linear incrementing address scheme.In this mode only the CONFIG_BUFFER_SIZE and CONFIG_MODULATION configuration registers are valid.The register CONFIG_BUFFER_SIZE should be set to the value of the required buffer size (columns multiplied by rows).The register CONFIG_MODULATION should be set with the modulation scheme of the current stream; this is used to determine the number of active LLRs in each LLR data word so that unused bytes can be masked to zero.Other configuration registers must not be used and should be set to zero.In the Simple FIFO Buffer mode the restrictions on the use of register CONFIG_BUFFER_SIZE are relaxed.Any value may be used in CONFIG_BUFFER_SIZE providing the value does NOT exceed the number of words available in the RAM instances (216 words for 802.11n and 472 words for 802.11ac).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSOUTPUTMODE</name>
            <description>WLAN BIT DEINT TBUS OUTPUT MODE</description>
            <addressOffset>0xA0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TBUSOUTPUTDISCARD</name>
                <description>Set this register to '1' to discard the output from the T-Bus Read component that routes LLR data out from the Bit Deinterleaver to the T-Bus Port.This register will only discard output when register field TBUS_OUTPUT_MODE = 1 (i.e. when routing output LLR data to the P-Bus debug registers).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSOUTPUTSIGNATURE</name>
            <description>WLAN BIT DEINT TBUS OUTPUT SIGNATURE</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TBUSOUTPUTSIGNATURE</name>
                <description>This register outputs a data signature from the T-Bus Output port driver.It is used for debug only.Reading from this register has no consequence.Writing to this Read Only register has no effect.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SWRESET</name>
            <description>WLAN BIT DEINT SW RESET</description>
            <addressOffset>0xF0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SWRESET</name>
                <description>Wireless LAN Bit Deinterleaver, Software Reset register SW_RESETThis register provides a means for resetting all the logic in the Wireless LAN Bit Deinterleaver block.The register is sticky so any reset has to be cleared manually.In other words, any reset applied with this register will NOT automatically clear; it must be manually cleared by writing '0' to this register.This software reset register will reset all logic in the Wireless LAN Bit Deinterleaver including:i. T-Bus Write port (LLR Input data)ii.T-Bus Read port (LLR Output data)iii. The Wireless LAN Bit Deinterleaver processing core (and all blocks within the core)iv.Top level Random StallersIt WILL NOT reset the wlan_bit_deint_regwrap Register Block Wrapper which includes the generated Register Bank.If the wlan_bit_deint_regwrap needs to be reset then the entire Wireless LAN Bit Deinterleaver must be reset using the software reset control in the UCCP_CORE registers.Alternatively a hardware reset can be performed.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ClearBlockResetDefa</name>
                    <description>Clear block reset (default state)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PlaceAndHoldWholeBlo</name>
                    <description>Place and hold whole block in Reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
