ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>COREIDREG</name>
            <description>WLAN BIT DEINT CORE ID REG</description>
            <addressOffset>0xF8</addressOffset>
            <access>read-only</access>
            <resetValue>0x000F0900</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANBITDEINTCORECONFIGURATION</name>
                <description>Configuration of the core.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANBITDEINTCOREID</name>
                <description>Identifies the member of the IP group. [0x09 = Wireless LAN Bit Deinterleaver (WLAN_BIT_DEINT)]</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANBITDEINTGROUPID</name>
                <description>Identifies core as part of an IMG IP family group.[0x0F = UCC].</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COREREVISIONREG</name>
            <description>WLAN BIT DEINT CORE REVISION REG</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANBITDEINTMAINTENANCEREV</name>
                <description>Maintenance Release Revision</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANBITDEINTMINORREV</name>
                <description>Core Minor Release Revision</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANBITDEINTMAJORREV</name>
                <description>Family Major Release Revision</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_DEPARSER</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_DEPARSER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x13000</addressOffset>
          <register>
            <name>CONFIG00</name>
            <description>WLAN DEPARSER CONFIG 00</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGNUMSTREAMS</name>
                <description>The number of Input Streams that are active to process OFDM symbols for the current data stream configuration.Unsigned value with possible range of 0-7.Valid values are below:Note: The valid values above will be restricted if the Wireless LAN Stream Deparser has fewer than four Stream Input ports available.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OneStreamInputActive</name>
                    <description>One Stream Input active. Deparser will read input LLRs from Stream Input0 only.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TwoStreamInputsActiv</name>
                    <description>Two Stream Inputs active.Deparser will read input LLRs from Stream Inputs 0 and 1.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ThreeStreamInputsAct</name>
                    <description>Three Stream Inputs active.Deparser will read input LLRs from Stream Inputs 0, 1 and 2.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FourStreamInputsActi</name>
                    <description>Four Stream Inputs active. Deparser will read input LLRs from Stream Inputs 0, 1, 2 and 3.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve5</name>
                    <description>This is reserved.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve6</name>
                    <description>This is reserved.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve7</name>
                    <description>This is reserved.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONFIGNUMLLRSYMBFULL</name>
                <description>Number of LLRs per OFDM symbol.</description>
                <lsb>4</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG01</name>
            <description>WLAN DEPARSER CONFIG 01</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGNUMDECODERS</name>
                <description>The number of Decoders that are needed to process OFDM symbols for the current data stream configuration.Unsigned value with possible range of 0-3.Valid values are below:Note: The valid values above will be restricted if the Wireless LAN Stream Deparser has fewer than two Decoder Output ports available.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OneDecoderOutputActi</name>
                    <description>One Decoder output active.Output OFDM symbols to Decoder 0 output only.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TwoDecoderOutputsAct</name>
                    <description>Two Decoder outputs active.Output OFDM symbols to Decoder 0 and Decoder 1 outputs.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve3</name>
                    <description>This is reserved.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONFIGNUMLLRSYMBSHORT</name>
                <description>Number of LLRs per OFDM symbol : last symbol or last pair for STBC.</description>
                <lsb>4</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG02</name>
            <description>WLAN DEPARSER CONFIG 02</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGNUMSUBCARRIERS</name>
                <description>The number of Sub Carriers that the Stream Deparser should process for each OFDM symbol of the current data stream configuration.Unsigned value with possible range of 0-511.The valid values for this register are the results of the formula below when derived using the valid values for each element of the formula.All other values are reserved and should not be used.The 32-bit inputs to the Stream Deparser carry up to 4 LLRs per clock, which varies according to the modulation scheme used by each Stream Input.When the Stream Deparser processes one sub-carrier (as defined by this register) it processes one 32-bit word of LLRs from the selected Stream Input.Thus this register defines the number of32-bit words that need to be processed on each Stream Input.This value is also used by the STBC Mux to detect OFDM symbol boundaries - which occur once the STBC mux has processed the number of 32-bit words defined by this register.The value written into this register is calculated using the following formula:(N_SC * Constellation factor) / N_ESWhere:N_SC is the number of Sub-Carriers in each OFDM symbol, i.e. 48, 52, 108 or 234N_ES is the number of Decoder outputs programmed in CONFIG_NUM_DECODERS, i.e. 1 or 2Constellation factor is 1 for BPSK modulation and 2 for non BPSK modulation schemesNote that if BPSK is selected on any Stream Input, other active Stream Inputs can only be set to BPSK modulation.Configuring the active Stream Inputs for a mix of BPSK and non-BPSK Modulation schemes is not valid.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG03</name>
            <description>WLAN DEPARSER CONFIG 03</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGNUMOFDMSYMBOLS</name>
                <description>Number of OFDM symbols to process.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG04</name>
            <description>WLAN DEPARSER CONFIG 04</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGSTREAM0CONSTELLATION</name>
                <description>This defines the Constellation in use on Stream 0 Input port for each Sub-Carrier.The value in this field represents the value Nbpsc/2 (with a minimum value of 1) for the Constellation type in use on this Stream Input.The valid values for this field are determined by the index below.All other values are reserved and should not be used.Note that if BPSK is selected on any Stream Input, other active Stream Inputs can only be set to BPSK modulation.Configuring the active Stream Inputs for a mix of BPSK and non-BPSK Modulation schemes is not valid.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bpsk1LlrPerSubCarr</name>
                    <description>BPSK = 1 LLRper Sub-Carrier</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Qpsk1LlrPerSubCarr</name>
                    <description>QPSK = 1 LLRper Sub-Carrier</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Qam2LlrsPerSubC</name>
                    <description>16-QAM = 2 LLRs per Sub-Carrier</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64Qam3LlrsPerSubC</name>
                    <description>64-QAM = 3 LLRs per Sub-Carrier</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256Qam4LlrsPerSub</name>
                    <description>256-QAM = 4 LLRs per Sub-Carrier</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONFIGSTREAM1CONSTELLATION</name>
                <description>This defines the Constellation in use on Stream 1 Input port for each Sub-Carrier.The programming convention for this field is the same as given for field CONFIG_STREAM_0_CONSTELLATION.</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>CONFIGSTREAM2CONSTELLATION</name>
                <description>This defines the Constellation in use on Stream 2 Input port for each Sub-Carrier.The programming convention for this field is the same as given for field CONFIG_STREAM_0_CONSTELLATION.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG05</name>
            <description>WLAN DEPARSER CONFIG 05</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGSTREAM3CONSTELLATION</name>
                <description>This defines the Constellation in use on Stream 3 Input port for each Sub-Carrier.The programming convention for this field is the same as given for field CONFIG_STREAM_0_CONSTELLATION.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG08</name>
            <description>WLAN DEPARSER CONFIG 08</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGSTBCMODE</name>
                <description>This register is used to set the Deparser into STBC mode.0x0: Operate Stream Deparser in normal mode (with NO STBC muxing)0x1: Operate Stream Deparser with STBC muxing enabledIn this mode the STBC muxing is enabled in the Wireless LAN Stream Deparser.The way this mode operates is detailed fully in the Wireless LAN Stream Deparser TRM.When STBC mode is selected the registers CONFIG_STBC_LLRS_PER_OFDM_SYMBOL_[0/1] must be programmed according to the descriptions in those registers.Note 1. STBC Mode is only valid for the configurations below:CONFIG_NUM_STREAMS (Nss) = 1: Input data expected on Stream Inputs 0 and 1 (STBC Mux routes data to Deparser processing core Input 0)CONFIG_NUM_STREAMS (Nss) = 2: Input data expected on Stream Inputs 0, 1, 2, and 3 (STBC Mux routes data to Deparser processing core Inputs 0 and 1)Other values in CONFIG_NUM_STREAMS are not valid with STBC mode.Note 2. STBC Mode is only available when input generic N_SS (NUM_WIFI_SS) &amp;gt;= 2 (to support STBC when Nss=1)or input generic N_SS (NUM_WIFI_SS) &amp;gt;= 4 (to support STBC when Nss=[1|2])</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CONFIGDCMDROPLASTSAMPLE</name>
                <description>Enable dropping last sample of each OFDM symbol when DCM is enabled, MCS is 0, BCC FEC type and 242 or 106 tone RU type is configured (53 to 64)</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>CONFIGDCMRUSIZEINDEX</name>
                <description>RU size used when CONFIG_DCM_DROP_LAST_SAMPLE is set.0x0: 106 tone0x1: 242 tone</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTPUTPACKERNUMLLRSLSBS</name>
            <description>WLAN DEPARSER OUTPUT PACKER NUM LLRS LSBS</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGOUTPUTPACKERNUMLLRSLSBS</name>
                <description>Number of LLRs in the packet (24 LSBs).Used by the output packer to flush LLRs at the end of the packet.When zero, no flushing will be performed.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTPUTPACKERNUMLLRSMSBS</name>
            <description>WLAN DEPARSER OUTPUT PACKER NUM LLRS MSBS</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIGOUTPUTPACKERNUMLLRSMSBS</name>
                <description>Number of LLRs in the packet (12 MSBs).Used by the output packer to flush LLRs at the end of the packet.When zero, no flushing will be performed.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSDATAPBUSDISCARD</name>
            <description>WLAN DEPARSER TBUS DATA PBUS DISCARD</description>
            <addressOffset>0xAC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TBUSDECODER0PBUSDISCARD</name>
                <description>Set this register to '1' to discard the output from the T-Bus Read component that routes data from the Decoder 0 Output to the T-Bus.This register will only discard output when register field TBUS_DECODER0_ROUTING = 1 (i.e. when routing to the P-Bus debug registers).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TBUSDECODER1PBUSDISCARD</name>
                <description>Set this register to '1' to discard the output from the T-Bus Read component that routes data from the Decoder 1 Output to the T-Bus.This register will only discard output when register field TBUS_DECODER1_ROUTING = 1 (i.e. when routing to the P-Bus debug registers).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SWRESET</name>
            <description>WLAN DEPARSER SW RESET</description>
            <addressOffset>0x1F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SWRESET</name>
                <description>Wireless LAN Stream Deparser, Software Reset register SW_RESETThis register provides a means for resetting all the logic in the Wireless LAN Stream Deparser block.The register is sticky so any reset has to be cleared manually.In other words, any reset applied with this register will NOT automatically clear; it must be manually cleared by writing '0' to this register.This software reset register will reset all logic in the Wireless LAN Stream Deparser including:i. T-Bus Write ports (input data to Stream Input Ports)ii.T-Bus Read ports (output data from Decoder Output Ports)iii. The Wireless LAN Stream Deparser processing coreiv.The STBC MultiplexerIt WILL NOT reset the wlan_deparser_regwrap Register Block Wrapper which contains the generated register bank.If the wlan_deparser_regwrap needs to be reset then the entire Wireless LAN Stream Deparser must be reset using the software reset control in the UCCP_CORE registers.Alternatively a hardware reset can be performed.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ClearBlockResetDefa</name>
                    <description>Clear block reset (default state)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PlaceAndHoldWholeBlo</name>
                    <description>Place and hold whole block in Reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COREIDREG</name>
            <description>WLAN DEPARSER CORE ID REG</description>
            <addressOffset>0x1F8</addressOffset>
            <access>read-only</access>
            <resetValue>0x000F0800</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANDEPARSERCORECONFIGURATION</name>
                <description>Configuration of the core.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANDEPARSERCOREID</name>
                <description>Identifies the member of the IP group. [0x08 = Wireless LAN Stream Deparser (WLAN_DEPARSER)]</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANDEPARSERGROUPID</name>
                <description>Identifies core as part of an IMG IP family group.[0x0F = UCC].</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COREREVISIONREG</name>
            <description>WLAN DEPARSER CORE REVISION REG</description>
            <addressOffset>0x1FC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANDEPARSERMAINTENANCEREV</name>
                <description>Maintenance Release Revision</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANDEPARSERMINORREV</name>
                <description>Core Minor Release Revision</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANDEPARSERMAJORREV</name>
                <description>Family Major Release Revision</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
