ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <cluster>
          <name>WLAN_RXP</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_RXP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x14000</addressOffset>
          <register>
            <name>RESET</name>
            <description>WLAN RXP RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXPLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRXPSTATSCOUNTERSRESET</name>
                <description>Self-clearing software reset for the statistics counters.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>WLAN RXP CONFIG</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00C00008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPCONFIGUSERMTAILBITS</name>
                <description>Configure the removal of tail bits at the output of the Viterbi</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NeverRemoveTailBits</name>
                    <description>Never remove tail bits</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RemoveTailBitsAtTheO</name>
                    <description>Remove tail bits at the output of Viterbi during DATA decoding (cfg_dec_field = 0).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGBITDEINTERLEAVER1</name>
                <description>Configure bit de-interleaver for first spatial stream.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BypassBitDeInterlea</name>
                    <description>Bypass bit de-interleaver</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseBitDeInterleaver</name>
                    <description>Use bit de-interleaver</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGBITDEINTERLEAVER2</name>
                <description>Configure bit de-interleaver for second spatial stream.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BypassBitDeInterlea</name>
                    <description>Bypass bit de-interleaver</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseBitDeInterleaver</name>
                    <description>Use bit de-interleaver</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGBITDEINTERLEAVER3</name>
                <description>Configure bit de-interleaver for third spatial stream.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BypassBitDeInterlea</name>
                    <description>Bypass bit de-interleaver</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseBitDeInterleaver</name>
                    <description>Use bit de-interleaver</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGBITDEINTERLEAVER4</name>
                <description>Configure bit de-interleaver for fourth spatial stream.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BypassBitDeInterlea</name>
                    <description>Bypass bit de-interleaver</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseBitDeInterleaver</name>
                    <description>Use bit de-interleaver</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGSTREAMDEPARSEROUTPUT</name>
                <description>Route first stream deparser output stream to either TBus port or LDPC block formation unit.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RouteOutputDataToTbu</name>
                    <description>Route output data to TBus port</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RouteOutputDataToLdp</name>
                    <description>Route output data to LDPC block formation unit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGRXP11B</name>
                <description>Select 802.11b RX demodulator.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OfdmDemodulator</name>
                    <description>OFDM demodulator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80211BDemodulator</name>
                    <description>802.11b demodulator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGMIMOCHANNELMATRIX</name>
                <description>Select MIMO decoder channel matrix TBus write port destination.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MimoDecoder</name>
                    <description>MIMO decoder</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LdpcDecoder</name>
                    <description>LDPC decoder</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGPHYOUTPUT</name>
                <description>Select PHY output.</description>
                <lsb>18</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ViterbiDecoder1Enco</name>
                    <description>Viterbi decoder (1 encoder stream, chain 1)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ViterbiDecoder1Enco1</name>
                    <description>Viterbi decoder (1 encoder stream, chain 2)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ViterbiDecoder2Enco</name>
                    <description>Viterbi decoder (2 encoder streams)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LdpcDecoder</name>
                    <description>LDPC decoder</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGDESCRAMBLERENABLED</name>
                <description>Enable descrambler.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BypassDescrambler</name>
                    <description>Bypass descrambler</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableDescrambler</name>
                    <description>Enable descrambler</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPDISABLEPHYRESET</name>
                <description>Disable automatic PHY reset.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PhyWillAutomatically</name>
                    <description>PHY will automatically reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PhyWillNotAutomatica</name>
                    <description>PHY will not automatically reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPRXVECTORENABLED</name>
                <description>Enable Rx-vector generation.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RxVectorNotGenerate</name>
                    <description>Rx-vector not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RxVectorIsSentBefor</name>
                    <description>Rx-vector is sent before the decoded data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCONFIGAUTOMATIC</name>
                <description>Enable automatic configuration of the RXP.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ManualConfigurationM</name>
                    <description>Manual configuration mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticConfigurati</name>
                    <description>Automatic configuration mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMCONFIG</name>
            <description>WLAN RXP OFDM CONFIG</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPCPEFIELD</name>
                <description>Selects packet type:0: LSIG (L)1: LDATA (L)2: HTSIG (L)3: HTDATA (HT)4: VHTSIGA (L)5: VHTSIGB (HT)6: VHTDATA (VHT)7: RLSIG (L)8: HESIGA_SU (HT)9: HESIGA_X (HT)10 : HESIGA_ER (HT)11 : HESIGA_MU (HT)12 : HESIGB (VHT)13 : HEDATA_SU (HE)14 : HEDATA_ER (HE)15 : HEDATA_MU (HE)Packet types 0-3 (Legacy, HT_MF, HT_GF, VHT) are in Pre-HE group with OFDM symbol length of 3.2us.HE packet has 12.8us OFDM symbol length.NOTE: Whenever field is configured the initial state of scrambler will be set accordingly.Scrambler is used within CPE block to generate PN sequence for pilot sign generation. PN sequencehas 127 elements and cyclically repeats after 127 OFDM symbols.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRXPGUARDDURATION</name>
                <description>Specifies the guard duration to be inserted or removed:</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>04Us</name>
                    <description>0.4us</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>08Us</name>
                    <description>0.8us</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Us</name>
                    <description>1.6us</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32Us</name>
                    <description>3.2us</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCPECFOEST</name>
                <description>When set enables the CFO estimation based on the CPE.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRXPCPESTBC</name>
                <description>Selects STBC mode. HT-packets only.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonStbc</name>
                    <description>non-STBC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Stbc</name>
                    <description>STBC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCPEBYPASS</name>
                <description>CPE compensation control.0 : CPE compensation1 : BypassThis field is used when REMOVE_SUB_CARRIERS is active (RX mode).In both cases pilots will be discarded but when bypass is not activeCPE compensation will be performed.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANRXPDLBBYPASS</name>
                <description>Delay buffer bypass</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DlbEnabled</name>
                    <description>DLB enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DlbBypassed</name>
                    <description>DLB bypassed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPSIGNALBANDWIDTH</name>
                <description>Selects the signal bandwidth0 : 20MHz1 : 40MHz2 : 80MHz3 : reservedMust be equal or less than CHANNEL_BANDWIDTH.For receive, see the OPERATING_WINDOW description.For transmit, when signal bandwidth is less than channel bandwidth, input OFDM symbol will be duplicatedbefore performing inverse FFT. If channel bandwidth is two times signal bandwidth then OFDM symbol will beduplicated and if channel bandwidth is four times signal bandwidth then OFDM symbol will be quadrupled.</description>
                <lsb>11</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WLANRXPCPERU</name>
                <description>HE resource unit allocation for CPE module</description>
                <lsb>13</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANRXPMCSVALUE</name>
                <description>Modulation and coding scheme</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPECONFIG</name>
            <description>WLAN RXP CPE CONFIG</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x000F1062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPCFOPPMCONVFACT</name>
                <description>Carrier Frequency Offset, to PPM conversion factor: value of OpBW/fc,where OpBw is the operating bandwidth and fc is the channel centre frequency. (u-4.20)Note: default value set for OpBW = 20MHz and fc = 5GHz</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRXPCPEESTNUMSYM</name>
                <description>Number of CPE estimations used for the CPE based frequency offset estimation.</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>WLANRXPCPEESTHEMUMODE</name>
                <description>CPE based frequency offset estimation mode for HE-MU packets:</description>
                <lsb>21</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UseHeSigBAndDataSy</name>
                    <description>Use HE-SIG-B and Data symbols CPE estimations (final HE-SIG-B in ppm is sum to the Data ppm estimations)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseHeSigBSymbolsCp</name>
                    <description>Use HE-SIG-B symbols CPE estimations only</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UseDataSymbolsCpeEst</name>
                    <description>Use Data symbols CPE estimations only (if there is only one data Symbol then the HE-SIG-B is used)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPCPECFOESTDIS</name>
                <description>Disable the CFO estimation based on the CPE : ignore RXP_CPE_CFO_EST field</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPESTATUS</name>
            <description>WLAN RXP CPE STATUS</description>
            <addressOffset>0x10</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPCPEFREQUENCYOFFSET</name>
                <description>CPE based frequency offset estimation (s-5.20).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CPECONFIG2</name>
            <description>WLAN RXP CPE CONFIG 2</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001062</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPSFOPPMCONVFACT</name>
                <description>Sampling Frequency Offset, time tracking conversion factor: value of [resampler factor] * OpBW/fc,where OpBw is the operating bandwidth and fc is the channel centre frequency. (u-4.20)Note: default value set for resampler factor = 1, OpBW = 20MHz and fc = 5GHz</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRXPCPERESAMPLERENA</name>
                <description>Enable CPE estimation based SFO error update to the SCP resampler.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
