ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>AUTOCONFIG</name>
            <description>WLAN RXP AUTO CONFIG</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPAUTOCONFIGDSSSOFDM</name>
                <description>DSSS or OFDM</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Dsss</name>
                    <description>DSSS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ofdm</name>
                    <description>OFDM</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGFRAMEFORMAT</name>
                <description>Frame format</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Legacy</name>
                    <description>Legacy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HtMf</name>
                    <description>HT-MF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HtGf</name>
                    <description>HT-GF</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeTb</name>
                    <description>HE-TB</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSu</name>
                    <description>HE-SU</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeMu</name>
                    <description>HE-MU</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeEr</name>
                    <description>HE-ER</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGSIGNALBANDWIDTH</name>
                <description>Signal bandwidth</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20 MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGDCM</name>
                <description>Dual carrier modulation</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DcmDisabled</name>
                    <description>DCM disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DcmEnabled</name>
                    <description>DCM enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGDECOFDM</name>
                <description>Decode OFDM data (output MUX selection)</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputDsss11BData</name>
                    <description>Output DSSS (11b) data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OutputOfdmData</name>
                    <description>Output OFDM data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGMCS</name>
                <description>MCSLegacy-0: BPSK rate 1/2Legacy-1: BPSK rate 3/4Legacy-2: QPSK rate 1/2Legacy-3: QPSK rate 3/4Legacy-4: 16-QAM rate 1/2Legacy-5: 16-QAM rate 3/4Legacy-6: 64-QAM rate 2/3Legacy-7: 64-QAM rate 3/4HT-0: BPSK rate 1/2HT-1: QPSK rate 1/2HT-2: QPSK rate 3/4HT-3: 16-QAM rate 1/2HT-4: 16-QAM rate 3/4HT-5: 64-QAM rate 2/3HT-6: 64-QAM rate 3/4HT-7: 64-QAM rate 5/6VHT-0: BPSK rate 1/2VHT-1: QPSK rate 1/2VHT-2: QPSK rate 3/4VHT-3: 16-QAM rate 1/2VHT-4: 16-QAM rate 3/4VHT-5: 64-QAM rate 2/3VHT-6: 64-QAM rate 3/4VHT-7: 64-QAM rate 5/6VHT-8: 256-QAM rate 3/4VHT-9: 256-QAM rate 5/6HE-0: BPSK rate 1/2HE-1: QPSK rate 1/2HE-2: QPSK rate 3/4HE-3: 16-QAM rate 1/2HE-4: 16-QAM rate 3/4HE-5: 64-QAM rate 2/3HE-6: 64-QAM rate 3/4HE-7: 64-QAM rate 5/6HE-8: 256-QAM rate 3/4HE-9: 256-QAM rate 5/6HE-10: 1024-QAM rate 3/4HE-11: 1024-QAM rate 5/6</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGFECTYPE</name>
                <description>FEC type</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bcc</name>
                    <description>BCC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ldpc</name>
                    <description>LDPC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGSTBC</name>
                <description>STBC mode</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StbcModeDisabled</name>
                    <description>STBC mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StbcModeEnabled</name>
                    <description>STBC mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGDESCRAMBLER</name>
                <description>Descrambler mode</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DescramblerDisabled</name>
                    <description>Descrambler disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DescramblerEnabled</name>
                    <description>Descrambler enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGCMLOADED</name>
                <description>Assume channel matrices are already loaded into the MIMO decoder</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTAssumeChannelMa</name>
                    <description>Don't assume channel matrices have been loaded</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AssumeChannelMatrice</name>
                    <description>Assume channel matrices have been loaded</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGDECFIELD</name>
                <description>Identifies the type of field to be decoded</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DataDecodedDataSent</name>
                    <description>Data - decoded data sent to EDC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeaderDecodedDataSe</name>
                    <description>Header - decoded data sent to receiver training mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGRU</name>
                <description>HE resource unit allocation</description>
                <lsb>17</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCONFIG1</name>
            <description>WLAN RXP AUTO CONFIG 1</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPAUTOCONFIGMIMOSYMBOLSINT</name>
                <description>Number of OFDM symbols for which the channel matrices are valid for the MIMO decoder. When this register is set to zero, the channel matrices will never be invalidated.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGHESIGAMODE</name>
                <description>Determines the state of HE-SIGA decoding, used in the LLR combining process</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HeSuDefaultStateA</name>
                    <description>HE-SU - Default state, assumes packet is HE-SU (or any non-HE packet), but may be determined as non HE-SU after decoding LSIG</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XIntermediateStateB</name>
                    <description>X - Intermediate state before determining packet is either HE-MU or HE-ER</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeMuPacketDetermin</name>
                    <description>HE-MU - Packet determined as HE-MU</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeErPacketDetermin</name>
                    <description>HE-ER - Packet determined as HE-ER</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGHEMUEXTRALDPC</name>
                <description>Force LDPC extra segment flag for decoder configuration for HE-MU packet decoding.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGHESIGBMODE</name>
                <description>Indicates if HE-SIG-B is being decoded and its format:</description>
                <lsb>13</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalVhtPacket</name>
                    <description>Normal VHT packet</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigBUncompressed</name>
                    <description>HE-SIG-B uncompressed 20/40 MHz ppduBW (18-bit common field, 52-bit User block field)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigBUncompressed2</name>
                    <description>HE-SIG-B uncompressed 80 MHz ppduBw (27-bit common field,52-bit User block field)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeSigBCompressedN</name>
                    <description>HE-SIG-B compressed (no common field, 52-bit User block field)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCONFIG2</name>
            <description>WLAN RXP AUTO CONFIG 2</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPAUTOCONFIGNUMCODEDBITS</name>
                <description>Number of coded bits.For BCC this is per encoded stream and includes service and tail bits.For LDPC this includes service bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCONFIG3</name>
            <description>WLAN RXP AUTO CONFIG 3</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPAUTOCONFIGNUMOFDMSYM</name>
                <description>Number of OFDM symbols.Only used in BCC mode.When non-zero, the RXP output packer flushes LLRs to the Viterbi decoder at the end of the last OFDM symbol.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DIRECTCTRL</name>
            <description>WLAN RXP DIRECT CTRL</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPDIRECTRXFDOUTPUT</name>
                <description>Selects whether TXP input comes from previous pipeline stage or EDC (tbus).</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPDIRECTSDVIT</name>
                <description>Selects direct or EDC (tbus) connections.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPDIRECTMIMOCM</name>
                <description>Selects direct or EDC (tbus) connections.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPDIRECTFFTDLB</name>
                <description>Selects direct or EDC (tbus) connections.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPDIRECTKMODMIMORV</name>
                <description>Selects direct or EDC (tbus) connections.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPDIRECTFFTRTMFD</name>
                <description>Selects direct or EDC (tbus) connections.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Tbus</name>
                    <description>TBus.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Direct.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXPAUTOCONFIGPHYONLY</name>
                <description>Defines auto-configuration for WLAN_RXP_DIRECT_RXFD_OUTPUT:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RxpOutputGoesToNextP</name>
                    <description>RXP output goes to next pipeline stage (i.e. MAC).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RxpOutputGoesToEdcT</name>
                    <description>RXP output goes to EDC (tbus)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCONFIG4</name>
            <description>WLAN RXP AUTO CONFIG 4</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPAUTOCONFIGHENCBPSLAST</name>
                <description>Number of coded bits per symbols in the last pair of OFDM symbols for HE and STBC.</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER0</name>
            <description>WLAN RXP STATS COUNTER 0</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPGENERATEDEOPCOUNT</name>
                <description>Number of decoded packets based on the EOP flag.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTPACKTBUSDATAPBUSDISCARD</name>
            <description>WLAN RXP OUTPACK TBUS DATA PBUS DISCARD</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXPOUTPACKTBUSSTREAM0PBUSDISCARD</name>
                <description>Set this register to '1' to discard the output from the T-Bus Read component that routes data from the stream 0 path to the T-Bus.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXPOUTPACKTBUSSTREAM1PBUSDISCARD</name>
                <description>Set this register to '1' to discard the output from the T-Bus Read component that routes data from the stream 1 path to the T-Bus.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CPECHSTREAM1PILOT[%s]</name>
            <description>Description collection: WLAN RXP CPE CH STREAM1 PILOT</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCPECHSTREAM1PILOT</name>
                <description>Channel estimate for stream 1 on the pilot subcarrier.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
