ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CPECHSTREAM2PILOT[%s]</name>
            <description>Description collection: WLAN RXP CPE CH STREAM2 PILOT</description>
            <addressOffset>0x90</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANCPECHSTREAM2PILOT</name>
                <description>Channel estimate for stream 2 on the pilot subcarrier.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANRXFDDEBUG</name>
            <description>WLAN RXFD DEBUG</description>
            <addressOffset>0xB4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXFDDEBUG</name>
                <description>Enable debug registers WLAN_RXFD_DEBUG_VALID and WLAN_RXFD_DEBUG_ENABLE</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANRXFDDEBUGVALID</name>
            <description>WLAN RXFD DEBUG VALID</description>
            <addressOffset>0xB8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXFDDEBUGVALID</name>
                <description>Live state of the valid flow control signals0: DBL Input1: DLB Output2: CPE/KMOD Input3: CPE/KMOD Output4: MIMO RV Input5: MIMO CM Input6: MIMO Output7: DCM Input8: DCM Output9: BDI Input10: BDI Output11: LLR Combining BDI Input12: LLR Combining DCM Input13: LLR Combining Output14: Deparser Input15: Deparser Output16: OutputPacker Input17: OutputPacker Output18: Viterbi Input19: Viterbi Output20: LDPC Input21: LDPC Output22: Descramler Input23: Descrambler Output24: Error Mask Input25: Error Mask Output26: RTM FD FFT Raw Input27: RTM FD Dec Input28: RTM FD RXV Output29: RTM FD BMF Output30: RTM FD RTM CM Output31: RTM FD CHE Output</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANRXFDDEBUGENABLE</name>
            <description>WLAN RXFD DEBUG ENABLE</description>
            <addressOffset>0xBC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXFDDEBUGENABLE</name>
                <description>Live state of the enable flow control signals0: DBL Input1: DLB Output2: CPE/KMOD Input3: CPE/KMOD Output4: MIMO RV Input5: MIMO CM Input6: MIMO Output7: DCM Input8: DCM Output9: BDI Input10: BDI Output11: LLR Combining BDI Input12: LLR Combining DCM Input13: LLR Combining Output14: Deparser Input15: Deparser Output16: OutputPacker Input17: OutputPacker Output18: Viterbi Input19: Viterbi Output20: LDPC Input21: LDPC Output22: Descramler Input23: Descrambler Output24: Error Mask Input25: Error Mask Output26: RTM FD FFT Raw Input27: RTM FD Dec Input28: RTM FD RXV Output29: RTM FD BMF Output30: RTM FD RTM CM Output31: RTM FD CHE Output</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_RXP_11B</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_RXP_11B</headerStructName>
          <access>read-write</access>
          <addressOffset>0x15000</addressOffset>
          <register>
            <name>RESET</name>
            <description>WLAN RXP 11B RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXP11BLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRXP11BSTATSCOUNTERSRESET</name>
                <description>Self-clearing software reset for the statistics counters.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DGCCONTROL</name>
            <description>WLAN RXP 11B DGC CONTROL</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x001541B1</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BDGCGAINCOMPENA</name>
                <description>Enable/disable gain compensation.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXP11BDGCTARGETPOWER</name>
                <description>Target power for the compensation factor calculation (s5.2).</description>
                <lsb>1</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANRXP11BCCACONTROLDIS</name>
                <description>Disable / enable CCA control for correlation indication and status known (ED).Timer non-zero flag always zero when disabled.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANRXP11BCORECLKFREQMHZ</name>
                <description>Core clock frequency in MHz. (u8.0)</description>
                <lsb>10</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANRXP11BDCOFFSETCOMPENA</name>
                <description>Enable/disable DC offset compensation.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANRXP11BSETTLESAMPLENGTH</name>
                <description>Number of samples for datapath settling before DC estimation starts:</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>22Samples</name>
                    <description>22 samples</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>44Samples</name>
                    <description>44 samples</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXP11BDCESTSAMPLENGTH</name>
                <description>Number of samples used for DC estimation:</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>44Samples</name>
                    <description>44 samples</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>88Samples</name>
                    <description>88 samples</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>132Samples</name>
                    <description>132 samples</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>176Samples</name>
                    <description>176 samples</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SFSCONTROL</name>
            <description>WLAN RXP 11B SFS CONTROL</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x0004D527</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BSFSSEARCHLENGTH</name>
                <description>Maximum number of symbols checked for the fine synchronisation. Valid range is 1 to 15.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRXP11BSFSHIGHTHRESHOLD</name>
                <description>Correlation high-threshold factor (u2.3).</description>
                <lsb>4</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANRXP11BSFSMIDTHRESHOLD</name>
                <description>Correlation mid-threshold factor (u2.3).</description>
                <lsb>9</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANRXP11BSFSMIDWINLENGTH</name>
                <description>Mid-threshold peak detection window length (u3.0). Valid range is 2 to 7.</description>
                <lsb>14</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANRXP11BSFSMIDRUNLENGTH</name>
                <description>Mid-threshold peak detection run length (u3.0). Valid range is 2 to WLAN_RXP_11B_SFS_MID_WIN_LENGTH.</description>
                <lsb>17</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOCONTROL</name>
            <description>WLAN RXP 11B CFO CONTROL</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001A16</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCFOCICOCORRLEN</name>
                <description>Initial coarse estimation correlation length (u4.0). Valid range is 1 to 15.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRXP11BCFOCICOCORRLAG</name>
                <description>Initial coarse estimation correlation lag (u4.0). Valid range is 1 to 4.</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRXP11BCFOFICOCORRLEN</name>
                <description>Initial fine estimation correlation length (u4.0). Valid range is 1 to 15.</description>
                <lsb>7</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRXP11BCFOFICOCORRLAG</name>
                <description>Initial fine estimation correlation lag (u4.0). Valid range is 1 to 4.</description>
                <lsb>11</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOSTATUS0</name>
            <description>WLAN RXP 11B CFO STATUS 0</description>
            <addressOffset>0x10</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCFOCICOOFFSET</name>
                <description>Coarse intial frequency-offset estimation (s-2.17).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOSTATUS1</name>
            <description>WLAN RXP 11B CFO STATUS 1</description>
            <addressOffset>0x14</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCFOFICOOFFSET</name>
                <description>Fine initial frequency-offset estimation (s-2.17).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TTRCONTROL</name>
            <description>WLAN RXP 11B TTR CONTROL</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000831</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BTTRPPMCONVFACT</name>
                <description>Time tracking conversion factor: value of [resampler factor] * fs/fc programmed by MAC (u-4.20).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRXP11BTTRLOOPDISABLE</name>
                <description>Disable/enable time tracking - resampler loop.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DSSCONTROL</name>
            <description>WLAN RXP 11B DSS CONTROL</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BDSSBACKUPSAMPLES</name>
                <description>Number of backup samples refered to the strongest path location (u5.0). Valid range is 1 to 21.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRXP11BDSSEQUALISEDELAY</name>
                <description>Number of delay symbols for the decision-feedback equaliser after start of the CMF (u4.0).</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CMFCONTROL</name>
            <description>WLAN RXP 11B CMF CONTROL</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000008E</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCMFCHANESTTAPS</name>
                <description>Number of channel estimated taps used in the channel matching filter (u5.0). Valid range is 1 to 22.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRXP11BCMFACCMAXSHIFT</name>
                <description>Defines the maximum shift in the channel estimation average (u3.0). Valid range is 1 to 5.</description>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DFECONTROL0</name>
            <description>WLAN RXP 11B DFE CONTROL 0</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000004E</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BDFEDOWNSAMPPHASE</name>
                <description>Feed-forward filter down-sampling phase, 0 or 1.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEADAPTIVEDELAY</name>
                <description>Phase reference chip delay for the equaliser training (u4.0). Valid range is 3 to 10 when WLAN_RXP_11B_DFE_DOWNSAMP_PHASE = 0, 3 to 9 otherwise.</description>
                <lsb>1</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEFBFDISABLE</name>
                <description>Disable/enable the feed-back filter.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEFBFINITDELAY</name>
                <description>Feed-back filter start delay after start of the equaliser (u4.0). Only applies when WLAN_RXP_11B_DFE_FBF_DISABLE is 0. Valid range is 1 to 15.</description>
                <lsb>6</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DFECONTROL1</name>
            <description>WLAN RXP 11B DFE CONTROL 1</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00CB8614</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BDFEGEARSHIFTSYM</name>
                <description>Number of symbols at which equaliser gear-shift happens (u8.0).</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEFFFSTEPSHF0</name>
                <description>LMS step size shift before gear-shift for the feed-forward filter (u4.0). Step = 1&amp;gt;&amp;gt;WLAN_RXP_11B_DFE_FFF_STEP_SHF_0.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEFFFSTEPSHF1</name>
                <description>LMS step size shift after gear-shift for the feed-forward filter (u4.0). Step = 1&amp;gt;&amp;gt;WLAN_RXP_11B_DFE_FFF_STEP_SHF_1.</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEFBFSTEPSHF0</name>
                <description>LMS step size shift before gear-shift for the feed-back filter (u4.0). Step = 1&amp;gt;&amp;gt;WLAN_RXP_11B_DFE_FBF_STEP_SHF_0.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>WLANRXP11BDFEFBFSTEPSHF1</name>
                <description>LMS step size shift after gear-shift for the feed-back filter (u4.0). Step = 1&amp;gt;&amp;gt;WLAN_RXP_11B_DFE_FBF_STEP_SHF_1.</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRCONTROL0</name>
            <description>WLAN RXP 11B CTR CONTROL 0</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000012D</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCTRTRKLOOPENA</name>
                <description>Enable/disable the carrier tracking loop.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKACQNSYM</name>
                <description>Number of symbols in the acquisition phase (u8.0). Valid range is 1 to 255.</description>
                <lsb>1</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRCONTROL1</name>
            <description>WLAN RXP 11B CTR CONTROL 1</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00005E68</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCTRTRKGAM1AMANT</name>
                <description>Gamma1-mantissa loop filter gain for the acquisition phase (u0.4).</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKGAM1AEXP</name>
                <description>Gamma1-exponent loop filter gain for the acquisition phase (u3.0).</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKGAM2AMANT</name>
                <description>Gamma2-mantissa loop filter gain for the acquisition phase (u0.4).</description>
                <lsb>7</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKGAM2AEXP</name>
                <description>Gamma2-exponent loop filter gain for the acquisition phase (u4.0).</description>
                <lsb>11</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRCONTROL2</name>
            <description>WLAN RXP 11B CTR CONTROL 2</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00005E68</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCTRTRKGAM1TMANT</name>
                <description>Gamma1-mantissa loop filter gain for the tracking phase (u0.4).</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKGAM1TEXP</name>
                <description>Gamma1-exponent loop filter gain for the tracking phase (u3.0).</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKGAM2TMANT</name>
                <description>Gamma2-mantissa loop filter gain for the tracking phase (u0.4).</description>
                <lsb>7</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANRXP11BCTRTRKGAM2TEXP</name>
                <description>Gamma2-exponent loop filter gain for the tracking phase (u4.0).</description>
                <lsb>11</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
