ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CTRSTATUS</name>
            <description>WLAN RXP 11B CTR STATUS</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCTRTRKFREQERR</name>
                <description>Carrier frequency tracking error (s0.17).</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVMSTATUS</name>
            <description>WLAN RXP 11B EVM STATUS</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BEVMPREAMBLEDB</name>
                <description>Preamble and header EVM measure in dB (s5.2).</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRXP11BEVMPAYLOADDB</name>
                <description>Payload EVM measure in dB (s5.2).</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PDCSTATUS</name>
            <description>WLAN RXP 11B PDC STATUS</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BPDCPREAMBLEMODE</name>
                <description>Preamble mode:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LongPreable</name>
                    <description>long preable,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ShortPreamble</name>
                    <description>short preamble</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXP11BPDCMODULATERATE</name>
                <description>Modulation rate:</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Mbps</name>
                    <description>1 Mbps,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Mbps</name>
                    <description>2 Mbps,</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>55Mbps</name>
                    <description>5.5 Mbps</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11Mbps</name>
                    <description>11 Mbps</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANRXP11BPDCPSDULENGTH</name>
                <description>PSDU length in octets (u12.0).</description>
                <lsb>3</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENSTATUS</name>
            <description>WLAN RXP 11B GEN STATUS</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BSFSFSYNCFAIL</name>
                <description>Indicates symbol synchronisation failure.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANRXP11BPDCSFDFAIL</name>
                <description>Indicates SFD detection failure.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANRXP11BPDCRATEFAIL</name>
                <description>Indicates header rate decoding failure.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WLANRXP11BPDCCRCFAIL</name>
                <description>Indicates PLCP header CRC check failure.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>WLANRXP11BSFSSYNCFOUND</name>
                <description>Indicates symbol synchronisation is found.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANRXP11BCFOICOESTDONE</name>
                <description>Indicates both coarse and fine carrier offset estimations are completed.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANRXP11BPDCSFDDONE</name>
                <description>Indicates SFD has been detected.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANRXP11BPDCPLCPDONE</name>
                <description>Indicates PLCP (preamble + header) has been processed and decoded.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANRXP11BPDCPSDUDONE</name>
                <description>Indicates PSDU (data) has been processed and decoded.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANRXP11BCCATIMERNONZERO</name>
                <description>CCA timer non-zero.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENCONTROL</name>
            <description>WLAN RXP 11B GEN CONTROL</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BGENERATEEOP</name>
                <description>Generate an EOP flag at the end of the packet:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTGenerateAnEopFl</name>
                    <description>Don't generate an EOP flag at the end of the packet</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GenerateAnEopFlagAtT</name>
                    <description>Generate an EOP flag at the end of the packet</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER0</name>
            <description>WLAN RXP 11B STATS COUNTER 0</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCORRELATIONPASSCOUNT</name>
                <description>Number of detected DSSS packets.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER1</name>
            <description>WLAN RXP 11B STATS COUNTER 1</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BFSYNCFAILCOUNT</name>
                <description>Number of DSSS packets failed to synchronise - SFS.Note: write zeros to 'software reset' this register.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER2</name>
            <description>WLAN RXP 11B STATS COUNTER 2</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BSFDFAILCOUNT</name>
                <description>Number of DSSS packets failed SFD detection.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATSCOUNTER3</name>
            <description>WLAN RXP 11B STATS COUNTER 3</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BHEADERFAILCOUNT</name>
                <description>Number of DSSS packets failed header checks - CRC or other conditions.Note: write zeros to 'software reset' this register.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>WLAN RXP 11B CONFIG</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXP11BCCKSUPPORT</name>
                <description>Indicates CCK modulation support in the RXP-11b pipeline:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DsssModulationOnly</name>
                    <description>DSSS modulation only,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CckDsssModulations</name>
                    <description>CCK + DSSS modulations</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_MIMO_DECODER</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_MIMO_DECODER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x16000</addressOffset>
          <register>
            <name>CAPABILITIES</name>
            <description>WLAN MIMO DECODER CAPABILITIES</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00006B00</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERMAXRX</name>
                <description>Maximum supported receive chains (N_RX).Note that the number of receive chains is returned '-1'.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANMIMODECODERMAXSS</name>
                <description>Maximum supported spatial streams (N_SS).Note that the number of spatial streams is returned '-1'.</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANMIMODECODERMAXSC</name>
                <description>Maximum supported sub-carriers per OFDM symbol (N_SC).Note that the number of sub-carriers is returned '-1'.</description>
                <lsb>8</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESET</name>
            <description>WLAN MIMO DECODER RESET</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANMIMODECODERLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCS</name>
            <description>WLAN MIMO DECODER MCS</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00006B00</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERNRX</name>
                <description>Number of receive chains (N_RX).Note that the number of receive chains is stored '-1'.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANMIMODECODERNSS</name>
                <description>Number of spatial streams (N_SS).Note that the number of spatial streams is stored '-1'.</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANMIMODECODERNSC</name>
                <description>Number of sub-carriers per OFDM symbol (N_SC).Note that the number of sub-carriers is stored '-1', therefore the default of 107 corresponds to N_SC=108.The MIMO decoder supports N_SC468 is reserved.A software reset must be performed before changing N_SC.</description>
                <lsb>8</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANMIMODECODERSTBCMODE</name>
                <description>Enable STBC mode (only applicable when N_RX=1).</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StbcModeDisabled</name>
                    <description>STBC mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StbcModeEnabled</name>
                    <description>STBC mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERCONJUGATE2</name>
                <description>Conjugate second spatial stream.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ConjugationDisabled</name>
                    <description>Conjugation disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ConjugationEnabled</name>
                    <description>Conjugation enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERCONJUGATE4</name>
                <description>Conjugate fourth spatial stream.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ConjugationDisabled</name>
                    <description>Conjugation disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ConjugationEnabled</name>
                    <description>Conjugation enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERLDPCTONEMAPPINGMODE</name>
                <description>Enable LDPC Tone Mapping mode.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LdpcToneMappingModeD</name>
                    <description>LDPC Tone Mapping mode disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LdpcToneMappingModeE</name>
                    <description>LDPC Tone Mapping mode enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERSTBCINPUTBUFFER</name>
                <description>Enable STBC input buffer.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>StbcInputBufferDisab</name>
                    <description>STBC input buffer disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StbcInputBufferEnabl</name>
                    <description>STBC input buffer enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
