ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CONSTELLATION</name>
            <description>WLAN MIMO DECODER CONSTELLATION</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERCONSTELLATION1</name>
                <description>Constellation type for first spatial stream.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bpsk</name>
                    <description>BPSK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Qpsk</name>
                    <description>QPSK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Qam</name>
                    <description>16-QAM</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64Qam</name>
                    <description>64-QAM</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256Qam</name>
                    <description>256-QAM</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve6</name>
                    <description>This is reserved.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve7</name>
                    <description>This is reserved.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERCONSTELLATION2</name>
                <description>Constellation type for second spatial stream.</description>
                <lsb>3</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bpsk</name>
                    <description>BPSK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Qpsk</name>
                    <description>QPSK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Qam</name>
                    <description>16-QAM</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64Qam</name>
                    <description>64-QAM</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256Qam</name>
                    <description>256-QAM</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve6</name>
                    <description>This is reserved.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve7</name>
                    <description>This is reserved.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERCONSTELLATION3</name>
                <description>Constellation type for third spatial stream.</description>
                <lsb>6</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bpsk</name>
                    <description>BPSK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Qpsk</name>
                    <description>QPSK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Qam</name>
                    <description>16-QAM</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64Qam</name>
                    <description>64-QAM</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256Qam</name>
                    <description>256-QAM</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve6</name>
                    <description>This is reserved.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve7</name>
                    <description>This is reserved.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERCONSTELLATION4</name>
                <description>Constellation type for fourth spatial stream.</description>
                <lsb>9</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bpsk</name>
                    <description>BPSK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Qpsk</name>
                    <description>QPSK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Qam</name>
                    <description>16-QAM</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64Qam</name>
                    <description>64-QAM</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256Qam</name>
                    <description>256-QAM</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve</name>
                    <description>This is reserved.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve6</name>
                    <description>This is reserved.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reserve7</name>
                    <description>This is reserved.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>WLAN MIMO DECODER CONFIG</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERLLRWIDTH</name>
                <description>Select LLR bit width.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>4BitFixedPointSuit</name>
                    <description>4-bit fixed point, suitable for Viterbi decoder input, where LLR = log(P(x=1)/P(x=0))</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6BitFixedPointSuit</name>
                    <description>6-bit fixed point, suitable for Viterbi decoder input, where LLR = log(P(x=1)/P(x=0))</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BitFixedPointSuit</name>
                    <description>8-bit fixed point, suitable for Viterbi decoder input, where LLR = log(P(x=1)/P(x=0))</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BitFixedPointSuit3</name>
                    <description>8-bit fixed point, suitable for LDPC decoder Q6.1 input, where LLR = log(P(x=0)/P(x=1))</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANMIMODECODERLLRFORMAT</name>
                <description>For fixed point LLRs, specify the number of LSBs to truncate from full precision 16-bit LLRs.For floating point mode, specify the number of fractional bits we assume the full precision 16-bit LLRs represent.</description>
                <lsb>2</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANMIMODECODERRMATRIXFORMAT1</name>
                <description>Specify the number of LSBs to drop from each R-matrix element for first spatial stream.Note that only settings of 0-4 are supported.5-7 are reserved.</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WLANMIMODECODERRMATRIXFORMAT2</name>
                <description>Specify the number of LSBs to drop from each R-matrix element for second spatial stream.Note that only settings of 0-4 are supported.5-7 are reserved.</description>
                <lsb>12</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>WLANMIMODECODERRMATRIXFORMAT3</name>
                <description>Specify the number of LSBs to drop from each R-matrix element for third spatial stream.Note that only settings of 0-4 are supported.5-7 are reserved.</description>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>WLANMIMODECODERRMATRIXFORMAT4</name>
                <description>Specify the number of LSBs to drop from each R-matrix element for fourth spatial stream.Note that only settings of 0-4 are supported.5-7 are reserved.</description>
                <lsb>20</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OFDMSYMBOLS</name>
            <description>WLAN MIMO DECODER OFDM SYMBOLS</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODEROFDMSYMBOLS</name>
                <description>Specify the number of OFDM symbols for which the channel matrices are valid.Once the specified number of OFDM symbols have been processed, the channel matrices are invalidated, and a new set of channel matrices will be used.Provided suitable hardware support is enabled, it is possible to pre-load the next set of channel matrices whilst processing receive vectors with the current set of channel matrices.Note that once the current set of channel matrices have been invalidated, no new receive vectors will be processed until the next set of channel matrices have been loaded (or pre-loaded).When this register is set to zero, the channel matrices will never be invalidated, and subsequent channel matrix loads will overwrite existing data in-place.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CMLOADED</name>
            <description>WLAN MIMO DECODER CM LOADED</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERCMLOADED</name>
                <description>Assume channel matrices are already loaded into the MIMO decoder</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTAssumeChannelMa</name>
                    <description>Don't assume channel matrices have been loaded</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AssumeChannelMatrice</name>
                    <description>Assume channel matrices have been loaded</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LDPCTONEMAPPINGDISTANCE</name>
            <description>WLAN MIMO DECODER LDPC TONE MAPPING DISTANCE</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERLDPCTONEMAPPINGDISTANCE</name>
                <description>LDPC tone mapping distance: defines the distance of seperation between data tones.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS1MODE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 1 MODE</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS1DISCARD</name>
                <description>Discard PBus debug mode output (WLAN_MIMO_DECODER_TBUS_RD_LLRS_1_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS1SIGNATURE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 1 SIGNATURE</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS1SIGNATURE</name>
                <description>TBus debug LLRs 1 output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS2MODE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 2 MODE</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS2DISCARD</name>
                <description>Discard PBus debug mode output (WLAN_MIMO_DECODER_TBUS_RD_LLRS_2_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS2SIGNATURE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 2 SIGNATURE</description>
            <addressOffset>0x90</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS2SIGNATURE</name>
                <description>TBus debug LLRs 2 output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS3MODE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 3 MODE</description>
            <addressOffset>0x94</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS3DISCARD</name>
                <description>Discard PBus debug mode output (WLAN_MIMO_DECODER_TBUS_RD_LLRS_3_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS3SIGNATURE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 3 SIGNATURE</description>
            <addressOffset>0xAC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS3SIGNATURE</name>
                <description>TBus debug LLRs 3 output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS4MODE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 4 MODE</description>
            <addressOffset>0xB0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS4DISCARD</name>
                <description>Discard PBus debug mode output (WLAN_MIMO_DECODER_TBUS_RD_LLRS_4_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDLLRS4SIGNATURE</name>
            <description>WLAN MIMO DECODER TBUS RD LLRS 4 SIGNATURE</description>
            <addressOffset>0xC8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANMIMODECODERTBUSRDLLRS4SIGNATURE</name>
                <description>TBus debug LLRs 4 output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
