ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
        <cluster>
          <name>WLAN_SVD</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_SVD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x17000</addressOffset>
          <register>
            <name>CAPABILITIES</name>
            <description>WLAN SVD CAPABILITIES</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDMATRIXMAXCOLS</name>
                <description>Maximum supported matrix columns</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Column</name>
                    <description>1 column</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Columns</name>
                    <description>2 columns</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Columns</name>
                    <description>3 columns</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Columns</name>
                    <description>4 columns</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDMATRIXMAXROWS</name>
                <description>Maximum supported matrix rows</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Row</name>
                    <description>1 row</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Rows</name>
                    <description>2 rows</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Rows</name>
                    <description>3 rows</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Rows</name>
                    <description>4 rows</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RESET</name>
            <description>WLAN SVD RESET</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANSVDLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MATRIXSIZE</name>
            <description>WLAN SVD MATRIX SIZE</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDMATRIXCOLS</name>
                <description>Select the number of matrix columns</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Column</name>
                    <description>1 column</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Columns</name>
                    <description>2 columns</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Columns</name>
                    <description>3 columns</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Columns</name>
                    <description>4 columns</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDINPUTCOLS</name>
                <description>Select the number of matrix columns to be loaded</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Column</name>
                    <description>1 column</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Columns</name>
                    <description>2 columns</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Columns</name>
                    <description>3 columns</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Columns</name>
                    <description>4 columns</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDMATRIXROWS</name>
                <description>Select the number of matrix rows</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Row</name>
                    <description>1 row</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Rows</name>
                    <description>2 rows</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Rows</name>
                    <description>3 rows</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Rows</name>
                    <description>4 rows</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDINPUTROWS</name>
                <description>Select the number of matrix rows to be loaded</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Row</name>
                    <description>1 row</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Rows</name>
                    <description>2 rows</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Rows</name>
                    <description>3 rows</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Rows</name>
                    <description>4 rows</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDVMATRIXCOLS</name>
                <description>When using compressed V-matrix representation, select the number of V-matrix columns</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1Column</name>
                    <description>1 column</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2Columns</name>
                    <description>2 columns</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Columns</name>
                    <description>3 columns</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Columns</name>
                    <description>4 columns</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDDECOMPRESSVMATRIX</name>
                <description>Use V-matrix decompression</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTDecompressVMat</name>
                    <description>Don't decompress V-matrix</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DecompressVMatrix</name>
                    <description>Decompress V-matrix</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BEAMFORM</name>
            <description>WLAN SVD BEAMFORM</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDSUBCARRIERS</name>
                <description>Number of sub-carriers used.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANSVDFEEDBACKTYPE</name>
                <description>Beamforming feedback type</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SuType</name>
                    <description>SU type</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MuType</name>
                    <description>MU type</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDDELTASNRS</name>
                <description>Output delta SNR for each sub-carrier</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTOutputDeltaSnrs</name>
                    <description>Don't output delta SNRs</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OutputDeltaSnrs</name>
                    <description>Output delta SNRs</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDRUSTARTINDEX</name>
                <description>RU start index for HE-MU0-36: RU start index</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>WLANSVDRUENDINDEX</name>
                <description>RU end index for HE-MU0-36: RU end index</description>
                <lsb>18</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DIAGTOLERANCE</name>
            <description>WLAN SVD DIAG TOLERANCE</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDTOL1</name>
                <description>Tolerance 1 for diagonalisation stage. Tolerance values are in format Q2.11, the field contains the 6 LSBs.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANSVDTOL2</name>
                <description>Tolerance 2 for diagonalisation stage. Tolerance values are in format Q2.11, the field contains the 6 LSBs.</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>WLANSVDTOL3</name>
                <description>Tolerance 3 for diagonalisation stage. Tolerance values are in format Q2.11, the field contains the 6 LSBs.</description>
                <lsb>12</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEAMFORM2</name>
            <description>WLAN SVD BEAMFORM 2</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDBEAMFORMSUBBLOCKSBYPASS</name>
                <description>Bypass all beamform sub-blocks (row-column swap, decoupling, cyclic delay removal) :</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BeamformSubBlocksLo</name>
                    <description>beamform sub-blocks logic active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BeamformSubBlocksLo1</name>
                    <description>beamform sub-blocks logic bypassed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDROWCOLUMNSWAPNUMCOLS</name>
                <description>Number of columns corresponds to the number of sub-carriers in each LTF:51: 52 sub-carriers for VHT63: 64 sub-carriers for HE</description>
                <lsb>1</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WLANSVDROWCOLUMNSWAPNUMROWS</name>
                <description>Number of rows corresponds to the number of NSTS for which input data is expected:</description>
                <lsb>7</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2Nsts</name>
                    <description>2 NSTS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3Nsts</name>
                    <description>3 NSTS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4Nsts</name>
                    <description>4 NSTS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDHELTFTYPE</name>
                <description>HE-LTF type:</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HeLtf4X</name>
                    <description>HE-LTF 4x</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HeLtf2X</name>
                    <description>HE-LTF 2x</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDPPDUBW</name>
                <description>PPDU bandwidth:</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20Mhz</name>
                    <description>20 MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>40Mhz</name>
                    <description>40 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80Mhz</name>
                    <description>80 MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DMALENGTH</name>
            <description>WLAN SVD DMA LENGTH</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDMALENGTH</name>
                <description>Packed angles length in bytes. This length depends on the feedback type (SU or MU),on the number of sub-carriers (52 for VHT and 64 for HE) and on the number of LTFs (2, 3 or 4).For example, the maximum length will be for the case with 4 LTFs, MU type and 64 sub-carriers(6 angles per sub-carrier with length of 9+7+9+7+9+7 = 48 bits -&amp;gt; 64*48/8 = 384 bytes). (.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SNR</name>
            <description>WLAN SVD SNR</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDSNR</name>
                <description>One SNR value derived from single sigma value (s[0]) of each sub-carrier.This value will be used by MAC controller to generate compressed beamforming report information.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANSVDSNRENABLE</name>
                <description>Enable SNR calculation: 0: disabled, 1: enabled.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMALENGTHEFSTATUS</name>
            <description>WLAN SVD DMA LENGTH EF STATUS</description>
            <addressOffset>0x20</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDMALENGTHEFSTATUS</name>
                <description>This flag is set to '1' after the config update from PHY is received and DMA_LENGTH for packed angles is calculated.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMALENGTHEFCLEAR</name>
            <description>WLAN SVD DMA LENGTH EF CLEAR</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDMALENGTHEFCLEAR</name>
                <description>WLAN_SVD DMA_LENGTH Event Flag Clear</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGGING</name>
            <description>WLAN SVD DEBUG</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDEBUGENABLE</name>
                <description>If set to 1, the module will use the debug fields.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANSVDDEBUGDMALENGTHUPDATE</name>
                <description>Debug register for dma_length_update input signal.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NOISEPOWER</name>
            <description>WLAN SVD NOISE POWER</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDNOISEPOWER</name>
                <description>Linear noise power, u-1.22. Write before PHY_CONFIG_UPDATE register</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
