ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>DEBUGMACCONFIGUPDATE</name>
            <description>WLAN SVD DEBUG MAC CONFIG UPDATE</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00080000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDEBUGMACCONFIGUPDATE</name>
                <description>Debug register for mac_config_update input signal:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PulseMacConfigUpda</name>
                    <description>Pulse mac_config_update input signal when WLAN_SVD_DEBUG_ENABLE=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDDEBUGMACSUMU</name>
                <description>Debug register for mac_su_mu input signal</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>WLANSVDDEBUGMACRUSTARTINDEX</name>
                <description>Debug register for mac_ru_start_index input signal</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>WLANSVDDEBUGMACRUENDINDEX</name>
                <description>Debug register for mac_ru_end_index input signal</description>
                <lsb>16</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGPHYCONFIGUPDATE</name>
            <description>WLAN SVD DEBUG PHY CONFIG UPDATE</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDEBUGPHYCONFIGUPDATE</name>
                <description>Debug register for phy_config_update input signal:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PulsePhyConfigUpda</name>
                    <description>Pulse phy_config_update input signal when WLAN_SVD_DEBUG_ENABLE=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLANSVDDEBUGPHYNUMNSTS</name>
                <description>Debug register for phy_num_nsts input signal</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>WLANSVDDEBUGPHYLTFFORMAT</name>
                <description>Debug register for phy_ltf_format input signal</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANSVDDEBUGPHYPPDUBW</name>
                <description>Debug register for phy_ppdu_bw input signal</description>
                <lsb>10</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCGGAINDB</name>
            <description>WLAN SVD DCG GAIN DB</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDDCGGAINDBFIRSTAGC</name>
                <description>Debug register for DCG gain dB before second AGC (s6.2). Write before PHY_CONFIG_UPDATE register.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>WLANSVDDCGGAINDBSECONDAGC</name>
                <description>Debug register for DCG gain dB after second AGC (s6.2). Write before PHY_CONFIG_UPDATE register.</description>
                <lsb>9</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AGCGAINDB</name>
            <description>WLAN SVD AGC GAIN DB</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDAGCGAINDBFIRSTAGC</name>
                <description>Debug register for AGC gain dB before second AGC (s7.0). Write before PHY_CONFIG_UPDATE register.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>WLANSVDAGCGAINDBSECONDAGC</name>
                <description>Debug register for AGC gain dB after second AGC (s7.0). Write before PHY_CONFIG_UPDATE register.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDMODE</name>
            <description>WLAN SVD TBUS RD MODE</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDTBUSRDDISCARD</name>
                <description>Discard PBus debug mode output (WLAN_SVD_TBUS_RD_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TBUSRDSIGNATURE</name>
            <description>WLAN SVD TBUS RD SIGNATURE</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDTBUSRDSIGNATURE</name>
                <description>TBus debug S-matrix &amp;amp; V-matrix output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BEAMFORMTBUSRDMODE</name>
            <description>WLAN SVD BEAMFORM TBUS RD MODE</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDBEAMFORMTBUSRDDISCARD</name>
                <description>Discard PBus debug mode output (WLAN_SVD_BEAMFORM_TBUS_RD_MODE=1):</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutputToPbusDebugMo</name>
                    <description>Output to PBus (debug mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DiscardOutput</name>
                    <description>Discard output.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BEAMFORMTBUSRDSIGNATURE</name>
            <description>WLAN SVD BEAMFORM TBUS RD SIGNATURE</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANSVDBEAMFORMTBUSRDSIGNATURE</name>
                <description>TBus debug Beamforming output data signature.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WLAN_LDPC_DECODER</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WLAN_LDPC_DECODER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x19000</addressOffset>
          <register>
            <name>RESET</name>
            <description>WLAN LDPC DECODER RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>WLANLDPCDECODERLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CODE</name>
            <description>WLAN LDPC DECODER CODE</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERCODE</name>
                <description>Select LDPC code:0: Codeword length 648 rate 1/21: Codeword length 648 rate 2/32: Codeword length 648 rate 3/43: Codeword length 648 rate 5/64: Codeword length 1296 rate 1/25: Codeword length 1296 rate 2/36: Codeword length 1296 rate 3/47: Codeword length 1296 rate 5/68: Codeword length 1944 rate 1/29: Codeword length 1944 rate 2/310: Codeword length 1944 rate 3/411: Codeword length 1944 rate 5/612-15: Reserved</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ITERATIONS</name>
            <description>WLAN LDPC DECODER ITERATIONS</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERITERATIONS</name>
                <description>Number of iterations the decoder performs for each codeword.Note that the valid is stored '-1'.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEWORDS</name>
            <description>WLAN LDPC DECODER CODEWORDS</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERCODEWORDS</name>
                <description>Number of codewords in each packet (N_CW).Note that the value is stored '-1'.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SHORTENEDBITS</name>
            <description>WLAN LDPC DECODER SHORTENED BITS</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERSHORTENEDBITS</name>
                <description>Number of shortened bits per codeword.Calculated as floor(N_shrt/N_CW).</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUNCTUREDBITS</name>
            <description>WLAN LDPC DECODER PUNCTURED BITS</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERPUNCTUREDBITS</name>
                <description>Number of punctured bits per codeword.Calculated as floor(N_punc/N_CW).</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPETITIONBITS</name>
            <description>WLAN LDPC DECODER REPETITION BITS</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERREPETITIONBITS</name>
                <description>Number of repetition bits per codeword.Calculated as floor(N_rep/N_CW).</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SHORTENEDREM</name>
            <description>WLAN LDPC DECODER SHORTENED REM</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERSHORTENEDREM</name>
                <description>Number of codewords with one additional shortened bit.Calculated as rem(N_shrt,N_CW).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUNCTUREDREM</name>
            <description>WLAN LDPC DECODER PUNCTURED REM</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERPUNCTUREDREM</name>
                <description>Number of codewords with one additional punctured bit.Calculated as rem(N_punc,N_CW).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPETITIONREM</name>
            <description>WLAN LDPC DECODER REPETITION REM</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERREPETITIONREM</name>
                <description>Number of codewords with one additional repetition bit.Calculated as rem(N_rep,N_CW).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GENERATEEOP</name>
            <description>WLAN LDPC DECODER GENERATE EOP</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERGENERATEEOP</name>
                <description>Generate an EOP flag at the end of the packet:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DonTGenerateAnEopFl</name>
                    <description>Don't generate an EOP flag at the end of the packet</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GenerateAnEopFlagAtT</name>
                    <description>Generate an EOP flag at the end of the packet</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>THRESHOLDDECODER</name>
            <description>WLAN LDPC DECODER THRESHOLD DECODER</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANLDPCDECODERTHRESHOLDDECODER</name>
                <description>Select between LDPC and threshold decoder:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LdpcDecoder</name>
                    <description>LDPC decoder</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ThresholdDecoder</name>
                    <description>Threshold decoder</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFICORERXTD</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WIFICORERXTD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1C000</addressOffset>
          <register>
            <name>RXTDMUXCTRL</name>
            <description>RXTD MUX CTRL</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTRLRTMTDBYPASS</name>
                <description>Bypass the RTMTD module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTRLDIRECTRXTDOUTPUT</name>
                <description>Enable direct output of RTMTD or RX11B module, otherwise enable TBus connection.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TbusConnection</name>
                    <description>Tbus Connection.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnection</name>
                    <description>Direct connection.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTRLDIRECTSCPRXTD</name>
                <description>Enable direct connection between SCP and RTMTD of RX11B, otherwise enable TBus connection.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TbusConnection</name>
                    <description>Tbus Connection.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnect</name>
                    <description>Direct connect.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTRLDIRECTSCPED</name>
                <description>Enable direct connection between SCP and ED in the Vega configuration with new ED, otherwise enable TBus connection.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TbusConnection</name>
                    <description>Tbus Connection.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnect</name>
                    <description>Direct connect.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTRLDIRECTEDRXTD</name>
                <description>Enable direct connection between ED and RTMTD in the Vega configuration with new ED, otherwise enable TBus connection.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TbusConnection</name>
                    <description>Tbus Connection.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DirectConnect</name>
                    <description>Direct connect.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
