ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>RXTDDEBUG</name>
            <description>RXTD DEBUG</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXTDDEBUG</name>
                <description>Enable debug registers RXTD_DEBUG_VALID and RXTD_DEBUG_ENABLE</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnable</name>
                    <description>Valid, Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StickyValidSticky</name>
                    <description>Sticky(Valid), Sticky(Enable)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ValidEnableSticky</name>
                    <description>Valid &amp;amp; Enable, Sticky(Valid &amp;amp; Enable)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXTDDEBUGVALID</name>
            <description>RXTD DEBUG VALID</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXTDDEBUGVALID</name>
                <description>Live state of the valid flow control signals0: SCP Input1: SCP Output2: RTM TD Input3: RTM TD Output4: RX 11B Input5: RX 11B Output6: RX TD OFDM Output7: RX TD DSSS Output</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXTDDEBUGENABLE</name>
            <description>RXTD DEBUG ENABLE</description>
            <addressOffset>0xC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXTDDEBUGENABLE</name>
                <description>Live state of the enable flow control signals0: SCP Input1: SCP Output2: RTM TD Input3: RTM TD Output4: RX 11B Input5: RX 11B Output6: RX TD OFDM Output7: RX TD DSSS Output</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXTDCTRL</name>
            <description>RXTD CTRL</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000005</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXTDCONFIGAUTOMATIC</name>
                <description>Enable automatic configuration of the RXTD.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ManualConfigurationM</name>
                    <description>Manual configuration mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticConfigurati</name>
                    <description>Automatic configuration mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXTDDISABLEPHYRESET</name>
                <description>Disable automatic PHY reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PhyWillAutomatically</name>
                    <description>PHY will automatically reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PhyWillNotAutomatica</name>
                    <description>PHY will not automatically reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXTDRXVECTORENABLED</name>
                <description>Enable Rx-vector generation.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RxVectorNotGenerate</name>
                    <description>Rx-vector not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RxVectorIsSentBefor</name>
                    <description>Rx-vector is sent before the decoded data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXTDCONFIGRX11B</name>
                <description>Select 802.11b RX demodulator.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OfdmDemodulator</name>
                    <description>OFDM demodulator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>80211BDemodulator</name>
                    <description>802.11b demodulator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXTDAUTOCONFIG</name>
            <description>RXTD AUTO CONFIG</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXTDAUTOCONFIGDSSSOFDM</name>
                <description>DSSS or OFDM</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Dsss</name>
                    <description>DSSS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ofdm</name>
                    <description>OFDM</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXTDAUTOCONFIGEDMIDPACKET</name>
                <description>Mid-packet energy detection flag:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DsssOrOfdmPacketDete</name>
                    <description>DSSS or OFDM packet detected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MidPacketDetected</name>
                    <description>MID packet detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXTDRESET</name>
            <description>RXTD RESET</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXTDPULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RXTDLATCHEDSOFTWARERESET</name>
                <description>Latched software reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFICOREIPCP_</name>
          <description>Unspecified</description>
          <headerStructName>WIFIPHY_WIFICOREIPCP_</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1D000</addressOffset>
          <register>
            <name>IPCPLMACTOUMACCMD0</name>
            <description>IPCP LMAC TO UMAC CMD 0</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACDATA0</name>
                <description>Message data to be passed from the LMAC_0 to the UMAC_0.A write to this register causes lmac_int_0 to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LMACINT0</name>
                <description>This Read Only bit is set to 1 when the lmac_int_0 event is asserted.Writing to LMAC_INT_CLR_0 in the umac_to_lmac_ack_0 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACCMD0</name>
            <description>IPCP UMAC TO LMAC CMD 0</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACDATA0</name>
                <description>Message data to be passed from the UMAC_0 to the LMAC_0.A write to this register causes the umac_int_0 interrupt to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>UMACINT0</name>
                <description>This Read Only bit is set to 1 when umac_int_0 is asserted.Writing to UMAC_INT_CLR_0 in the lmac_to_umac_ack_0 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACACK0</name>
            <description>IPCP LMAC TO UMAC ACK 0</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTCLR0</name>
                <description>Writing 1 to this bit causes the UMAC_INT_0 bit in umac_to_lmac_cmd_0 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACACK0</name>
            <description>IPCP UMAC TO LMAC ACK 0</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTCLR0</name>
                <description>Writing 1 to this bit causes the LMAC_INT_0 bit in lmac_to_umac_cmd_0 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACINTENABLE0</name>
            <description>IPCP LMAC INT ENABLE 0</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTEN0</name>
                <description>Controls the LMAC_0 interrupt line (lmac_int_0).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheLmac0InterruptIs</name>
                    <description>The LMAC_0 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheLmac0InterruptIs1</name>
                    <description>The LMAC_0 interrupt is enabled and the interrupt raised when LMAC_INT_0=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACINTENABLE0</name>
            <description>IPCP UMAC INT ENABLE 0</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTEN0</name>
                <description>Controls the UMAC_0 interrupt line (umac_int_0).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheUmac0InterruptIs</name>
                    <description>The UMAC_0 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheUmac0InterruptIs1</name>
                    <description>The UMAC_0 interrupt is enabled and the interrupt raised when UMAC_INT_0=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACCMD1</name>
            <description>IPCP LMAC TO UMAC CMD 1</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACDATA1</name>
                <description>Message data to be passed from the LMAC_1 to the UMAC_1.A write to this register causes lmac_int_1 to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LMACINT1</name>
                <description>This Read Only bit is set to 1 when the lmac_int_1 event is asserted.Writing to LMAC_INT_CLR_1 in the umac_to_lmac_ack_1 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACCMD1</name>
            <description>IPCP UMAC TO LMAC CMD 1</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACDATA1</name>
                <description>Message data to be passed from the UMAC_1 to the LMAC_1.A write to this register causes the umac_int_1 interrupt to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>UMACINT1</name>
                <description>This Read Only bit is set to 1 when umac_int_1 is asserted.Writing to UMAC_INT_CLR_1 in the lmac_to_umac_ack_1 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACACK1</name>
            <description>IPCP LMAC TO UMAC ACK 1</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTCLR1</name>
                <description>Writing 1 to this bit causes the UMAC_INT_1 bit in umac_to_lmac_cmd_1 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACACK1</name>
            <description>IPCP UMAC TO LMAC ACK 1</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTCLR1</name>
                <description>Writing 1 to this bit causes the LMAC_INT_1 bit in lmac_to_umac_cmd_1 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACINTENABLE1</name>
            <description>IPCP LMAC INT ENABLE 1</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTEN1</name>
                <description>Controls the LMAC_1 interrupt line (lmac_int_1).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheLmac1InterruptIs</name>
                    <description>The LMAC_1 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheLmac1InterruptIs1</name>
                    <description>The LMAC_1 interrupt is enabled and the interrupt raised when LMAC_INT_1=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACINTENABLE1</name>
            <description>IPCP UMAC INT ENABLE 1</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTEN1</name>
                <description>Controls the UMAC_1 interrupt line (umac_int_1).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheUmac1InterruptIs</name>
                    <description>The UMAC_1 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheUmac1InterruptIs1</name>
                    <description>The UMAC_1 interrupt is enabled and the interrupt raised when UMAC_INT_1=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACCMD2</name>
            <description>IPCP LMAC TO UMAC CMD 2</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACDATA2</name>
                <description>Message data to be passed from the LMAC_2 to the UMAC_2.A write to this register causes lmac_int_2 to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LMACINT2</name>
                <description>This Read Only bit is set to 1 when the lmac_int_2 event is asserted.Writing to LMAC_INT_CLR_2 in the umac_to_lmac_ack_2 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACCMD2</name>
            <description>IPCP UMAC TO LMAC CMD 2</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACDATA2</name>
                <description>Message data to be passed from the UMAC_2 to the LMAC_2.A write to this register causes the umac_int_2 interrupt to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>UMACINT2</name>
                <description>This Read Only bit is set to 1 when umac_int_2 is asserted.Writing to UMAC_INT_CLR_2 in the lmac_to_umac_ack_2 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACACK2</name>
            <description>IPCP LMAC TO UMAC ACK 2</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTCLR2</name>
                <description>Writing 1 to this bit causes the UMAC_INT_2 bit in umac_to_lmac_cmd_2 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACACK2</name>
            <description>IPCP UMAC TO LMAC ACK 2</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTCLR2</name>
                <description>Writing 1 to this bit causes the LMAC_INT_2 bit in lmac_to_umac_cmd_2 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
