ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>IPCPLMACINTENABLE2</name>
            <description>IPCP LMAC INT ENABLE 2</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTEN2</name>
                <description>Controls the LMAC_2 interrupt line (lmac_int_2).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheLmac2InterruptIs</name>
                    <description>The LMAC_2 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheLmac2InterruptIs1</name>
                    <description>The LMAC_2 interrupt is enabled and the interrupt raised when LMAC_INT_2=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACINTENABLE2</name>
            <description>IPCP UMAC INT ENABLE 2</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTEN2</name>
                <description>Controls the UMAC_2 interrupt line (umac_int_2).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheUmac2InterruptIs</name>
                    <description>The UMAC_2 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheUmac2InterruptIs1</name>
                    <description>The UMAC_2 interrupt is enabled and the interrupt raised when UMAC_INT_2=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACCMD3</name>
            <description>IPCP LMAC TO UMAC CMD 3</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACDATA3</name>
                <description>Message data to be passed from the LMAC_3 to the UMAC_3.A write to this register causes lmac_int_3 to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LMACINT3</name>
                <description>This Read Only bit is set to 1 when the lmac_int_3 event is asserted.Writing to LMAC_INT_CLR_3 in the umac_to_lmac_ack_3 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACCMD3</name>
            <description>IPCP UMAC TO LMAC CMD 3</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACDATA3</name>
                <description>Message data to be passed from the UMAC_3 to the LMAC_3.A write to this register causes the umac_int_3 interrupt to be asserted.</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>UMACINT3</name>
                <description>This Read Only bit is set to 1 when umac_int_3 is asserted.Writing to UMAC_INT_CLR_3 in the lmac_to_umac_ack_3 register clears this bit.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACTOUMACACK3</name>
            <description>IPCP LMAC TO UMAC ACK 3</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTCLR3</name>
                <description>Writing 1 to this bit causes the UMAC_INT_3 bit in umac_to_lmac_cmd_3 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACTOLMACACK3</name>
            <description>IPCP UMAC TO LMAC ACK 3</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTCLR3</name>
                <description>Writing 1 to this bit causes the LMAC_INT_3 bit in lmac_to_umac_cmd_3 to be cleared.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPLMACINTENABLE3</name>
            <description>IPCP LMAC INT ENABLE 3</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACINTEN3</name>
                <description>Controls the LMAC_3 interrupt line (lmac_int_3).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheLmac3InterruptIs</name>
                    <description>The LMAC_3 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheLmac3InterruptIs1</name>
                    <description>The LMAC_3 interrupt is enabled and the interrupt raised when LMAC_INT_3=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPUMACINTENABLE3</name>
            <description>IPCP UMAC INT ENABLE 3</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINTEN3</name>
                <description>Controls the UMAC_3 interrupt line (umac_int_3).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TheUmac3InterruptIs</name>
                    <description>The UMAC_3 interrupt is not enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TheUmac3InterruptIs1</name>
                    <description>The UMAC_3 interrupt is enabled and the interrupt raised when UMAC_INT_3=1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IPCPMVDMAOWNER</name>
            <description>IPCP MVDMA OWNER</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MVDMAOWNER</name>
                <description>Software interlock for coordinating ownership of MVDMA peripheral.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MvdmaOwnedByLmac</name>
                    <description>MVDMA owned by LMAC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MvdmaOwnedByUmac</name>
                    <description>MVDMA owned by UMAC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LMACWATCHDOGENABLE</name>
            <description>LMAC WATCHDOG ENABLE</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACWATCHDOGENABLE</name>
                <description>Enable LMAC watchdog. The LMAC watchdog will trigger a reset when the timer reaches zero.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LMACWATCHDOGTIMER</name>
            <description>LMAC WATCHDOG TIMER</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMACWATCHDOGTIMER</name>
                <description>LMAC firmware needs to reinitialise the timer before it reaches zero to prevent the LMAC watchdog triggering a reset.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UMACWATCHDOGENABLE</name>
            <description>UMAC WATCHDOG ENABLE</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACWATCHDOGENABLE</name>
                <description>Enable UMAC watchdog. The UMAC watchdog will trigger a reset when the timer reaches zero.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UMACWATCHDOGTIMER</name>
            <description>UMAC WATCHDOG TIMER</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACWATCHDOGTIMER</name>
                <description>UMAC firmware needs to reinitialise the timer before it reaches zero to prevent the UMAC watchdog triggering a reset.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
