ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RPUSYS</name>
      <description>RPUPBUS</description>
      <baseAddress>0x48080000</baseAddress>
      <alternatePeripheral>RPUMAC</alternatePeripheral>
      <headerStructName>RPUPBUS</headerStructName>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RPUPBUS</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>RPU_INTERRUPT_CTRL</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_RPU_INTERRUPT_CTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x00000</addressOffset>
          <register>
            <name>HWSTATEXT0</name>
            <description>RPU INTERRUPT CTRL HWSTATEXT0</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRQHWSTAT0</name>
                <description>When set to '1', this indicates assertion of internal interrupts 31..0.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWSTATEXT1</name>
            <description>RPU INTERRUPT CTRL HWSTATEXT1</description>
            <addressOffset>0x4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRQHWSTAT1</name>
                <description>When set to '1', this indicates assertion of internal interrupts 63..32.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWSTATEXT2</name>
            <description>RPU INTERRUPT CTRL HWSTATEXT2</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRQHWSTAT2</name>
                <description>When set to '1', this indicates assertion of external interrupts 31..0.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWSTATEXT3</name>
            <description>RPU INTERRUPT CTRL HWSTATEXT3</description>
            <addressOffset>0xC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRQHWSTAT3</name>
                <description>When set to '1', this indicates assertion of external interrupts 63..32.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x80</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HWVECEXT[%s]</name>
            <description>Description collection: RPU INTERRUPT CTRL HWVECEXT</description>
            <addressOffset>0x200</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRQHWVEC</name>
                <description>Vectors the trigger from the SPI Slave interrupt,where 0=disabled,1..(4 x NUM_MCU) = MCU0, MCU1 etc (where each of MCUn is a 4-bit vector),(4 x NUM_MCU +1)..((4 x NUM_MCU) + (4 x NUM_ECU)) = ECU0, ECU1 etc (where each of ECUn is a 4-bit vector.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RPU_LOGGING</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_RPU_LOGGING</headerStructName>
          <access>read-write</access>
          <addressOffset>0x01000</addressOffset>
          <register>
            <name>SYSLOG</name>
            <description>RPU LOGGING SYS LOG</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PAYLOAD</name>
                <description>24-bit payload.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>STRUCTUREDLOGGINGTYPE</name>
                <description>Structured Logging Type (Header bits 2:0).</description>
                <lsb>24</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SEQUENCEINDICATOR</name>
                <description>Sequence Indicator (Header bits 5:4).</description>
                <lsb>27</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSLOGSTATUS</name>
            <description>RPU LOGGING SYS LOG STATUS</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVERFLOW</name>
                <description>Set to 1 when an overflow occurs. This is a sticky but which should be cleared by writing any value to this bit.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSLOGFILTEROUTTYPE</name>
            <description>RPU LOGGING SYS LOG FILTEROUT TYPE</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FILTEROUTVALUE</name>
                <description>When set to 1, filters out logging items of type 'Value'.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FILTEROUTSTRING</name>
                <description>When set to 1, filters out logging items of type 'String'.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FILTEROUTJOBQUEUE</name>
                <description>When set to 1, filters out logging items of type 'Job Queue'.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>FILTEROUTJOBSTART</name>
                <description>When set to 1, filters out logging items of type 'Job Start'.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FILTEROUTJOBEND</name>
                <description>When set to 1, filters out logging items of type 'Job End'.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSLOGFILTEROUTSOURCE</name>
            <description>RPU LOGGING SYS LOG FILTEROUT SOURCE</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FILTEROUTMCU0</name>
                <description>When set to 1, filters out logging from MCU0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FILTEROUTMCU1</name>
                <description>When set to 1, filters out logging from MCU1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FILTEROUTMCU2</name>
                <description>When set to 1, filters out logging from MCU2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>FILTEROUTMCU3</name>
                <description>When set to 1, filters out logging from MCU3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FILTEROUTECU0</name>
                <description>When set to 1, filters out logging from ECU0.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>FILTEROUTECU1</name>
                <description>When set to 1, filters out logging from ECU1.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FILTEROUTECU2</name>
                <description>When set to 1, filters out logging from ECU2.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FILTEROUTECU3</name>
                <description>When set to 1, filters out logging from ECU3.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>FILTEROUTECU4</name>
                <description>When set to 1, filters out logging from ECU4.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>FILTEROUTECU5</name>
                <description>When set to 1, filters out logging from ECU5.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>FILTEROUTMCP0</name>
                <description>When set to 1, filters out logging from MCP0.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>FILTEROUTMCP1</name>
                <description>When set to 1, filters out logging from MCP1.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>FILTEROUTMCP2</name>
                <description>When set to 1, filters out logging from MCP2.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>FILTEROUTMCP3</name>
                <description>When set to 1, filters out logging from MCP3.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>FILTEROUTMCP4</name>
                <description>When set to 1, filters out logging from MCP4.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>FILTEROUTMCP5</name>
                <description>When set to 1, filters out logging from MCP5.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>FILTEROUTDCP</name>
                <description>When set to 1, filters out logging from DCP.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSTIMEBASELO</name>
            <description>RPU LOGGING SYS TIME BASE LO</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMEBASELO</name>
                <description>Bottom 32 bits of the Time Base. SW can write to thise register, but only if TRACE_TIMESTAMP_ENABLE = 0.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSTIMEBASEHI</name>
            <description>RPU LOGGING SYS TIME BASE HI</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMEBASEHI</name>
                <description>Top 4 bits of the Time Base. SW can write to thise register, but only if TRACE_TIMESTAMP_ENABLE = 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACESTAT</name>
            <description>RPU LOGGING SYS DBG TRACE STAT</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACEIRQSTATUS</name>
                <description>Debug trace interrupt status.Latched high when TRACE_POINTER = TRACE_LENGTH / 2.Can be forced high by writing 1 to this register for debug purposes (to test interrupt connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACEENAB</name>
            <description>RPU LOGGING SYS DBG TRACE ENAB</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACEIRQENABLE</name>
                <description>Debug trace interrupt enable for channel.ANDed with TRACE_IRQ_STATUS before generating IRQ output from block.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RPULOGENABLE</name>
                <description>Enables RPU logging. By default it is disabled.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACECLR</name>
            <description>RPU LOGGING SYS DBG TRACE CLR</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACEIRQCLEAR</name>
                <description>Debug trace interrupt acknowledge/clear for channel.Write 1 to clear TRACE_IRQ_STATUS.Writing 0 has no effect.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACEADD</name>
            <description>RPU LOGGING SYS DBG TRACE ADD</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACEBASEADDRESS</name>
                <description>48-bit word-aligned based address in global memory at which to start writing the trace of values logged by the DCP.Two 24-bit items are logged:1. 24-bit word containing a timestamp in bits [23:6] andDCP channel ID in bits [5:0].2. 24-bit MA register value.</description>
                <lsb>1</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACELEN</name>
            <description>RPU LOGGING SYS DBG TRACE LEN</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACELENGTH</name>
                <description>48-bit word-aligned trace length - 1.Trace writes wrap at TRACE_BASE_ADDRESS + TRACE_LENGTH back to TRACE_BASE_ADDRESS.</description>
                <lsb>1</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACEPTR</name>
            <description>RPU LOGGING SYS DBG TRACE PTR</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACEPOINTER</name>
                <description>48-bit word-aligned pointer offset from TRACE_BASE_ADDRESS for last trace write.Automatically increments as each trace item is written and wraps back to 0 at TRACE_LENGTH.</description>
                <lsb>1</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSDBGTRACETIMER</name>
            <description>RPU LOGGING SYS DBG TRACE TIMER</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRACETIMESTAMPDIVIDER</name>
                <description>Timestamp period - 1 in core clocks</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>TRACETIMESTAMPENABLE</name>
                <description>Trace timestamp enable:</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TimestampTimerDisabl</name>
                    <description>Timestamp timer disabled (power saving mode)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TimestampTimerEnable</name>
                    <description>Timestamp timer enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>UCC_EFS</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_UCC_EFS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x03000</addressOffset>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FLAGSTATEK[%s]</name>
            <description>Description collection: UCC EFS FLAG STATE K</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FLAGSTATEK150</name>
                <description>The states of Event Flags 16*K + (15 downto 0)</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0xB</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CFGQUEUEORGP[%s]</name>
            <description>Description collection: UCC EFS CFG QUEUE OR GP</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGQUEUEORGP</name>
                <description>Select 0: queue or 1: gp ,24*K + (23 downto 0)</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPNUMACTIVESEL</name>
            <description>UCC EFS GP NUM ACTIVE SEL</description>
            <addressOffset>0x12C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPNUMACTIVESEL</name>
                <description>The max number of active selectors in this instance of the Event Flag System (1 to 16).</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
