ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <dim>0x16</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PERIPCFGEF[%s]</name>
            <description>Description collection: UCC EFS PERIP CFG EF</description>
            <addressOffset>0x140</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFGEFAND0</name>
                <description>AND gate configuration 6N:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisabledZero</name>
                    <description>Disabled(zero)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PassThroughUpper</name>
                    <description>Pass-through upper</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PassThorughLower</name>
                    <description>Pass-thorugh lower</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AndUpperAndLower</name>
                    <description>AND upper and lower</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGEFOR0</name>
                <description>OR gate configuration 6N:</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisabledZero</name>
                    <description>Disabled(zero)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PassThroughUpper</name>
                    <description>Pass-through upper</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PassThorughLower</name>
                    <description>Pass-thorugh lower</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OrUpperAndLower</name>
                    <description>OR upper and lower</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFGEFAND1</name>
                <description>AND gate configuration 6N+1</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CFGEFOR1</name>
                <description>OR gate configuration 6N+1</description>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CFGEFAND2</name>
                <description>AND gate configuration 6N+2</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>CFGEFOR2</name>
                <description>OR gate configuration 6N+2</description>
                <lsb>10</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>CFGEFAND3</name>
                <description>AND gate configuration 6N+3</description>
                <lsb>12</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>CFGEFOR3</name>
                <description>OR gate configuration 6N+3</description>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CFGEFAND4</name>
                <description>AND gate configuration 6N+4</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CFGEFOR4</name>
                <description>OR gate configuration 6N+4</description>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>CFGEFAND5</name>
                <description>AND gate configuration 6N+5</description>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>CFGEFOR5</name>
                <description>OR gate configuration 6N+5</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PERIPGPSEL[%s]</name>
            <description>Description collection: UCC EFS PERIP GP SEL</description>
            <addressOffset>0x1C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TOANDFLAG</name>
                <description>To AND flag demux value</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FROMGP</name>
                <description>From GP mux value</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x80</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OFXVECTOR[%s]</name>
            <description>Description collection: UCC EFS OFX VECTOR</description>
            <addressOffset>0x200</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFHIGHESTVECTOR</name>
                <description>The VECTOR value associated with the highest priority asserted Event Flag in OFx.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MCP0FLAGSOURCEN[%s]</name>
            <description>Description collection: UCC EFS MCP0 FLAG SOURCEN</description>
            <addressOffset>0x400</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCP0FLAGSOURCE</name>
                <description>The OR flag number that releases MCP0 from WAIT.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MCP1FLAGSOURCEN[%s]</name>
            <description>Description collection: UCC EFS MCP1 FLAG SOURCEN</description>
            <addressOffset>0x420</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCP1FLAGSOURCE</name>
                <description>The OR flag number that releases MCP1 from WAIT.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MCP2FLAGSOURCEN[%s]</name>
            <description>Description collection: UCC EFS MCP2 FLAG SOURCEN</description>
            <addressOffset>0x440</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCP2FLAGSOURCE</name>
                <description>The OR flag number that releases MCP2 from WAIT.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MCP3FLAGSOURCEN[%s]</name>
            <description>Description collection: UCC EFS MCP3 FLAG SOURCEN</description>
            <addressOffset>0x460</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCP3FLAGSOURCE</name>
                <description>The OR flag number that releases MCP3 from WAIT.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MCP4FLAGSOURCEN[%s]</name>
            <description>Description collection: UCC EFS MCP4 FLAG SOURCEN</description>
            <addressOffset>0x480</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCP4FLAGSOURCE</name>
                <description>The OR flag number that releases MCP4 from WAIT.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MCP5FLAGSOURCEN[%s]</name>
            <description>Description collection: UCC EFS MCP5 FLAG SOURCEN</description>
            <addressOffset>0x4A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCP5FLAGSOURCE</name>
                <description>The OR flag number that releases MCP5 from WAIT.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCUINTERRUPTSOURCE</name>
            <description>UCC EFS MCU INTERRUPT SOURCE</description>
            <addressOffset>0x500</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCUFLAGSOURCE</name>
                <description>The OR flag number that drives an MCU interrupt</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT1SOURCE</name>
            <description>UCC EFS HP INTERRUPT1 SOURCE</description>
            <addressOffset>0x504</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPFLAG1SOURCE</name>
                <description>The OR flag number that drives High Priority interrupt 1</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECUINTERRUPTSOURCE</name>
            <description>UCC EFS ECU INTERRUPT SOURCE</description>
            <addressOffset>0x508</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECUFLAGSOURCE</name>
                <description>The OR flag number that drives ECU interrupt</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCU2INTERRUPTSOURCE</name>
            <description>UCC EFS MCU2 INTERRUPT SOURCE</description>
            <addressOffset>0x51C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCU2FLAGSOURCE</name>
                <description>The OR flag number that drives an MCU2 interrupt</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT2SOURCE</name>
            <description>UCC EFS HP INTERRUPT2 SOURCE</description>
            <addressOffset>0x520</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPFLAG2SOURCE</name>
                <description>The OR flag number that drives High Priority interrupt 2</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCUINTERRUPTSTAT</name>
            <description>UCC EFS MCU INTERRUPT STAT</description>
            <addressOffset>0x600</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCUIRQSTATUS</name>
                <description>MCU interrupt status.Latched high when OF[MCU_FLAG_SOURCE] == 1.Can be forced high by writing 1 to this register for debug purposes (to test interrupt connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCUINTERRUPTENAB</name>
            <description>UCC EFS MCU INTERRUPT ENAB</description>
            <addressOffset>0x604</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCUIRQENABLE</name>
                <description>MCU interrupt enable.ANDed with MCU_IRQ_STATUS before generating IRQ output from block.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCUINTERRUPTCLR</name>
            <description>UCC EFS MCU INTERRUPT CLR</description>
            <addressOffset>0x608</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCUIRQCLEAR</name>
                <description>MCU interrupt acknowledge/clear.Write 1 to clear MCU_IRQ_STATUS.Writing 0 has no effect.Read returns 1 during clear hold-off delay.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCUINTERRUPTENABHOLDOFF</name>
            <description>UCC EFS MCU INTERRUPT ENAB HOLDOFF</description>
            <addressOffset>0x60C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCUIRQENABLEHOLDOFF</name>
                <description>MCU interrupt enable clear hold-off delay.Defaults to NUM_AND_FLAGS + NUM_OR_FLAGS.Delay required to account for propogation of cleared source event through cascaded gate delaywithin EFS, to allow the interrupt enable to be toggled to generate an MCU edge-sensitive interruptfor additional events whilst preventing surplus interrupt generation.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCUINTERRUPTCLRHOLDOFF</name>
            <description>UCC EFS MCU INTERRUPT CLR HOLDOFF</description>
            <addressOffset>0x610</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCUIRQCLEARHOLDOFF</name>
                <description>MCU interrupt clear hold-off delay.Defaults to NUM_AND_FLAGS + NUM_OR_FLAGS.Delay required to account for propogation of cleared source event through cascaded gate delaywithin EFS, to prevent surplus interrupt generation.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT1STAT</name>
            <description>UCC EFS HP INTERRUPT1 STAT</description>
            <addressOffset>0x620</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQ1STATUS</name>
                <description>High priority interrupt 1 status.IRQ[n] latched high when OF[HP_FLAGn_SOURCE] == 1.Can be forced high by writing 1 to this register for debug purposes (to test interrupt connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT1ENAB</name>
            <description>UCC EFS HP INTERRUPT1 ENAB</description>
            <addressOffset>0x624</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQ1ENABLE</name>
                <description>High priority interrupt 1 enable.ANDed with HP_IRQ1_STATUS before generating IRQ output from block.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT1CLR</name>
            <description>UCC EFS HP INTERRUPT1 CLR</description>
            <addressOffset>0x628</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQ1CLEAR</name>
                <description>High priority interrupt 1 acknowledge/clear.Write 1 to clear HP_IRQ1_STATUS.Writing 0 has no effect.Read returns 1 during clear hold-off delay.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECUINTERRUPTSTAT</name>
            <description>UCC EFS ECU INTERRUPT STAT</description>
            <addressOffset>0x62C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECUIRQSTATUS</name>
                <description>ECU interrupt status.IRQ[n] latched high when OF[ECU_FLAGn_SOURCE] == 1.Can be forced high by writing 1 to this register for debug purposes (to test interrupt connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECUINTERRUPTENAB</name>
            <description>UCC EFS ECU INTERRUPT ENAB</description>
            <addressOffset>0x630</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECUIRQENABLE</name>
                <description>ECU interrupt enable.ANDed with ECU_IRQ_STATUS before generating IRQ output from block.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECUINTERRUPTCLR</name>
            <description>UCC EFS ECU INTERRUPT CLR</description>
            <addressOffset>0x634</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECUIRQCLEAR</name>
                <description>ECU interrupt acknowledge/clear.Write 1 to clear ECU_IRQ_STATUS.Writing 0 has no effect.Read returns 1 during clear hold-off delay.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECUINTERRUPTENABHOLDOFF</name>
            <description>UCC EFS ECU INTERRUPT ENAB HOLDOFF</description>
            <addressOffset>0x638</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECUIRQENABLEHOLDOFF</name>
                <description>ECU interrupt enable clear hold-off delay.Defaults to NUM_AND_FLAGS + NUM_OR_FLAGS.Delay required to account for propogation of cleared source event through cascaded gate delaywithin EFS, to allow the interrupt enable to be toggled to generate an ECU edge-sensitive interruptfor additional events whilst preventing surplus interrupt generation.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ECUINTERRUPTCLRHOLDOFF</name>
            <description>UCC EFS ECU INTERRUPT CLR HOLDOFF</description>
            <addressOffset>0x63C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECUIRQCLEARHOLDOFF</name>
                <description>ECU interrupt clear hold-off delay.Defaults to NUM_AND_FLAGS + NUM_OR_FLAGS.Delay required to account for propogation of cleared source event through cascaded gate delaywithin EFS, to prevent surplus interrupt generation.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
