ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>HPINTERRUPTENABHOLDOFF</name>
            <description>UCC EFS HP INTERRUPT ENAB HOLDOFF</description>
            <addressOffset>0x640</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQENABLEHOLDOFF</name>
                <description>High priority interrupt enable clear hold-off delay.Defaults to NUM_AND_FLAGS + NUM_OR_FLAGS.Delay required to account for propogation of cleared source event through cascaded gate delaywithin EFS, to allow the interrupt enable to be toggled to generate an HP edge-sensitive interruptfor additional events whilst preventing surplus interrupt generation.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPTCLRHOLDOFF</name>
            <description>UCC EFS HP INTERRUPT CLR HOLDOFF</description>
            <addressOffset>0x644</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQCLEARHOLDOFF</name>
                <description>High priority interrupt clear hold-off delay.Defaults to NUM_AND_FLAGS + NUM_OR_FLAGS.Delay required to account for propogation of cleared source event through cascaded gate delaywithin EFS, to prevent surplus interrupt generation.</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT2STAT</name>
            <description>UCC EFS HP INTERRUPT2 STAT</description>
            <addressOffset>0x648</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQ2STATUS</name>
                <description>High priority interrupt 2 status.IRQ[n] latched high when OF[HP_FLAGn_SOURCE] == 1.Can be forced high by writing 1 to this register for debug purposes (to test interrupt connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT2ENAB</name>
            <description>UCC EFS HP INTERRUPT2 ENAB</description>
            <addressOffset>0x64C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQ2ENABLE</name>
                <description>High priority interrupt 2 enable.ANDed with HP_IRQ2_STATUS before generating IRQ output from block.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HPINTERRUPT2CLR</name>
            <description>UCC EFS HP INTERRUPT2 CLR</description>
            <addressOffset>0x650</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPIRQ2CLEAR</name>
                <description>High priority interrupt 2 acknowledge/clear.Write 1 to clear HP_IRQ2_STATUS.Writing 0 has no effect.Read returns 1 during clear hold-off delay.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCU2INTERRUPTSTAT</name>
            <description>UCC EFS MCU2 INTERRUPT STAT</description>
            <addressOffset>0x6E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCU2IRQSTATUS</name>
                <description>MCU2 interrupt status.Latched high when OF[MCU2_FLAG_SOURCE] == 1.Can be forced high by writing 1 to this register for debug purposes (to test interrupt connectivity in hardware and software).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCU2INTERRUPTENAB</name>
            <description>UCC EFS MCU2 INTERRUPT ENAB</description>
            <addressOffset>0x6E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCU2IRQENABLE</name>
                <description>MCU2 interrupt enable.ANDed with MCU2_IRQ_STATUS before generating IRQ output from block.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MCU2INTERRUPTCLR</name>
            <description>UCC EFS MCU2 INTERRUPT CLR</description>
            <addressOffset>0x6E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MCU2IRQCLEAR</name>
                <description>MCU2 interrupt acknowledge/clear.Write 1 to clear MCU2_IRQ_STATUS.Writing 0 has no effect.Read returns 1 during clear hold-off delay.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD0</name>
            <description>UCC EFS BUILD 0</description>
            <addressOffset>0xB00</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXNUMSELECTORS</name>
                <description>The max number of selectors in this instance of the Event Flag System (1 to 16).</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD1</name>
            <description>UCC EFS BUILD 1</description>
            <addressOffset>0xB04</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDNUMANDOR</name>
                <description>The number of and/or gates in this instance of the Event Flag System (8 to 128).</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD2</name>
            <description>UCC EFS BUILD 2</description>
            <addressOffset>0xB08</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXGFID</name>
                <description>The highest GP flag ID number in this instance of the Event Flag System. Each GF_SEL flag can be programmed to select any GP flag from GP[0] to GP[MAX_GP_FLAG_NUM] (0 to 556).</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>EDC_SYS</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_EDC_SYS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x05000</addressOffset>
          <register>
            <name>DBGERRMONITOR</name>
            <description>EDC SYS DBG ERR MONITOR</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBGERRMONITORCHANNEL</name>
                <description>EDC transfer channel to monitor for errors.Errors are latched and are cleared by writing to this register.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>DBGERRMONITORSELECT</name>
                <description>EDC error monitor channel select:</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MonitorErrorsOnAllCh</name>
                    <description>Monitor errors on all channels.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MonitorErrorOnlyOnDb</name>
                    <description>Monitor error only on DBG_ERR_MONITOR_CHANNEL.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBGAGENOFFSUMRANGEERR</name>
                <description>Offset sum within address generator cannot be brought back in range</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>DBGTBUSTOPBUSMASKERR</name>
                <description>Partial mask only supported for final TBus to PBus transfer</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DBGTBUSTOTBUSMASKERR</name>
                <description>Partial mask only supported for final TBus to TBus transfer</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>DBGTBUSTOEXTRAMMASKERR</name>
                <description>Partial mask only supported for final TBus to ExtRAM transfer</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>DBGTBUSTOGRAMMASKERR</name>
                <description>Partial mask only supported for final TBus to GRAM transfer</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>DBGMMRTOTBUSMASKERR</name>
                <description>Partial mask only supported for final MMR to TBus transfer</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>DBGPBUSTOPBUSMASKERR</name>
                <description>Partial mask only supported for final PBus to PBus transfer</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>DBGPBUSTOTBUSMASKERR</name>
                <description>Partial mask only supported for final PBus to TBus transfer</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DBGPBUSTOEXTRAMMASKERR</name>
                <description>Partial mask only supported for final PBus to ExtRAM transfer</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>DBGPBUSTOGRAMMASKERR</name>
                <description>Partial mask only supported for final PBus to GRAM transfer</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>DBGEXTRAMTOPBUSMASKERR</name>
                <description>Partial mask only supported for final ExtRAM to PBus transfer</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>DBGEXTRAMTOTBUSMASKERR</name>
                <description>Partial mask only supported for final ExtRAM to TBus transfer</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>DBGGRAMTOPBUSMASKERR</name>
                <description>Partial mask only supported for final GRAM to PBus transfer</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>DBGGRAMTOTBUSMASKERR</name>
                <description>Partial mask only supported for final GRAM to TBus transfer</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>64</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>EDCSYSCHANREGS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_SYS_EDCSYSCHANREGS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x20</addressOffset>
            <register>
              <name>CONTROL</name>
              <description>Description cluster: EDC SYS CONTROL</description>
              <addressOffset>0x00</addressOffset>
              <access>read-write</access>
              <resetValue>0x80000003</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STATE</name>
                  <description>Read-only status:</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Running</name>
                      <description>RUNning</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Waiting</name>
                      <description>WAITing</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Stepping</name>
                      <description>STEPping</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Halted</name>
                      <description>HALTed</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DMAACTIVE</name>
                  <description>Read-only status:</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoActiveDmaJobInstr</name>
                      <description>No active DMA job, instruction stream processing can continue.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ActiveDmaJobInstruc</name>
                      <description>Active DMA job, instruction stream processing stalled until completion.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LATCHEDDCPRESET</name>
                  <description>Latched DCP thread software reset.</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                </field>
                <field>
                  <name>PULSEDDCPRESET</name>
                  <description>Self-clearing DCP thread software reset.</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                </field>
                <field>
                  <name>RUN</name>
                  <description>Set to 1 to start execution of the instruction stream from the current PC</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                </field>
                <field>
                  <name>STEP</name>
                  <description>Set to 1 to STEP by one instruction. This bit takes precedence over RUN</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                </field>
                <field>
                  <name>HALT</name>
                  <description>Set to 1 to HALT instruction stream. This bit takes precedence over STEP and RUN</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PC</name>
              <description>Description cluster: EDC SYS PC</description>
              <addressOffset>0x04</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PC</name>
                  <description>The memory address from which the next instruction will be loaded</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>64</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>EDCSYSDEBUGREGS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_SYS_EDCSYSDEBUGREGS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x220</addressOffset>
            <register>
              <name>DEBUGSTAT</name>
              <description>Description cluster: EDC SYS DEBUG STAT</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ITEMSLEFT</name>
                  <description>The number of items remaining in each DMA transfer, represented in 'natural' format.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>TRANSFERSLEFT</name>
                  <description>When TRANSFERS_MODE=0:The number of DMA transfers remaining in the DMA job, represented in 'natural' format.When TRANSFERS_MODE=1:ITEMS_LEFT[23:0].</description>
                  <lsb>16</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AGENDEBUGSTAT</name>
              <description>Description cluster: EDC SYS AGEN DEBUG STAT</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AGENITEMSLEFT</name>
                  <description>The number of Address Generator items remaining in each DMA transfer, represented in 'natural' format.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>AGENTRANSFERSLEFT</name>
                  <description>When TRANSFERS_MODE=0:The number of Address Generator DMA transfers remaining in the DMA job, represented in 'natural' format.When TRANSFERS_MODE=1:ITEMS_LEFT[23:0].</description>
                  <lsb>16</lsb>
                  <msb>23</msb>
                </field>
                <field>
                  <name>AGENBURSTLEFT</name>
                  <description>The number of Address Generator items remaining in each burst transfer, represented in 'natural' format.</description>
                  <lsb>28</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>STATCTRL</name>
            <description>EDC SYS STAT CTRL</description>
            <addressOffset>0x424</addressOffset>
            <access>read-write</access>
            <resetValue>0x40000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATREQSEL</name>
                <description>Requestor to accumulate statistics for when STAT_REQ_ALL=0.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>STATREQALL</name>
                <description>Statistic accumulation request selection:</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AccumulateStatistics</name>
                    <description>Accumulate statistics for STAT_REQ_SEL requestor only.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AccumulateStatistics1</name>
                    <description>Accumulate statistics across all requestors.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STATREQENABLE</name>
                <description>Statistic accumulation control:</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AccumulationOfStatis</name>
                    <description>Accumulation of statistics disabled (power saving mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AccumulationOfStatis1</name>
                    <description>Accumulation of statistics enabled (debug mode).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCPCYCLECNT</name>
            <description>EDC SYS DCP CYCLE CNT</description>
            <addressOffset>0x428</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCPCYCLECNT</name>
                <description>Wrapping DCP cycle count.Write any value to clear.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
