ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>DCPISSUECNT</name>
            <description>EDC SYS DCP ISSUE CNT</description>
            <addressOffset>0x42C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCPISSUECNT</name>
                <description>Wrapping DCP issue count.Write any value to clear.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCPWAITCNT</name>
            <description>EDC SYS DCP WAIT CNT</description>
            <addressOffset>0x430</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCPWAITCNT</name>
                <description>Wrapping DCP wait count.Write any value to clear.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BURSTCTRL</name>
            <description>EDC SYS BURST CTRL</description>
            <addressOffset>0x434</addressOffset>
            <access>read-write</access>
            <resetValue>0x7F000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EDCMAXBURSTLEN</name>
                <description>Maximum ExtRAM burst length '-1'. Supports bursts of maximum 16 words length.</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>EDCBREAKNONLINEAR</name>
                <description>Defines whether ExtRAM bursts are broken on non-consecutive addresses.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNotBreakBurstsOnNo</name>
                    <description>Do not break bursts on non-linear addresses</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BreakBurstsOnNonLin</name>
                    <description>Break bursts on non-linear addresses</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EDCPAGEBREAK</name>
                <description>Defines page boundary on which ExtRAM bursts are broken.</description>
                <lsb>29</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>None</name>
                    <description>None</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256ByteBoundary</name>
                    <description>256 Byte Boundary</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512ByteBoundary</name>
                    <description>512 Byte Boundary</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1KbyteBoundaryDefau</name>
                    <description>1 kByteBoundary (default)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2KbyteBoundary</name>
                    <description>2 kByteBoundary</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4KbyteBoundary</name>
                    <description>4 kByteBoundary</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8KbyteBoundary</name>
                    <description>8 kByteBoundary</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16KbyteBoundary</name>
                    <description>16kByteBoundary</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>EDCEXTRAMBURSTTIMEOUT[%s]</name>
            <description>Description collection: EDC EXT RAM BURST TIMEOUT</description>
            <addressOffset>0x438</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000100F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BURSTTIMEOUTVALUE</name>
                <description>Timeout counter value</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>BURSTTIMEOUTENABLE</name>
                <description>When set high burst timeouts are enabled.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIGURATIONSTATUS</name>
            <description>EDC SYS CONFIGURATION STATUS</description>
            <addressOffset>0x448</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FULLAGENSTATUS</name>
                <description>Status register bit that indicates if full address generator is present or not.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FullAddressGenerator</name>
                    <description>Full address generator not present</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FullAddressGenerator1</name>
                    <description>Full address generator present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FULLOFFSETLUTSSTATUS</name>
                <description>Status register bit that indicates if GRAM offset LUTs are present or not.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GramOffsetLutsNotPre</name>
                    <description>GRAM offset LUTs not present</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GramOffsetLutsPresen</name>
                    <description>GRAM offset LUTs present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FULLOFFSETADJLUTSSTATUS</name>
                <description>Status register bit that indicates if GRAM offset adjustment LUTs are present or not.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GramOffsetAdjustment</name>
                    <description>GRAM offset adjustment LUTs not present</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GramOffsetAdjustment1</name>
                    <description>GRAM offset adjustment LUTs present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>EDC_PERIP</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_EDC_PERIP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x06000</addressOffset>
          <cluster>
            <dim>64</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>EDCPERIPCHANREGS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_PERIP_EDCPERIPCHANREGS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <register>
              <name>BASIC0</name>
              <description>Description cluster: EDC PERIP BASIC0</description>
              <addressOffset>0x0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LATCHEDRESET</name>
                  <description>Latched transfer engine channel software reset.Note: Use of PULSED_RESET is preferred over LATCHED_RESET.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>PULSEDRESET</name>
                  <description>Pulsed channel transfer engine software reset, clears automatically at start of next transfer on channel.Note: Once set must remain high before a DCP start/run instruction, so if set before ldbasic/ldfull it must be set again by the ldbasic/ldfull before the start/run.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                </field>
                <field>
                  <name>FINERATE</name>
                  <description>COARSE_RATE and FINE_RATE together define the rate at which EDC_BURST_LENGTH byte bursts may be transferred on this channel.0 : FR = 71 : FR = 62 : FR = 53 : FR = 4FR bursts every CR sysclk periods, giving (sysclk * EDC_BURST_LENGTH * FR * CR) bytes / sec)Notes:1. If COARSE_RATE=0 and FINE_RATE=0 then the burst rate is not controlled.2. COARSE_RATE is unused for TFR_MODE=100,101, where the COARSE_RATE for the ECN linked channel with TFR_MODE=001,011 is used once for both transfers.</description>
                  <lsb>3</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PERBUS</name>
                  <description>Selects bus for peripheral transfers:0 : Peripheral transfer is carried over the transfer bus (TBus) using hardware flow control of peripheral accesses.1 : Peripheral transfer is carried over the non-stalling peripheral bus (SysBus or PBus) using (PA + incrOffset) as the peripheral addressNotes:1. Must be set to 0 when TFR_MODE=110.2. Must be set to 1 when PW=11.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                </field>
                <field>
                  <name>TFRMODE</name>
                  <description>000 : Read from memory (MA+agenOffset), write to peripheral (PA+incrOffset)001 : Read from memory(MA+agenOffset), write to EDC channel (ECN)010 : Read from peripheral (PA+incrOffset), write to memory (MA+agenOffset)011 : Read from peripheral (PA+incrOffset), write to EDC channel (ECN)100 : Read from EDC channel (ECN), write to memory (MA+agenOffset)101 : Read from EDC channel (ECN), write to peripheral (PA+incrOffset)110 : Read FDSG/LFSR/PRBS offsets from MMR (MA+[0:3]), write to transfer bus (TBus)111 : Read from peripheral (PA+incrOffset), write to peripheral (MA+incr2Offset)Notes: 1. ITEMS must match for peripheral to peripheral transfers.2. Partial address masks only supported at end of transfers.3. 'from EDC channel (ECN)' transfers should be configured/started before 'to EDC channel (ECN)' transfers.4. ITEM_BYTES must be set to 3 bytes for TFR_MODE=110</description>
                  <lsb>6</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>EOPMASK</name>
                  <description>Selects the mask for the last memory write in case of EOP:</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MaskFromAddressGener</name>
                      <description>Mask from address generator is used.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MaskFromTbusReadPort</name>
                      <description>Mask from TBus read port is used.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TRANSFERMODE</name>
                  <description>Selects multiple 16-bit items length or single 24-bit items length transfer:0 : Perform TRANSFERS * ITEMS item transfers.1 : Perform single '(TRANSFERS &amp;lt;&amp;lt; 16) | ITEMS' item transfer.Notes:1. TRANSFERS_MODE must be written before writing TRANSFERS and ITEMS to BASIC1.2. TRANSFERS will always return 1 after switching TRANSFERS_MODE from 1 to 0.3. Single 24-bit items length transfer supported only when address generator is in row-column mode. Note that row-column mode is available only when EDC_SYS_CONFIGURATION_STATUS[0] = '1'; therefore 24-bit items transferis supported only when EDC_SYS_CONFIGURATION_STATUS[0] = '1'.The required row-column parameters to have modulo addressing are N0=anything that divides N2 and such that N0 &amp;gt;= GRAM_REQS-1 (the second condition is required to have best performance), N1=1, N2=modulo, A=0, B=0, O=start index.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                </field>
                <field>
                  <name>EOPMODE</name>
                  <description>Specifies the end of packet mode:Notes: 1. When enabled, EOP signal terminates all TRANSFERS, not just ITEMS within current transfer.</description>
                  <lsb>11</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DmaJobCompletesAfter</name>
                      <description>DMA job completes after TRANSFERS*ITEMS transfers.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Reserve</name>
                      <description>This is reserved.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DmaJobCompletesAfter2</name>
                      <description>DMA job completes after TRANSFERS*ITEMS transfers, or on receipt of EOP signal from peripheral, whichever occurs first.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Reserve3</name>
                      <description>This is reserved.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DISCARDOP</name>
                  <description>Controls whether output of transfers should be discarded:0 : Output not discarded.1 : Output discarded, transfers otherwise operate as normal.Notes:1. this control cannot be used for 'to EDC channel (ECN)' transfers where it should instead be set for the 'from EDC channel (ECN)' transfer.2. this register is double buffered at start of job.</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                </field>
                <field>
                  <name>INCR</name>
                  <description>Specifies incrementing peripheral address burst mode.By default all operations to the peripheral are to a single register location.Note: Only applicable to SysBus or PBus transfers.</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>StaticPeripheralAddr</name>
                      <description>Static peripheral address defined by PA.Typically used when transferring to/from a FIFO mapped to a single data port peripheral address.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>IncrementingPeripher</name>
                      <description>Incrementing peripheral address, start address defined by PA. Typically used when transferring to a block of configuration registers.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>BITREV</name>
                  <description>Specifies bit reversal within transferred bytes:0 : Bytes are not bit reversed1 : Bytes are bit reversedNotes :1. Applied to destination transfers only.2. Just the parameter for the destination channel is used when linked using ECN.</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>COARSERATE</name>
                  <description>COARSE_RATE defines the rate at which EDC_BURST_LENGTH byte bursts may be transferred on this channel.0 : CR = 1 / 81 : CR = 1 / 162 : CR = 1 / 323 : CR = 1 / 644 : CR = 1 / 1285 : CR = 1 / 2566 : CR = 1 / 5127 : CR = 1 / 1024FR bursts every CR sysclk periods, giving (sysclk * EDC_BURST_LENGTH * FR * CR) bytes / sec)Notes:1. If COARSE_RATE=0 and FINE_RATE=0 then the burst rate is not controlled.2. COARSE_RATE is unused for TFR_MODE=100,101, where the COARSE_RATE for the ECN linked channel with TFR_MODE=001,011 is used once for both transfers.</description>
                  <lsb>16</lsb>
                  <msb>18</msb>
                </field>
                <field>
                  <name>PALIGN</name>
                  <description>Specifies the alignment of peripheral data:</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DataIsRightAligned</name>
                      <description>Data is right aligned</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DataIsLeftAligned</name>
                      <description>Data is left aligned</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PW</name>
                  <description>Specifies the width of the peripheral transfer.If transfers are being performed on the wide Tbus then parallel transfers of this width take place.</description>
                  <lsb>20</lsb>
                  <msb>21</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>8BitPbusOrTbus</name>
                      <description>8 bit(PBus or TBus)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>16BitPbusOrTbus</name>
                      <description>16 bit (PBus or TBus)</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>24BitPbusOrTbus</name>
                      <description>24 bit (PBus or TBus)</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>32BitSysbus</name>
                      <description>32 bit (SysBus)</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DCPPRIORITY</name>
                  <description>Specifies the priority of DCP thread execution:</description>
                  <lsb>22</lsb>
                  <msb>22</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>LowPriorityDcpThread</name>
                      <description>Low priority DCP thread.)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HighPriorityDcpThrea</name>
                      <description>High priority DCP thread (use for realtime peripherals such as the SCP).</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MEMBSWAP</name>
                  <description>Big/little endian byte swap.If set, byte order will be reversed in all memory read/write transfers.MEM_BSWAP is applied on 24-bit GRAM or 32-bit External RAM memory accesses.MEM_BSWAP is applied on the memory word after the peripheral data to transfer has been packed, or on the memory word read from RAM before it is unpacked for transfer to the peripheral.Note : Applied to both source and destination memory transfers.</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
