ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
            <register>
              <name>BASIC1</name>
              <description>Description cluster: EDC PERIP BASIC1</description>
              <addressOffset>0x4</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ITEMS</name>
                  <description>The number of items in each DMA transfer, represented in 'natural' format (ITEMS=1 gives one transfer).The total number of items in a DMA job is (TRANSFERS * ITEMS).If transferring to/from TBus peripherals, (ITEM_BYTES+1)*ITEMS must be divisible by (PW+1)*PERIP_NUM, with any surplus being discarded, and whilst a byte mask isprovided to TBus peripherals to indicate shortfall few peripherals make use of this.Decremented by 'ITEM_BYTES+1'.Note: This register is double buffered at start of job.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>TRANSFERS</name>
                  <description>When TRANSFERS_MODE=0:The number of DMA transfers in the DMA job, represented in 'natural' format (TRANSFERS=1 specifies one transfer).TRANSFERS = 0 selects a different mode of operation -Skip the number of items defined by ITEMS, then generate one item without updating the state of the address generator.This mode is used for applying error correction to the Outer Decoder input data.When TRANSFERS_MODE=1:ITEMS[23:0] (TRANSFERS is internally fixed at 1).Note: when EOP_MODE = '10', TRANSFERS &amp;gt; 1 is not supported.</description>
                  <lsb>16</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>BASIC2</name>
              <description>Description cluster: EDC PERIP BASIC2</description>
              <addressOffset>0x8</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PA</name>
                  <description>For transfers over the non-stalling peripheral bus (SysBus or PBus), PA specifies the base peripheral address.For transfers over the stalling transfer bus (TBus), PA[13:0] selects the port ID within the following TBus read/write port selection groups:PA[15:14]=00 : Peripheral TBus write ports.PA[15:14]=01 : EDC Address Generator Offset write ports.PA[15:14]=10 : Peripheral TBus read portsNotes:1. INCR=1 produces a sequence of incrementing addressesPA, PA+1, PA+2, ...2. Address generator offset TBus write requests must be allocated to a higher priority (lower number) EDC channelthan the EDC channel address generator that they are feeding.3. Address generator offset TBus write requests EDC channel must be started before the EDC channel address generator that they are feeding.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>ECN</name>
                  <description>When TFR_MODE=000 ... 110 :EDC channel number to connect with for memory-to-memory transferNote: When linking channels using ECN the ITEMS setting for each channel must match, though TRANSFERS need not be the same.This hardware restriction arises because each transfer consists of a sequence of EDC_BURST_LENGTH byte bursts,with one final burst which carries the number of bytes required to complete the transfer.The number of bytes in the final burst of a transfer is rem(ITEMS * (ITEM_BYTES+1), EDC_BURST_LENGTH).When TFR_MODE=111 :ECN[4:3]=PW_2 : Specifies the width of the destination peripheral transfer.If transfers are being performed on the wide Tbus then parallel transfers of this width take place.00 : 8 bit(PBus or TBus)01 : 16 bit (PBus or TBus)10 : 24 bit (PBus or TBus)11 : 32 bit (SysBus)ECN[2]=PALIGN_2 : Specifies the alignment of destination peripheral data:0 : Data is right aligned1 : Data is left alignedECN[1]=INCR_2 : Specifies incrementing destination peripheral address burst mode.By default all operations to the destination peripheral are to a single register location.0 : Static destination peripheral address defined by MA.Typically used when transferring to a FIFO mapped to a single data port destination peripheral address.1 : Incrementing destination peripheral address, start address defined by MA. Typically used when transferring to a block of configuration registers.Note: Only applicable to SysBus or PBus transfers.ECN[0]=PER_BUS_2 : Selects bus for destination peripheral transfers:0 : Destination peripheral transfer is carried over the transfer bus (TBus) using hardware flow control of destination peripheral accesses.1 : Destination peripheral transfer is carried over the non-stalling peripheral bus (SysBus or PBus) using (MA + incr2Offset) as the destination peripheral address</description>
                  <lsb>16</lsb>
                  <msb>21</msb>
                </field>
                <field>
                  <name>PAEXT</name>
                  <description>Extended PA address bit.</description>
                  <lsb>22</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>BASIC3</name>
              <description>Description cluster: EDC PERIP BASIC3</description>
              <addressOffset>0xC</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MA</name>
                  <description>When TFR_MODE=000 ... 110 :Memory Address defines the base address of the memory transfers controlled by this DMA channel.The units of MA are physical RAM locations, and the physical RAM bus targetted by this DMA channel is selected by BUS_BYTES. The byte address of the memory base in the chosen RAM space is MA * BUS_BYTES.When TFR_MODE=111 :For transfers over the non-stalling peripheral bus (SysBus or PBus), MA specifies the base peripheral address.For transfers over the stalling transfer bus (TBus), MA[13:0] selects the port ID within the following TBus write port selection groups:MA[15:14]=00 : Peripheral TBus write ports.MA[15:14]=01 : EDC Address Generator Offset write ports.Notes:1. INCR=1 produces a sequence of incrementing addressesMA, MA+1, MA+2, ... (where MA is shadowed for transfer rather than current MA used by DCP)2. Address generator offset TBus write requests must be allocated to a higher priority (lower number) EDC channelthan the EDC channel address generator that they are feeding.3. Address generator offset TBus write requests EDC channel must be started before the EDC channel address generator that they are feeding.4. This register is double buffered at start of job.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AGEN4</name>
              <description>Description cluster: EDC PERIP AGEN4</description>
              <addressOffset>0x10</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>N0</name>
                  <description>Address generator N0 parameter.Use depends on selected mode:Modulo mode : modulo (0 value gives 2^16 modulo)Repeat-skip mode: number of items in one sequenceRow-column mode : number of items in one block (rows * columns)Twisted row-column mode : number of items in one burstBurst row-column mode : number of items in one burstFIFO mode : number of items in one burst (one burst for each FIFO )Run-length mode : number of items to skip after one 'run'Row-column-CD mode: number of FIFOs</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>BUSBYTES</name>
                  <description>The byte width of the memory bus targetted by the address generator.Note: this register is double buffered at start of job.</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>3BytesGlobalRamBus</name>
                      <description>3 bytes (global RAM bus)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>4BytesExternalRamBu</name>
                      <description>4 bytes (external RAM bus)</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ITEMBYTES</name>
                  <description>The number of bytes in each item of the data structure accessed by the address generator.0 : 1 byte1 : 2 bytes2 : 3 bytes3 : 4 bytesNotes:1. This must be programmed correctly even when the address generator is not in use.2. This register is double buffered at start of job.</description>
                  <lsb>17</lsb>
                  <msb>18</msb>
                </field>
                <field>
                  <name>CLRABO</name>
                  <description>Setting CLR=1 clears the internal registers a, b and o in the address generator for this channel.This register clears automatically.</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>MODE</name>
                  <description>Note: If EDC_SYS_CONFIGURATION_STATUS[0] = '0', only modulo mode is supported.</description>
                  <lsb>21</lsb>
                  <msb>23</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Modulo</name>
                      <description>modulo</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RepeatSkip</name>
                      <description>repeat-skip</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RowColumn</name>
                      <description>row-column</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TwistedRowColumn</name>
                      <description>twisted row-column</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>BurstRowColumn</name>
                      <description>burst row-column</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Fifo</name>
                      <description>FIFO</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RunLength</name>
                      <description>run-length</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RowColCd</name>
                      <description>row-col-cd</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>AGEN5</name>
              <description>Description cluster: EDC PERIP AGEN5</description>
              <addressOffset>0x14</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>N1</name>
                  <description>Address generator N1 parameter.Use depends on EDC_SYS_CONFIGURATION_STATUS register and OFFSET_ADD field of EDC_PERIP_JOB0 register:If EDC_SYS_CONFIGURATION_STATUS[1] = '1' and OFFSET_ADD = '1' then only 10 LSBs are used and it represents the LUT read pointer. Automatically incremented. When LUT are used, address generator increment is not needed.Else use depends on selected mode:Modulo mode : increment per itemRepeat-skip mode: number of repeats of each sequenceRow-column mode : number of rowsTwisted row-column mode : number of rowsBurst row-column mode : number of rowsFIFO mode : number of FIFOsRun-length mode : unusedRow-column-CD mode: rem((d1-d0) * numFifos + buffLen, buffLen), where d0 is the delay of FIFO 0 and d1 is the delay of FIFO 1, both measured in itemsNotes:1. If EDC_SYS_CONFIGURATION_STATUS[1] = '1', this register is double buffered (only 10 LSBs) at start of job, to allow reconfiguration of LUT read pointer while job is still active.2. If EDC_SYS_CONFIGURATION_STATUS[1:0] = '00', this register is not present and the increment per item if fixed to 1.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AGEN6</name>
              <description>Description cluster: EDC PERIP AGEN6</description>
              <addressOffset>0x18</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>N2</name>
                  <description>Address generator N2 parameter.Use depends on selected mode:Modulo mode : if AGEN_STATE_B[0]=0, start index (must be in the range 0 to N0-1), else unusedRepeat-skip mode: number of items from the start of one sequence to the start of the next sequenceRow-column mode : number of items in the set of blocks (rows * columns * blocks)Twisted row-column mode : number of items in one block(rows * columns)Burst row-column mode : number of items in one block minus number of items in one burst(rows * columns - N0)FIFO mode : number of items in the whole FIFO structureRun-length mode : unusedRow-column-CD mode: number of items in the CD buffer.Note: N2 must be an integer multiple of abs(d1-d0) * numFifos, where d0 is the delay of FIFO 0 and d1 is the delay of FIFO 1, both measured in itemsIf OFFSET_ADD is in use and EDC_SYS_CONFIGURATION_STATUS[1] = '1', N2 can be set to enforce a modulo on the LUT read pointer.Notes:1. This register is double buffered at start of job.2. If EDC_SYS_CONFIGURATION_STATUS[0] = '0', only 16 LSBs are used.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AGEN7</name>
              <description>Description cluster: EDC PERIP AGEN7</description>
              <addressOffset>0x1C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LP0</name>
                  <description>FIFO mode: maxItems - the maximum number of items in a paired bufferNote: If read ITEMS is not equal to write ITEMS then LP0 must be &amp;gt;= 2 * EDC_BURST_LENGTHBLOCK mode : itemsPerBlock - the number of items in a block</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>LP1</name>
                  <description>FIFO mode: not usedBLOCK mode : maxBlocks - the maximum number of blocks in a paired buffer</description>
                  <lsb>16</lsb>
                  <msb>21</msb>
                </field>
                <field>
                  <name>LINKMODE</name>
                  <description>Controls pairing of even numbered write channel 'N' and odd numbered read channel 'N+1':00 : Pairing disabled01 : Pair using FIFO mode10 : Pair using BLOCK mode11 : reservedNotes:1. Linked channels must have the same ITEM_BYTES configuration.2. LINK_MODE must be disabled on channels with EXT_RAM_READ_AHEAD set to 1(but can be set on channels ECN linked to these that have EXT_RAM_READ_AHEAD set to 0).3. Changing LINK_MODE setting causes read and write buffer counts to be reset.4. If EDC_SYS_CONFIGURATION_STATUS[0] = '0', the pairing is not supported.</description>
                  <lsb>22</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>64</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>EDCPERIPCTXTREGS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_PERIP_EDCPERIPCTXTREGS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x800</addressOffset>
            <register>
              <name>AGENCONTEXT0</name>
              <description>Description cluster: EDC PERIP AGEN CONTEXT0</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AGENSTATEA</name>
                  <description>Address generator A variable.If this register is loaded by the DCP then it should be fenced using LDBASIC/LDFULL before the RUN instruction.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AGENCONTEXT1</name>
              <description>Description cluster: EDC PERIP AGEN CONTEXT1</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AGENSTATEB</name>
                  <description>Address generator B variable.If MODE=0 (modulo mode) AGEN_STATE_B[0]=1 causes N2 to be substituted with offsets fed from another channel.If AGEN_STATE_B[0]=1, N1 must be different than 1 to prevent linear mode logic to be enabled, since it does not support offset addition.If this register is loaded by the DCP then it should be fenced using LDBASIC/LDFULL before the RUN instruction.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AGENCONTEXT2</name>
              <description>Description cluster: EDC PERIP AGEN CONTEXT2</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AGENSTATEO</name>
                  <description>Address generator O variable.If this register is loaded by the DCP then it should be fenced using LDBASIC/LDFULL before the RUN instruction.</description>
                  <lsb>0</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Description cluster: EDC PERIP STATUS</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ITEMSLEFT</name>
                  <description>The number of items remaining in each DMA transfer, represented in 'natural' format.Note: This is updated to represent the number of items completed when a job completes for EOP_MODE=10.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>TRANSFERSLEFT</name>
                  <description>When TRANSFERS_MODE=0:The number of DMA transfers remaining in the DMA job, represented in 'natural' format.When TRANSFERS_MODE=1:ITEMS_LEFT[23:0].</description>
                  <lsb>16</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>EDCGPIO0OUT</name>
            <description>EDC GPIO0 OUT</description>
            <addressOffset>0xC00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPIO0OUT</name>
                <description>Value output on bits 15:0 of UCCP top level GPIO_OUT pins.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCGPIO1OUT</name>
            <description>EDC GPIO1 OUT</description>
            <addressOffset>0xC04</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPIO1OUT</name>
                <description>Value output on bits 31:16 of UCCP top level GPIO_OUT pins.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCGPIO0IN</name>
            <description>EDC GPIO0 IN</description>
            <addressOffset>0xC08</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPIO0IN</name>
                <description>Value input on bits 15:0 of UCCP top level GPIO_IN pins.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCGPIO1IN</name>
            <description>EDC GPIO1 IN</description>
            <addressOffset>0xC0C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPIO1IN</name>
                <description>Value input on bits 31:16 of UCCP top level GPIO_IN pins.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
