ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>TBUSRSTCTRL</name>
            <description>EDC PERIP TBUS RST CTRL</description>
            <addressOffset>0xC10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESETTBUSID</name>
                <description>Port ID of TBus to reset.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>RESETOFFSETUNPACKER</name>
                <description>Reset Address Generator Offset unpacker.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>RESETTBUSWRUNPACKER</name>
                <description>Reset TBus write unpacker.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>RESETTBUSRDPACKER</name>
                <description>Reset TBus read packer.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>RESETTBUSRDPORT</name>
                <description>Reset TBus read port data held for next transfer.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERFCTRL</name>
            <description>EDC PERIP PERF CTRL</description>
            <addressOffset>0xC14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMREADAHEAD</name>
                <description>0 : Do not read-ahead from ExtRAM (appropriate setting for multi-channel ExtRAM reads).1 : Read-ahead from ExtRAM (appropriate setting for single-channel ExtRAM reads or multi-channel only where each channel has a unique EXT_RAM_ID in range 0 to EDC_EXT_RAM_REQS-1).For use in high read latency ExtRAM systems, should not be used in low latency ExtRAM systems as can reduce performance due to additional destination address generation latency.When enabled, address generator modes that make use of offsets (run-length, twisted-row-col, FIFO) are not supported for ExtRAM or GRAM TFR_MODE=4 destination transfer from an ExtRAM source TFR_MODE=1 transfer.ExtRAM-to-ExtRAM transfers are not supported when enabled.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCSCPCTRL</name>
            <description>EDC SCP CTRL</description>
            <addressOffset>0xC18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EDCSCPKICK</name>
                <description>EDC_SCP_KICK[n]=1 causes update of SET_ADC_POWER/SET_SCP_POWER/NEW_ADC_POWER/NEW_SCP_POWER/INPUT_I/INPUT_Q registers within SCP[n] when SCP_CONTROL2[n].SCP_KICK_ENABLE=1.Register auto-clears.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCDCPBASEADDR</name>
            <description>EDC DCP BASE ADDR</description>
            <addressOffset>0xC1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DCPBASEADDR</name>
                <description>Base address of combined DCP code image (for use by debugger).</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANRXCTRL</name>
            <description>EDC PERIP WLAN RX CTRL</description>
            <addressOffset>0xC20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANRXFINAL</name>
                <description>Set to flag last Rx Job before posting final SCP input transfer.Must be cleared following completion of SCP input job.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANTXCTRL</name>
            <description>EDC PERIP WLAN TX CTRL</description>
            <addressOffset>0xC24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTXFINAL</name>
                <description>Set to flag last Tx Job before posting final TX-SCP output transfer.Must be cleared following completion of TX-SCP output job.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBS0</name>
            <description>EDC PERIP MEM ADDR MSBS0</description>
            <addressOffset>0xC2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID0ADDRMSBS</name>
                <description>Defines bits 37:23 of ExtRAM request ID 0 word address (bits 39:25 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBS1</name>
            <description>EDC PERIP MEM ADDR MSBS1</description>
            <addressOffset>0xC30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID1ADDRMSBS</name>
                <description>Defines bits 37:23 of ExtRAM request ID 1 word address (bits 39:25 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBS2</name>
            <description>EDC PERIP MEM ADDR MSBS2</description>
            <addressOffset>0xC34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID2ADDRMSBS</name>
                <description>Defines bits 37:23 of ExtRAM request ID 2 word address (bits 39:25 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBS3</name>
            <description>EDC PERIP MEM ADDR MSBS3</description>
            <addressOffset>0xC38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID3ADDRMSBS</name>
                <description>Defines bits 37:23 of ExtRAM request ID 3 word address (bits 39:25 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBSEXT0</name>
            <description>EDC PERIP MEM ADDR MSBS EXT0</description>
            <addressOffset>0xC3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID0ADDRMSBSEXT</name>
                <description>Defines bits 61:38 of ExtRAM request ID 0 word address (bits 63:40 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBSEXT1</name>
            <description>EDC PERIP MEM ADDR MSBS EXT1</description>
            <addressOffset>0xC40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID1ADDRMSBSEXT</name>
                <description>Defines bits 61:38 of ExtRAM request ID 1 word address (bits 63:40 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBSEXT2</name>
            <description>EDC PERIP MEM ADDR MSBS EXT2</description>
            <addressOffset>0xC44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID2ADDRMSBSEXT</name>
                <description>Defines bits 61:38 of ExtRAM request ID 2 word address (bits 63:40 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MEMADDRMSBSEXT3</name>
            <description>EDC PERIP MEM ADDR MSBS EXT3</description>
            <addressOffset>0xC48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID3ADDRMSBSEXT</name>
                <description>Defines bits 61:38 of ExtRAM request ID 3 word address (bits 63:40 of the byte address).Note if greater than 64MBytes ExtRAM supported, MA[23] must be set to 0 and the lsb of this register used instead.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>JOB0[%s]</name>
            <description>Description collection: EDC PERIP JOB0</description>
            <addressOffset>0xD00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXTRAMID</name>
                <description>ExtRAM request ID used for ExtRAM transfers on this channel.Note: DCP uses ID of 0 for instruction fetch and loads/stores.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FORCEFLEXIBLEAGEN</name>
                <description>Note: if EDC_SYS_CONFIGURATION_STATUS[0] = '0', this register is notpresent.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DoNotUseFlexibleAddr</name>
                    <description>Do not use flexible address generator when linear mode is configured.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForceUsageOfFlexible</name>
                    <description>Force usage of flexible address generator (over linear address generator) even if linear mode is configured.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFFSETINCR</name>
                <description>Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[1] = '1'.</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AdvanceOffsetEveryGr</name>
                    <description>Advance offset every GRAM access.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AdvanceOffsetEvery2G</name>
                    <description>Advance offset every 2 GRAM accesses.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AdvanceOffsetEvery4G</name>
                    <description>Advance offset every 4 GRAM accesses.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AdvanceOffsetEvery8G</name>
                    <description>Advance offset every 8 GRAM accesses.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFFSETADD</name>
                <description>0: Disable addition of offsets to GRAM addresses.1: Enable addition of offsets to GRAM addresses.Notes:1. This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[1] = '1'.2. Only ITEM_BYTES = '10' is supported.3. Modulo wrap of item index is not supported.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>OFFSETDELTA</name>
                <description>Defines the delta to be added to MA in case of GRAM accesses with OFFSET_ADD = 1 and OFFSET_INCR &amp;gt; 0.Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[1] = '1'.</description>
                <lsb>7</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>HOLDOFFSAT</name>
                <description>Indicates that the transfer hold-off FINE_RATE accumulator has saturated.Automatically cleared at start of next DMA job.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>FLAGDONETIMING</name>
                <description>Note: Channel DISCARD_OP/PW/PALIGN settings cannot be changed safely following completion of a TBus write job when FLAG_DONE_EARLY=1 because these are used following the output buffer.</description>
                <lsb>22</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FlagCompletionOfTbus</name>
                    <description>Flag completion of TBus write job on output to peripheral.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FlagCompletionOfTbus1</name>
                    <description>Flag completion of TBus write job on write to output buffer, providing additional time to configure subsequent jobs for realtime output peripherals (e.g. DAC, TSO).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FlagCompletionOfTran</name>
                    <description>Flag completion of transfer to ExtRAM/GRAM/PBus/SysBus only once final store has reached destination.This could impact performance.Not supported for write to EDC channel or write to TBus transfer modes (TFR_MODE=001,011,110 or TFR_MODE=000,101,111 &amp;amp;&amp;amp; PER_BUS=0).</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCOFFSETLUTADDR</name>
            <description>EDC OFFSET LUT ADDR</description>
            <addressOffset>0xE00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETLUTADDR</name>
                <description>Offset lookup table address. Automatically incremented when all the entries (number of entries per location = GRAM_REQS-1) at the same address have been written.Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[2] = '1'.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCOFFSETLUTDATA</name>
            <description>EDC OFFSET LUT DATA</description>
            <addressOffset>0xE04</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETLUTDATA</name>
                <description>Offset lookup table value to be written into the offset LUT.Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[2] = '1'.</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCOFFSETADJLUTADDR</name>
            <description>EDC OFFSET ADJ LUT ADDR</description>
            <addressOffset>0xE08</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETADJLUTADDR</name>
                <description>Offset adjustment lookup table address. Automatically incremented.Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[2] = '1'.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCOFFSETADJLUTDATA</name>
            <description>EDC OFFSET ADJ LUT DATA</description>
            <addressOffset>0xE0C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETADJLUTDATA</name>
                <description>Offset adjustment lookup table value to be written into the offset adjustment LUT.Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[2] = '1'.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCOFFSETADJLUTCTRL</name>
            <description>EDC OFFSET ADJ LUT CTRL</description>
            <addressOffset>0xE10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSETADJENABLE</name>
                <description>Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[2] = '1'.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableAdditionOfOff</name>
                    <description>Disable addition of offset adjustments to GRAM addresses.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableAdditionOfOffs</name>
                    <description>Enable addition of offset adjustments to GRAM addresses.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFFSETADJCHANNEL</name>
                <description>Select which EDC channel the offset adjustments are applied to.Note: Selected EDC channel must be configured for offset addressing OFFSET_ADD=1.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>OFFSETADJMULFACTOR</name>
                <description>Defines the multiplication factor used for the offset adjustments.Note: This feature can be used only if EDC_SYS_CONFIGURATION_STATUS[2] = '1'.</description>
                <lsb>12</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
