ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>L4CHECKSUMCTRL[%s]</name>
            <description>Description collection: EDC PERIP L4 CHECKSUM CTRL</description>
            <addressOffset>0xE40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>L4CSUMBLOCKENABLE</name>
                <description>Enable signal for L4 checksum block:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumBlockDisab</name>
                    <description>L4 checksum block disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L3ChecksumBlockEnabl</name>
                    <description>L3 checksum block enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L3CSUMENABLE</name>
                <description>Enable signal for L3 checksum calculation in case of IPV4 ethernet type:</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L3ChecksumCalculatio</name>
                    <description>L3 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L3ChecksumCalculatio1</name>
                    <description>L3 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L4CSUMIPV4TCPENABLE</name>
                <description>Enable signal for L4 checksum calculation in case of IPV4 ethernet type and TCP protocol:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio</name>
                    <description>L4 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio1</name>
                    <description>L4 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L4CSUMIPV4UDPENABLE</name>
                <description>Enable signal for L4 checksum calculation in case of IPV4 ethernet type and UDP protocol:</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio</name>
                    <description>L4 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio1</name>
                    <description>L4 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L4CSUMIPV6TCPENABLE</name>
                <description>Enable signal for L4 checksum calculation in case of IPV6 ethernet type and TCP protocol:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio</name>
                    <description>L4 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio1</name>
                    <description>L4 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L4CSUMIPV6UDPENABLE</name>
                <description>Enable signal for L4 checksum calculation in case of IPV6 ethernet type and UDP protocol:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio</name>
                    <description>L4 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio1</name>
                    <description>L4 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CSUMOP</name>
                <description>L4 checksum operation:0:TX operation. L3 and L4 checksums are calculated,1:RX operation. L3 and L4 checksums are calculated and compared with thecorresponding received checksum values.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>MACHEADERLENGTH</name>
                <description>MAC header length in bytes.This is the number of bytes at the start of packet that are skipped and notincluded in the L4 checksum calulation.Note: only even values for MAC header lengths are supported.</description>
                <lsb>7</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>EDCCHANNELSELECT</name>
                <description>EDC channel select.Selects the EDC channel connected to L4 checksum instance.</description>
                <lsb>15</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>L4CSUMIPV6ICMPENABLE</name>
                <description>Enable signal for L4 checksum calculation in case of IPV6 ethernet type and ICMP protocol:</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio</name>
                    <description>L4 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio1</name>
                    <description>L4 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L4CSUMIPV4ICMPENABLE</name>
                <description>Enable signal for L4 checksum calculation in case of IPV4 ethernet type and ICMP protocol:</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio</name>
                    <description>L4 checksum calculation disabled,</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L4ChecksumCalculatio1</name>
                    <description>L4 checksum calculation enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x00C</dimIncrement>
            <name>EDCPERIPL4CHECKSUMSTATUS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_PERIP_EDCPERIPL4CHECKSUMSTATUS</headerStructName>
            <access>read-write</access>
            <addressOffset>0xE50</addressOffset>
            <register>
              <name>L3CHECKSUMTX</name>
              <description>Description cluster: EDC PERIP L3 CHECKSUM TX</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x0000FFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3CHECKSUMTX</name>
                  <description>Calculated L3 checksum.Note: L3 checksum is calculated only for IPV4 ethernet type.This register will hold calculated L3 checksum value for both operations TX and RX andit will be cleared at the start of every new packet.Note: This field should be read once the TX_CHECKSUM_VALID flag is asserted in TX operation.In RX operation this value can be used for debug and checked after RX_CHECKSUM_VALID flag assertion.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>L3CHECKSUMTXOFFSET</name>
                  <description>L3 checksum TX offset.This field gives the information on offset of L3 checksum within the packet.</description>
                  <lsb>16</lsb>
                  <msb>20</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMTX</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM TX</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x0000FFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L4CHECKSUMTX</name>
                  <description>Calculated L4 checksum.This field will hold calculated L4 checksum value for both operations TX and RXand it will be cleared at the start of every new packet.Note: This field should be read once the TX_CHECKSUM_VALID flag is asserted in TX operation.In RX operation this value can be used for debug and checked after RX_CHECKSUM_VALID flag assertion.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>L4CHECKSUMTXOFFSET</name>
                  <description>L4 checksum TX offset.This field gives the information on offset of L4 checksum within the packet.</description>
                  <lsb>16</lsb>
                  <msb>22</msb>
                </field>
                <field>
                  <name>TXCHECKSUMVALID</name>
                  <description>TX checksum valid flag.This bit gets set once the L4 checksum calculation for TX operation is completedand it will be cleared at the start of every new packet.</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMTXRXSTATUS</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM TX RX STATUS</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXCHECKSUMSTATUS</name>
                  <description>RX checksum status flag.Note: This bit should be checked once the RX_CHECKSUM_VALID flag is asserted.It will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FailCalculatedL4Che</name>
                      <description>FAIL - Calculated L4 checksum and L4 checksum extracted from packet header are mismatching,</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PassCalculatedL4Che</name>
                      <description>PASS - Calculated L4 checksum and L4 checksum extracted from packet header are matching.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CHECKSUMINFO</name>
                  <description>TX_RX checksum info flag.Note: This bit is used for both TX and RX operation.It will be cleared at the start of every new packet.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>CalculationOfL4Check</name>
                      <description>Calculation of L4 checksum was skipped,</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>L4ChecksumCalculated</name>
                      <description>L4 checksum calculated and was not skipped.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXCHECKSUMVALID</name>
                  <description>RX checksum valid flag.This bit gets set once the L4 checksum calculation for RX operation is completedand L4 checksum status is ready. It will be cleared at the start of every new packet.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>EDCPERIPL4CHECKSUMDEBUG[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_PERIP_EDCPERIPL4CHECKSUMDEBUG</headerStructName>
            <access>read-write</access>
            <addressOffset>0xE90</addressOffset>
            <register>
              <name>L4CHECKSUMDEBUG0</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DEBUG0</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRCHECKSUM</name>
                  <description>L3 checksum extracted from the packet.This field will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDEBUG1</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DEBUG1</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L4HDRCHECKSUM</name>
                  <description>L4 checksum extracted from the packet.This field will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDEBUG2</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DEBUG2</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ETHERNETTYPE</name>
                  <description>Ethernet type information extracted from the packet.This field will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>L3HDRVERSION</name>
                  <description>Protocol Version extracted from the packet.This field will be cleared at the start of every new packet.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>L3HDRLENGTH</name>
                  <description>Length of the IP header in 32 bit words extracted from the packet.For example value 5 means 5*4 = 20 bytes.This field will be cleared at the start of every new packet.</description>
                  <lsb>20</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDEBUG3</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DEBUG3</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRTOTALLENGTH</name>
                  <description>Total length of packet in bytes extracted from the packet.Note: In case of IPV4 ethernet type this field is the sum of the IP header lengthL3_HDR_LENGTH and the IP payload length.In case of IPV6 ethernet type this field represents the IP payload length only.This field will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>L3HDRPROTOCOL</name>
                  <description>Transport layer protocol information extracted from the packet.This field will be cleared at the start of every new packet.</description>
                  <lsb>16</lsb>
                  <msb>23</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x040</dimIncrement>
            <name>EDCPERIPL4CHECKSUMSRCDESTADDRESS[%s]</name>
            <description>Unspecified</description>
            <headerStructName>RPUPBUS_EDC_PERIP_EDCPERIPL4CHECKSUMSRCDESTADDRESS</headerStructName>
            <access>read-write</access>
            <addressOffset>0xF00</addressOffset>
            <register>
              <name>L4CHECKSUMSRCADDR0LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR0 LSH</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR0LSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents least significant 16 bits of first 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMSRCADDR0MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR0 MSH</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR0MSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents most significant 16 bits of first 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMSRCADDR1LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR1 LSH</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR1LSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents least significant 16 bits of second 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMSRCADDR1MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR1 MSH</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR1MSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents most significant 16 bits of second 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMSRCADDR2LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR2 LSH</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR2LSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents least significant 16 bits of third 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
