ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
            <register>
              <name>L4CHECKSUMSRCADDR2MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR2 MSH</description>
              <addressOffset>0x014</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR2MSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents most significant 16 bits of third 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMSRCADDR3LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR3 LSH</description>
              <addressOffset>0x018</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR3LSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents least significant 16 bits of fourth 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMSRCADDR3MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM SRC ADDR3 MSH</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRSRCADDR3MSH</name>
                  <description>Part of the Source Address field extracted from the packet.This field represents most significant 16 bits of fourth 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR0LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR0 LSH</description>
              <addressOffset>0x020</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR0LSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents least significant 16 bits of first 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR0MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR0 MSH</description>
              <addressOffset>0x024</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR0MSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents most significant 16 bits of first 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR1LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR1 LSH</description>
              <addressOffset>0x028</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR1LSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents least significant 16 bits of second 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR1MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR1 MSH</description>
              <addressOffset>0x02C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR1MSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents most significant 16 bits of second 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR2LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR2 LSH</description>
              <addressOffset>0x030</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR2LSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents least significant 16 bits of third 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR2MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR2 MSH</description>
              <addressOffset>0x034</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR2MSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents most significant 16 bits of third 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR3LSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR3 LSH</description>
              <addressOffset>0x038</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR3LSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents least significant 16 bits of fourth 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>L4CHECKSUMDSTADDR3MSH</name>
              <description>Description cluster: EDC PERIP L4 CHECKSUM DST ADDR3 MSH</description>
              <addressOffset>0x03C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>L3HDRDSTADDR3MSH</name>
                  <description>Part of the Destination Address field extracted from the packet.This field represents most significant 16 bits of fourth 32 bit word andit will be cleared at the start of every new packet.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>WLAN_TIMERS</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_WLAN_TIMERS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1A000</addressOffset>
          <register>
            <name>INTSTATUS</name>
            <description>WLAN TIMERS INT STATUS</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTIMERSINTSTATUSMSK</name>
                <description>General purpose masked interrupt status register.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTIMERSINTSTATUSRAW</name>
                <description>General purpose raw interrupt status register.</description>
                <lsb>12</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTEN</name>
            <description>WLAN TIMERS INT EN</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTIMERSINTENMSK</name>
                <description>General purpose masked interrupt enable register.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTIMERSINTENRAW</name>
                <description>General purpose raw interrupt enable register.</description>
                <lsb>12</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTCLEAR</name>
            <description>WLAN TIMERS INT CLEAR</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTIMERSINTCLEARMSK</name>
                <description>General purpose masked interrupt clear register.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>WLANTIMERSINTCLEARRAW</name>
                <description>General purpose raw interrupt clear register.</description>
                <lsb>12</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL</name>
            <description>WLAN TIMERS CTRL</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOFTRESET</name>
                <description>Timers core soft reset.This bit is used to reset everything but the control registers.The soft reset should be applied after reprogramming the control registers and setting TIMERS_ENABLE.0: De-assert reset to core1: Assert reset to core</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERSENABLE</name>
                <description>Timers module enable/disable.0: Disable1: Enable</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DIVIDER</name>
            <description>WLAN TIMERS DIVIDER</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040027</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DIVIDERMICROSEC</name>
                <description>Timers microsecond divider.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DIVIDERMILLISEC</name>
                <description>Timers millisecond divider.NOTE: In the current implementation, when the milli second counter has reached the value 0x1,and the micro second counter has reached 0x0, then on the occurence of the enxt 40MHz clock pulsethe milli second counter is initialised to the DIVIDER_MILLI_SEC field value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM0</name>
            <description>WLAN TIMERS TIM0</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER0</name>
                <description>Timer 0 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM0</name>
            <description>WLAN TIMERS CUR TIM0</description>
            <addressOffset>0x24</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER0</name>
                <description>Current timer 0 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR0</name>
            <description>WLAN TIMERS CTR0</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE0</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE0</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK0</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES0</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM1</name>
            <description>WLAN TIMERS TIM1</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER1</name>
                <description>Timer 1 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM1</name>
            <description>WLAN TIMERS CUR TIM1</description>
            <addressOffset>0x34</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER1</name>
                <description>Current timer 1 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR1</name>
            <description>WLAN TIMERS CTR1</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE1</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE1</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK1</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES1</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM2</name>
            <description>WLAN TIMERS TIM2</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER2</name>
                <description>Timer 2 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM2</name>
            <description>WLAN TIMERS CUR TIM2</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER2</name>
                <description>Current timer 2 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR2</name>
            <description>WLAN TIMERS CTR2</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE2</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE2</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK2</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES2</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM3</name>
            <description>WLAN TIMERS TIM3</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER3</name>
                <description>Timer 3 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM3</name>
            <description>WLAN TIMERS CUR TIM3</description>
            <addressOffset>0x54</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER3</name>
                <description>Current timer 3 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
