ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CTR3</name>
            <description>WLAN TIMERS CTR3</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE3</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE3</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK3</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES3</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM4</name>
            <description>WLAN TIMERS TIM4</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER4</name>
                <description>Timer 4 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM4</name>
            <description>WLAN TIMERS CUR TIM4</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER4</name>
                <description>Current timer 4 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR4</name>
            <description>WLAN TIMERS CTR4</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE4</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE4</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK4</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES4</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM5</name>
            <description>WLAN TIMERS TIM5</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER5</name>
                <description>Timer 5 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM5</name>
            <description>WLAN TIMERS CUR TIM5</description>
            <addressOffset>0x74</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER5</name>
                <description>Current timer 5 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR5</name>
            <description>WLAN TIMERS CTR5</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE5</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE5</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK5</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES5</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM64LSB</name>
            <description>WLAN TIMERS TIM64 LSB</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER230</name>
                <description>TSF Timer register for the 32 least significant bits.Write: Initial timer value, lower 32-bits.Read:Current timer value, lower 32-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM64MIDSB</name>
            <description>WLAN TIMERS TIM64 MIDSB</description>
            <addressOffset>0x84</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER4724</name>
                <description>TSF Timer register for the 32 middle significant bits.Write: Initial timer value, middle 32-bits.Read:Current timer value, middle 32-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM64MSB</name>
            <description>WLAN TIMERS TIM64 MSB</description>
            <addressOffset>0x88</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER6348</name>
                <description>TSF Timer register for the 16 most significant bits.Write: Initial timer value, higher 32-bits.Read:Current timer value, higher 32-bits.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM64CTRL</name>
            <description>WLAN TIMERS TIM64 CTRL</description>
            <addressOffset>0x8C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable timer. 0: Disabled 1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LOADTIMER</name>
                <description>Write '1' to load timer with initial value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>READCURRENT</name>
                <description>Write '1' to update current timer value in WLAN_TIMERS_TIM64_MSB, WLAN_TIMERS_TIM64_MIDSB and WLAN_TIMERS_TIM64_LSB registers.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DEBUGREADCURRENT</name>
                <description>For Debugging purposes.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FunctionalityDisable</name>
                    <description>Functionality disabled (default value)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EveryClockCycleReadB</name>
                    <description>Every clock cycle read back the current value of the TSF timer.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM641LSB</name>
            <description>WLAN TIMERS TIM64 1 LSB</description>
            <addressOffset>0x90</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER1230</name>
                <description>TSF1 Timer register for the 24 least significant bits.Write: Initial timer value, lower 24-bits.Read:Current timer value, lower 24-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM641MIDSB</name>
            <description>WLAN TIMERS TIM64 1 MIDSB</description>
            <addressOffset>0x94</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER14724</name>
                <description>TSF1 Timer register for the 24 middle significant bits.Write: Initial timer value, middle 24-bits.Read:Current timer value, middle 24-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM641MSB</name>
            <description>WLAN TIMERS TIM64 1 MSB</description>
            <addressOffset>0x98</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER16348</name>
                <description>TSF1 Timer register for the 16 most significant bits.Write: Initial timer value, higher 16-bits.Read:Current timer value, higher 16-bits.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM641CTRL</name>
            <description>WLAN TIMERS TIM64 1 CTRL</description>
            <addressOffset>0x9C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TSF1ENABLE</name>
                <description>Enable timer. 0: Disabled 1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TSF1LOADTIMER</name>
                <description>Write '1' to load timer with initial value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TSF1READCURRENT</name>
                <description>Write '1' to update current timer value in WLAN_TIMERS_TIM64_1_MSB, WLAN_TIMERS_TIM64_1_MIDSB and WLAN_TIMERS_TIM64_1_LSB registers.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TSF1DEBUGREADCURRENT</name>
                <description>For Debugging purposes.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FunctionalityDisable</name>
                    <description>Functionality disabled (default value)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EveryClockCycleReadB</name>
                    <description>Every clock cycle read back the current value of the TSF1 timer.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKDIV</name>
            <description>WLAN TIMERS CLK DIV</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x000A5000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLKDIVM</name>
                <description>The frequency of the clock source for the milli/micro-second clock divider is F x N / M = 40MHz, where F is the core clock frequency. Can only act as a divider, not as a multiplier, and the ratio N/M must be less than or equal to 1/2.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CLKDIVN</name>
                <description>The frequency of the clock source for the milli/micro-second clock divider is F x N / M = 40MHz, where F is the core clock frequency. Can only act as a divider, not as a multiplier, and the ratio N/M must be less than or equal to 1/2.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM6</name>
            <description>WLAN TIMERS TIM6</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER6</name>
                <description>Timer 6 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM6</name>
            <description>WLAN TIMERS CUR TIM6</description>
            <addressOffset>0x104</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER6</name>
                <description>Current timer 6 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR6</name>
            <description>WLAN TIMERS CTR6</description>
            <addressOffset>0x108</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE6</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE6</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK6</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES6</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM7</name>
            <description>WLAN TIMERS TIM7</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER7</name>
                <description>Timer 7 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM7</name>
            <description>WLAN TIMERS CUR TIM7</description>
            <addressOffset>0x114</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER7</name>
                <description>Current timer 7 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR7</name>
            <description>WLAN TIMERS CTR7</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE7</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE7</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK7</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES7</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM8</name>
            <description>WLAN TIMERS TIM8</description>
            <addressOffset>0x120</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER8</name>
                <description>Timer 8 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM8</name>
            <description>WLAN TIMERS CUR TIM8</description>
            <addressOffset>0x124</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER8</name>
                <description>Current timer 8 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR8</name>
            <description>WLAN TIMERS CTR8</description>
            <addressOffset>0x128</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE8</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE8</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK8</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES8</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
