ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>TIM9</name>
            <description>WLAN TIMERS TIM9</description>
            <addressOffset>0x130</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER9</name>
                <description>Timer 9 initial value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURTIM9</name>
            <description>WLAN TIMERS CUR TIM9</description>
            <addressOffset>0x134</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER9</name>
                <description>Current timer 9 value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR9</name>
            <description>WLAN TIMERS CTR9</description>
            <addressOffset>0x138</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE9</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODE9</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASK9</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RES9</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANPSMPTIMERTIM</name>
            <description>WLAN PSMP TIMER TIM</description>
            <addressOffset>0x140</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TARGETPSMPTIME</name>
                <description>PSMP Timer timeout value, 24-bit. PSMP timer generates interrupt on reaching this value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANPSMPTIMERCUR</name>
            <description>WLAN PSMP TIMER CUR</description>
            <addressOffset>0x144</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PSMPCURTIME</name>
                <description>Current timer value, 24-bit.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANPSMPTIMERCTRL</name>
            <description>WLAN PSMP TIMER CTRL</description>
            <addressOffset>0x148</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLEPSMP</name>
                <description>Enable timer.** NOTE: After reset, Enable_timer bit will be cleared. Thus timer will not be enabled.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTMASKPSMP</name>
                <description>Interrupt Mask0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RESPSMP</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RESETPSMPTIMER</name>
                <description>Reset timer.** NOTE: After reset, Reset_enable bit will be set. Thus timer will be in reset mode.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDisable</name>
                    <description>Reset disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetEnableTimerWil</name>
                    <description>Reset enable,Timer will be in reset mode , header decoded signal will be ignored.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANPSMPTIMERINITIALVALUE</name>
            <description>WLAN PSMP TIMER INITIAL VALUE</description>
            <addressOffset>0x14C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PSMPINITVALUE</name>
                <description>A write to this register loads the initial Load value into the PSMP timer.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PRIMCCA20ELAPSEDTIME</name>
            <description>WLAN TIMERS PRIM CCA20 ELAPSED TIME</description>
            <addressOffset>0x150</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PRIMCCA20ELAPSEDTIME</name>
                <description>This field returns the latched value of the delta timer on the falling edge ofthe primary 20 CCA signal.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SECCCA20ELAPSEDTIME</name>
            <description>WLAN TIMERS SEC CCA20 ELAPSED TIME</description>
            <addressOffset>0x154</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SECCCA20ELAPSEDTIME</name>
                <description>This field returns the latched value of the delta timer on the falling edge ofthe secondary 20 CCA signal.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SECCCA40ELAPSEDTIME</name>
            <description>WLAN TIMERS SEC CCA40 ELAPSED TIME</description>
            <addressOffset>0x158</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SECCCA40ELAPSEDTIME</name>
                <description>This field returns the latched value of the delta timer on the falling edge ofthe secondary 40 CCA signal.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM642LSB</name>
            <description>WLAN TIMERS TIM64 2 LSB</description>
            <addressOffset>0x15C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER2230</name>
                <description>TSF2 Timer register for the 24 least significant bits.Write: Initial timer value, lower 24-bits.Read:Current timer value, lower 24-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM642MIDSB</name>
            <description>WLAN TIMERS TIM64 2 MIDSB</description>
            <addressOffset>0x160</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER24724</name>
                <description>TSF2 Timer register for the 24 middle significant bits.Write: Initial timer value, middle 24-bits.Read:Current timer value, middle 24-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM642MSB</name>
            <description>WLAN TIMERS TIM64 2 MSB</description>
            <addressOffset>0x164</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER26348</name>
                <description>TSF2 Timer register for the 16 most significant bits.Write: Initial timer value, higher 16-bits.Read:Current timer value, higher 16-bits.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM642CTRL</name>
            <description>WLAN TIMERS TIM64 2 CTRL</description>
            <addressOffset>0x168</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TSF2ENABLE</name>
                <description>Enable timer. 0: Disabled 1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TSF2LOADTIMER</name>
                <description>Write '1' to load timer with initial value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TSF2READCURRENT</name>
                <description>Write '1' to update current timer value in WLAN_TIMERS_TIM64_2_MSB, WLAN_TIMERS_TIM64_2_MIDSB and WLAN_TIMERS_TIM64_2_LSB registers.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TSF2DEBUGREADCURRENT</name>
                <description>For Debugging purposes.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FunctionalityDisable</name>
                    <description>Functionality disabled (default value)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EveryClockCycleReadB</name>
                    <description>Every clock cycle read back the current value of the TSF2 timer.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM643LSB</name>
            <description>WLAN TIMERS TIM64 3 LSB</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER3230</name>
                <description>TSF3 Timer register for the 24 least significant bits.Write: Initial timer value, lower 24-bits.Read:Current timer value, lower 24-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM643MIDSB</name>
            <description>WLAN TIMERS TIM64 3 MIDSB</description>
            <addressOffset>0x170</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER34724</name>
                <description>TSF3 Timer register for the 24 middle significant bits.Write: Initial timer value, middle 24-bits.Read:Current timer value, middle 24-bits.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM643MSB</name>
            <description>WLAN TIMERS TIM64 3 MSB</description>
            <addressOffset>0x174</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITTIMER36348</name>
                <description>TSF Timer register for the 16 most significant bits.Write: Initial timer value, higher 16-bits.Read:Current timer value, higher 16-bits.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIM643CTRL</name>
            <description>WLAN TIMERS TIM64 3 CTRL</description>
            <addressOffset>0x178</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TSF3ENABLE</name>
                <description>Enable timer. 0: Disabled 1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TSF3LOADTIMER</name>
                <description>Write '1' to load timer with initial value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TSF3READCURRENT</name>
                <description>Write '1' to update current timer value in WLAN_TIMERS_TIM64_3_MSB, WLAN_TIMERS_TIM64_3_MIDSB and WLAN_TIMERS_TIM64_3_LSB registers.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TSF3DEBUGREADCURRENT</name>
                <description>For Debugging purposes.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FunctionalityDisable</name>
                    <description>Functionality disabled (default value)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EveryClockCycleReadB</name>
                    <description>Every clock cycle read back the current value of the TSF3 timer.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ACKTIMER</name>
            <description>WLAN TIMERS ACK TIMER</description>
            <addressOffset>0x180</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTIMERSACKTIMER</name>
                <description>Timer initial value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ACKCURTIM</name>
            <description>WLAN TIMERS ACK CUR TIM</description>
            <addressOffset>0x184</addressOffset>
            <access>read-only</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANTIMERSACKCURTIM</name>
                <description>Acknowledgement timer current value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ACKTIMERCTRL</name>
            <description>WLAN TIMERS ACK TIMER CTRL</description>
            <addressOffset>0x188</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLEACK</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>TIMERMODEACK</name>
                <description>Timer mode.0: Free-running (periodic). Starts with programmed value, counts down to zero and restarts again from programmed value.When the counter reaches zero, it generates an interrupt.1: One-Shot mode - Starts with programmed value, counts down to zero and stops.When the counter reaches zero, it generates an interrupt.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>INTMASKACK</name>
                <description>Interrupt Mask.0: Unmasked - Generates Interrupts1: Masked - Masks Interrupts</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RESACK</name>
                <description>Resolution bit.0: 1 us1: 1 ms</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERIPLSIGTIMER</name>
            <description>WLAN TIMERS PERIP LSIG TIMER</description>
            <addressOffset>0x194</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LSIGTIMER</name>
                <description>LSIG value, configured by MCP.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERIPCHLOAD</name>
            <description>WLAN TIMERS PERIP CH LOAD</description>
            <addressOffset>0x198</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHLOADENABLE</name>
                <description>Channel load timer enable bit.1: channel load enable0: channel load disable.Note MCU needs to configure channel load register to zero before setting enable register.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERIPCHANNELLOAD</name>
            <description>WLAN TIMERS PERIP CHANNEL LOAD</description>
            <addressOffset>0x19C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHLOADTIMERVALUE</name>
                <description>Indicates channel load in microsecods.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERIPDELTACURTIM</name>
            <description>WLAN TIMERS PERIP DELTA CUR TIM</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURTIMER</name>
                <description>Current timer value.Writing to this register causes the timer to start counting from the written value, otherwise it continues counting, wrapping at 0.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERIPDELTACTRL</name>
            <description>WLAN TIMERS PERIP DELTA CTRL</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DELTAENABLE</name>
                <description>Enable timer.0: Disabled1: Enabled</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LSIGSTATUS</name>
            <description>WLAN TIMERS LSIG STATUS</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGRESETNAVSTATUS</name>
                <description>When the LSIG counter transitions from 0x1 to 0x0, then this bit is set to indicatethat the LSIG timer has reached zero from its preloaded value.NOTE: A write to this register then clears the bit.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DEBUGCURRENTLSIGVALUE</name>
                <description>A read of this field returns the current LSig Timer value.</description>
                <lsb>8</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
