ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>ACKINTSTATUS</name>
            <description>WLAN TIMERS ACK INT STATUS</description>
            <addressOffset>0x1B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACKINTSTATUS</name>
                <description>Interrupt status of ACK timer.[0] - Masked Interrupt Status of ACK timer.[1] - Raw Interrupt status of ACK Timer.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ACKINTEN</name>
            <description>WLAN TIMERS ACK INT EN</description>
            <addressOffset>0x1B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACKINTEN</name>
                <description>Enable ACK timer interrupt.[0] - Enable Masked ACK Timer interrupt.[1] - Enable Raw ACK Timer interrupt.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ACKINTCLEAR</name>
            <description>WLAN TIMERS ACK INT CLEAR</description>
            <addressOffset>0x1BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACKINTCLEAR</name>
                <description>[0] - Writing '1' to this field clears the masked ACK timer interrupt.[1] - Writing '1' to this field clears the raw ACK timer interrupt.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PSMPINTSTATUS</name>
            <description>WLAN TIMERS PSMP INT STATUS</description>
            <addressOffset>0x1C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PSMPINTSTATUS</name>
                <description>[0] - Masked Interrupt status of PSMP timer.[1] - Raw Interrupt status of PSMP timer.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PSMPINTEN</name>
            <description>WLAN TIMERS PSMP INT EN</description>
            <addressOffset>0x1C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PSMPINTEN</name>
                <description>[0] - Enable masked interrupt of PSMP timer.[1] - Enable raw interrupt of PSMP timer.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PSMPINTCLEAR</name>
            <description>WLAN TIMERS PSMP INT CLEAR</description>
            <addressOffset>0x1C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PSMPINTCLEAR</name>
                <description>[0] - Writing '1' to this field clears the masked PSMP timer interrupt.[1] - Writing '1' to this field clears the raw PSMP timer interrupt.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCAINTSTATUS</name>
            <description>WLAN TIMERS EDCA INT STATUS</description>
            <addressOffset>0x1D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AC0INTSTATUS</name>
                <description>Masked Interrupt status of AC0 timer.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AC1INTSTATUS</name>
                <description>Masked Interrupt status of AC1 timer.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>AC2INTSTATUS</name>
                <description>Masked Interrupt status of AC2 timer.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>AC3INTSTATUS</name>
                <description>Masked Interrupt status of AC3 timer.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BEACONINTSTATUS</name>
                <description>Masked Interrupt status of BEACON timer.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCAINTEN</name>
            <description>WLAN TIMERS EDCA INT EN</description>
            <addressOffset>0x1D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AC0INTEN</name>
                <description>Interrupt enable of AC0 timer.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AC1INTEN</name>
                <description>Interrupt enable of AC1 timer.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>AC2INTEN</name>
                <description>Interrupt enable of AC2 timer.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>AC3INTEN</name>
                <description>Interrupt enable of AC3 timer.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BEACONINTEN</name>
                <description>Interrupt enable of BEACON timer.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EDCAINTCLEAR</name>
            <description>WLAN TIMERS EDCA INT CLEAR</description>
            <addressOffset>0x1D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AC0INTCLEAR</name>
                <description>Writing '1' to this field clears interrupt of AC0 timer.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AC1INTCLEAR</name>
                <description>Writing '1' to this field clears interrupt of AC1 timer.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>AC2INTCLEAR</name>
                <description>Writing '1' to this field clears interrupt of AC2 timer.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>AC3INTCLEAR</name>
                <description>Writing '1' to this field clears interrupt of AC3 timer.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BEACONINTCLEAR</name>
                <description>Writing '1' to this field clears interrupt of BEACON timer.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGMODE</name>
            <description>DEBUG MODE</description>
            <addressOffset>0x1DC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGMODE</name>
                <description>Debug register to set debug mode of EDCA timer.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGEDAGCCCARFTXON</name>
            <description>DEBUG EDAGC CCA RF TX ON</description>
            <addressOffset>0x1E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGEDAGCCCA</name>
                <description>Debug register for edagc_cca input of EDCA timer.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DEBUGRFTXON</name>
                <description>Debug register for rf_tx_on input of EDCA timer.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGNAVCOUNTERNONZERO</name>
            <description>DEBUG NAV COUNTER NON ZERO</description>
            <addressOffset>0x1E4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGNAVCOUNTERNONZERO</name>
                <description>Debug register for nav_counter_non_zero output of EDCA timer.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFICORETIMERSEDCA</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_WIFICORETIMERSEDCA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1A200</addressOffset>
          <register>
            <name>WLANEDCASOFTWARERESET</name>
            <description>WLAN EDCA SOFTWARE RESET</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PULSEDSOFTWARERESET</name>
                <description>Self-clearing software reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LATCHEDSOFTWARERESET</name>
                <description>Latched software reset</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAINTRSTATUSEN</name>
            <description>WLAN EDCA INTR STATUS EN</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAINTRSTATUSEN</name>
                <description>Enables Wlan EDCA Intr Status</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAINTRSTATUS</name>
            <description>WLAN EDCA INTR STATUS</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAINTRSTATUS</name>
                <description>Updates Status of Channel winBit 0 - Status of Channel 0 winBit 1 - Status of Channel 1 winBit 2 - Status of Channel 2 winBit 3 - Status of Channel 3 winBit 4 - Status of Channel 4 win</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAFEATURESENABLE</name>
            <description>WLAN EDCA FEATURES ENABLE</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAFEATURESENABLE</name>
                <description>BackOff number is set to WLAN_EDCA_BACKOFF_NUMBER of corresponding AC</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEACTIVATE</name>
            <description>WLAN EDCA DEACTIVATE</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEACTIVATE</name>
                <description>System goes to IN_ACTIVE state</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASLOTTIME</name>
            <description>WLAN EDCA SLOT TIME</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASLOTTIME</name>
                <description>Set EDCA Slot time</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASTARTUPCOMPENSATION</name>
            <description>WLAN EDCA STARTUP COMPENSATION</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASTARTUPCOMPENSATION</name>
                <description>Startup compensation value</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACWAC0</name>
            <description>WLAN EDCA CW AC0</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCACWAC0</name>
                <description>Wlan EDCA CWindow AC0</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACWAC1</name>
            <description>WLAN EDCA CW AC1</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCACWAC1</name>
                <description>Wlan EDCA CWindow AC1</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACWAC2</name>
            <description>WLAN EDCA CW AC2</description>
            <addressOffset>0x24</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCACWAC2</name>
                <description>Wlan EDCA CWindow AC2</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACWAC3</name>
            <description>WLAN EDCA CW AC3</description>
            <addressOffset>0x28</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCACWAC3</name>
                <description>Wlan EDCA CWindow AC3</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACWAC4</name>
            <description>WLAN EDCA CW AC4</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCACWAC4</name>
                <description>Wlan EDCA CWindow AC4</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC0</name>
            <description>WLAN EDCA AIFSN X SLOT PLUS SIFS AC0</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000004F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC0</name>
                <description>Default AC0(AC_BK)=79; AIFSN = 7; SLOT_TIME(11a/g)= 9usec ; SIFS= 16usec</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC1</name>
            <description>WLAN EDCA AIFSN X SLOT PLUS SIFS AC1</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000002B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC1</name>
                <description>Default AC1(AC_BE)=43; AIFSN = 3; SLOT_TIME(11a/g)= 9usec ; SIFS= 16usec</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC2</name>
            <description>WLAN EDCA AIFSN X SLOT PLUS SIFS AC2</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000022</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC2</name>
                <description>Default AC2(AC_VI)=34; AIFSN = 2; SLOT_TIME(11a/g)= 9usec ; SIFS= 16usec</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC3</name>
            <description>WLAN EDCA AIFSN X SLOT PLUS SIFS AC3</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000022</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC3</name>
                <description>Default AC3(AC_VO)=34; AIFSN = 2; SLOT_TIME(11a/g)= 9usec ; SIFS= 16usec</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC4</name>
            <description>WLAN EDCA AIFSN X SLOT PLUS SIFS AC4</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000001C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCAAIFSNXSLOTPLUSSIFSAC4</name>
                <description>Beacon PIFS = ( SIFS + 1 * SLOT_TIME)</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCABACKOFFNUMBERAC0</name>
            <description>WLAN EDCA BACKOFF NUMBER AC0</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCABACKOFFNUMBERAC0</name>
                <description>Set BackOff Number for AC0 from Register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCABACKOFFNUMBERAC1</name>
            <description>WLAN EDCA BACKOFF NUMBER AC1</description>
            <addressOffset>0x48</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCABACKOFFNUMBERAC1</name>
                <description>Set BackOff Number for AC1 from Register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCABACKOFFNUMBERAC2</name>
            <description>WLAN EDCA BACKOFF NUMBER AC2</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCABACKOFFNUMBERAC2</name>
                <description>Set BackOff Number for AC2 from Register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCABACKOFFNUMBERAC3</name>
            <description>WLAN EDCA BACKOFF NUMBER AC3</description>
            <addressOffset>0x50</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCABACKOFFNUMBERAC3</name>
                <description>Set BackOff Number for AC3 from Register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
