ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>WLANEDCABACKOFFNUMBERAC4</name>
            <description>WLAN EDCA BACKOFF NUMBER AC4</description>
            <addressOffset>0x54</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCABACKOFFNUMBERAC4</name>
                <description>Set BackOff Number for AC4 from Register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCABACKOFFCONTROL</name>
            <description>WLAN EDCA BACKOFF CONTROL</description>
            <addressOffset>0x58</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCABACKOFFCONTROLMODE</name>
                <description>Set EDCA BackOff Control to add/sub/replace mode</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>WLANEDCABACKOFFCONTROLVALUE</name>
                <description>1. If BACKOFF_CONTROL_OPERATION_ADD is set, Add value preset in WLAN_EDCA_BACKOFF_CONTROL (Bit's B2 to B16 ) to backOffNumber2. If BACKOFF_CONTROL_OPERATION_SUB is set, subtract backOffNumber from WLAN_EDCA_BACKOFF_CONTROL(Bit's B2 to B16) ifbackOffNumber is greater than equal to WLAN_EDCA_BACKOFF_CONTROL(Bit's B2 to B16) else replace backOffNumber withWLAN_EDCA_BACKOFF_CONTROL (Bit's B2 to B16)3. If BACKOFF_CONTROL_OPERATION_LIMIT_CHECK_AND_REPLACE is set, replace backOffNumber from WLAN_EDCA_BACKOFF_CONTROL(Bit's B17 to B23) ifbackOffNumber is greater than WLAN_EDCA_BACKOFF_CONTROL(Bit's B2 to B16)</description>
                <lsb>2</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>WLANEDCABACKOFFCONTROLREPLACEVALUE</name>
                <description>If BACKOFF_CONTROL_OPERATION_LIMIT_CHECK_AND_REPLACE is set,replace backOffNumber from WLAN_EDCA_BACKOFF_CONTROL(Bit's B17 to B23) ifbackOffNumber is greater than WLAN_EDCA_BACKOFF_CONTROL(Bit's B2 to B16)</description>
                <lsb>17</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAINTRABSSNAVTIMER</name>
            <description>WLAN EDCA INTRA BSS NAV TIMER</description>
            <addressOffset>0x5C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INTRABSSNAVTIMER</name>
                <description>Intra BSS NAV timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAINTERBSSNAVTIMER</name>
            <description>WLAN EDCA INTER BSS NAV TIMER</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INTERBSSNAVTIMER</name>
                <description>Inter BSS NAV timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASIFSAFTERCCABUSY</name>
            <description>WLAN EDCA SIFS AFTER CCA BUSY</description>
            <addressOffset>0x64</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASIFSAFTERCCABUSY</name>
                <description>Turnaround time when state goes to CCA_BUSY</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASIFSAFTERINTERNAVBUSY</name>
            <description>WLAN EDCA SIFS AFTER INTER NAV BUSY</description>
            <addressOffset>0x68</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASIFSAFTERINTERNAVBUSY</name>
                <description>Turnaround time when state goes to INTER_NAV_BUSY</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASIFSAFTERINTRANAVBUSY</name>
            <description>WLAN EDCA SIFS AFTER INTRA NAV BUSY</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASIFSAFTERINTRANAVBUSY</name>
                <description>Turnaround time when state goes to INTRA_NAV_BUSY</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASIFSAFTERTXON</name>
            <description>WLAN EDCA SIFS AFTER TX ON</description>
            <addressOffset>0x70</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASIFSAFTERTXON</name>
                <description>Turnaround time when state goes to TX_ON</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAMACADDRESSLOW</name>
            <description>WLAN EDCA MAC ADDRESS LOW</description>
            <addressOffset>0x74</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MACADDRESS0</name>
                <description>MAC_ADDRESS 1st byte</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MACADDRESS1</name>
                <description>MAC_ADDRESS 2nd byte</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MACADDRESS2</name>
                <description>MAC_ADDRESS 3rd byte</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCAMACADDRESSHIGH</name>
            <description>WLAN EDCA MAC ADDRESS HIGH</description>
            <addressOffset>0x78</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MACADDRESS3</name>
                <description>MAC_ADDRESS 4th byte</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MACADDRESS4</name>
                <description>MAC_ADDRESS 5th byte</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MACADDRESS5</name>
                <description>MAC_ADDRESS 6th byte</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACCABUSYMEASUREMENTDURATION</name>
            <description>WLAN EDCA CCA BUSY MEASUREMENT DURATION</description>
            <addressOffset>0x7C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCABUSYMEASUREMENTDURATION</name>
                <description>CCA busy measurement duration</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCACCABUSYDURATION</name>
            <description>WLAN EDCA CCA BUSY DURATION</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCACCABUSYDURATION</name>
                <description>EDCA CCA busy duration</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCANAVBUSYMEASUREMENTDURATION</name>
            <description>WLAN EDCA NAV BUSY MEASUREMENT DURATION</description>
            <addressOffset>0x84</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NAVBUSYMEASUREMENTDURATION</name>
                <description>NAV busy measurement duration</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCANAVBUSYDURATION</name>
            <description>WLAN EDCA NAV BUSY DURATION</description>
            <addressOffset>0x88</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCANAVBUSYDURATION</name>
                <description>EDCA NAV busy duration</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASUSPENDEDCAFTIMERAC0</name>
            <description>WLAN EDCA SUSPEND EDCAF TIMER AC0</description>
            <addressOffset>0x8C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASUSPENDEDCAFTIMERAC0</name>
                <description>EDCA Suspend EDCAF timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASUSPENDEDCAFTIMERAC1</name>
            <description>WLAN EDCA SUSPEND EDCAF TIMER AC1</description>
            <addressOffset>0x90</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASUSPENDEDCAFTIMERAC1</name>
                <description>EDCA Suspend EDCAF timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASUSPENDEDCAFTIMERAC2</name>
            <description>WLAN EDCA SUSPEND EDCAF TIMER AC2</description>
            <addressOffset>0x94</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASUSPENDEDCAFTIMERAC2</name>
                <description>EDCA Suspend EDCAF timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASUSPENDEDCAFTIMERAC3</name>
            <description>WLAN EDCA SUSPEND EDCAF TIMER AC3</description>
            <addressOffset>0x98</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASUSPENDEDCAFTIMERAC3</name>
                <description>EDCA Suspend EDCAF timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCASUSPENDEDCAFTIMERAC4</name>
            <description>WLAN EDCA SUSPEND EDCAF TIMER AC4</description>
            <addressOffset>0x9C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCASUSPENDEDCAFTIMERAC4</name>
                <description>EDCA Suspend EDCAF timer</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGAIFSAC0</name>
            <description>WLAN EDCA DEBUG AIFS AC0</description>
            <addressOffset>0xD4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGAIFSAC0</name>
                <description>Debug register to monitor AIFS of AC0</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGAIFSAC1</name>
            <description>WLAN EDCA DEBUG AIFS AC1</description>
            <addressOffset>0xD8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGAIFSAC1</name>
                <description>Debug register to monitor AIFS of AC1</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGAIFSAC2</name>
            <description>WLAN EDCA DEBUG AIFS AC2</description>
            <addressOffset>0xDC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGAIFSAC2</name>
                <description>Debug register to monitor AIFS of AC2</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGAIFSAC3</name>
            <description>WLAN EDCA DEBUG AIFS AC3</description>
            <addressOffset>0xE0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGAIFSAC3</name>
                <description>Debug register to monitor AIFS of AC3</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGAIFSAC4</name>
            <description>WLAN EDCA DEBUG AIFS AC4</description>
            <addressOffset>0xE4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGAIFSAC4</name>
                <description>Debug register to monitor AIFS of AC4</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGSUSPENDEDACSTATUS</name>
            <description>WLAN EDCA DEBUG SUSPENDED AC STATUS</description>
            <addressOffset>0xE8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGSUSPENDEDACSTATUS</name>
                <description>Debug Suspended AC status</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGINTERBSSNAVTIMER</name>
            <description>WLAN EDCA DEBUG INTER BSS NAV TIMER</description>
            <addressOffset>0xEC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGINTERBSSNAVTIMER</name>
                <description>Debug interBssNavTimer_rg</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGINTRABSSNAVTIMER</name>
            <description>WLAN EDCA DEBUG INTRA BSS NAV TIMER</description>
            <addressOffset>0xF0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGINTRABSSNAVTIMER</name>
                <description>Debug intraBssNavTimer_rg</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGCCABUSYMEASUREMENTDURATION</name>
            <description>WLAN EDCA DEBUG CCA BUSY MEASUREMENT DURATION</description>
            <addressOffset>0xF4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGCCABUSYMEASUREMENTDURATION</name>
                <description>Debug CCA busy measurement duration</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGFSMSTATE</name>
            <description>WLAN EDCA DEBUG FSM STATE</description>
            <addressOffset>0xF8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WLANEDCADEBUGFSMSTATE</name>
                <description>Debug FSM State</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WLANEDCADEBUGFREEZEFSMDURINGPBUSWRITES</name>
            <description>WLAN EDCA DEBUG FREEZE FSM DURING PBUS WRITES</description>
            <addressOffset>0xFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUGFREEZEFSMDURINGPBUSWRITES</name>
                <description>Debug freeze FSM during pBus writes</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFICORECLOCKRESETCTRL</name>
          <description>Unspecified</description>
          <headerStructName>RPUPBUS_WIFICORECLOCKRESETCTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1B000</addressOffset>
          <register>
            <name>CLOCKGATECTRLCLOCKENABLESTATUSALL</name>
            <description>CLOCK GATE CTRL CLOCK ENABLE STATUS ALL</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKENABLESTATUSALL</name>
                <description>Status of all clocks.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SomeClocksDisabled</name>
                    <description>Some clocks disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AllClocksActive</name>
                    <description>All clocks active.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOCKGATECTRLCLOCKENABLESETALL</name>
            <description>CLOCK GATE CTRL CLOCK ENABLE SET ALL</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKENABLESETALL</name>
                <description>Enable all clocks.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableAllClocks</name>
                    <description>Enable all clocks.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOCKGATECTRLCLOCKENABLECLRALL</name>
            <description>CLOCK GATE CTRL CLOCK ENABLE CLR ALL</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKENABLECLRALL</name>
                <description>Disable all clocks.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAction</name>
                    <description>No action.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DisableAllClocks</name>
                    <description>Disable all clocks.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
