ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>CLOCKGATECTRLAUTOCG1</name>
            <description>CLOCK GATE CTRL AUTO CG 1</description>
            <addressOffset>0x160</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AUTOCGIRQ</name>
                <description>Enable automatic clock-gating of the IRQ clock.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGLOG</name>
                <description>Enable automatic clock-gating of the LOG clock.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGCRYPTO</name>
                <description>Enable automatic clock-gating of the CRYPTO clock.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGEFS</name>
                <description>Enable automatic clock-gating of the EFS clock.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGMAC</name>
                <description>Enable automatic clock-gating of the MAC clock.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGEDC</name>
                <description>Enable automatic clock-gating of the EDC clock.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGSCP</name>
                <description>Enable automatic clock-gating of the SCP clock.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGPHYCTRL</name>
                <description>Enable automatic clock-gating of the PHYCTRL clock.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGED</name>
                <description>Enable automatic clock-gating of the ED clock.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGAGC</name>
                <description>Enable automatic clock-gating of the AGC clock.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGVIT</name>
                <description>Enable automatic clock-gating of the VIT clock.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGRTMFD</name>
                <description>Enable automatic clock-gating of the RTMFD clock.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGRTMTD</name>
                <description>Enable automatic clock-gating of the RTMTD clock.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGFFT</name>
                <description>Enable automatic clock-gating of the FFT clock.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGTXP</name>
                <description>Enable automatic clock-gating of the TXP clock.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGTXSCP</name>
                <description>Enable automatic clock-gating of the TXSCP clock.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGBDI</name>
                <description>Enable automatic clock-gating of the BDI clock.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGDEPARS</name>
                <description>Enable automatic clock-gating of the DEPARS clock.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGRXFD</name>
                <description>Enable automatic clock-gating of the RXFD clock.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGRX11B</name>
                <description>Enable automatic clock-gating of the RX11B clock.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGMIMO</name>
                <description>Enable automatic clock-gating of the MIMO clock.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGDECOMP</name>
                <description>Enable automatic clock-gating of the DECOMP clock.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGLDPC</name>
                <description>Enable automatic clock-gating of the LDPC clock.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGTIMERS</name>
                <description>Enable automatic clock-gating of the TIMERS clock.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGQM</name>
                <description>Enable automatic clock-gating of the QM clock.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGHPQM</name>
                <description>Enable automatic clock-gating of the HPQM clock.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGRXTD</name>
                <description>Enable automatic clock-gating of the RXTD clock.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCGFTM</name>
                <description>Enable automatic clock-gating of the FTM clock.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AutomaticClockGatin</name>
                    <description>Automatic clock-gating disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AutomaticClockGatin1</name>
                    <description>Automatic clock-gating enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
