ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
          <register>
            <name>RESETSTATUS1</name>
            <description>RESET STATUS 1</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESETSTATUSIRQ</name>
                <description>Status of the IRQ reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSLOG</name>
                <description>Status of the LOG reset.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSCRYPTO</name>
                <description>Status of the CRYPTO reset.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSEFS</name>
                <description>Status of the EFS reset.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSMAC</name>
                <description>Status of the MAC reset.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSEDC</name>
                <description>Status of the EDC reset.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSSCP</name>
                <description>Status of the SCP reset.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSPHYCTRL</name>
                <description>Status of the PHYCTRL reset.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSED</name>
                <description>Status of the ED reset.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSAGC</name>
                <description>Status of the AGC reset.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSVIT</name>
                <description>Status of the VIT reset.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSRTMFD</name>
                <description>Status of the RTMFD reset.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSRTMTD</name>
                <description>Status of the RTMTD reset.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSFFT</name>
                <description>Status of the FFT reset.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSTXP</name>
                <description>Status of the TXP reset.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSTXSCP</name>
                <description>Status of the TXSCP reset.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSBDI</name>
                <description>Status of the BDI reset.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSDEPARS</name>
                <description>Status of the DEPARS reset.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSRXFD</name>
                <description>Status of the RXFD reset.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSRX11B</name>
                <description>Status of the RX11B reset.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSMIMO</name>
                <description>Status of the MIMO reset.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSDECOMP</name>
                <description>Status of the DECOMP reset.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSLDPC</name>
                <description>Status of the LDPC reset.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSTIMERS</name>
                <description>Status of the TIMERS reset.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSQM</name>
                <description>Status of the QM reset.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSHPQM</name>
                <description>Status of the HPQM reset.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSRXTD</name>
                <description>Status of the RXTD reset.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETSTATUSFTM</name>
                <description>Status of the FTM reset.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ResetDeasserted</name>
                    <description>Reset deasserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ResetAsserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
