ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RPUQM</name>
      <description>RPUQM</description>
      <baseAddress>0x480BE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RPUQM</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>UCC_QM_PERIP</name>
          <description>Unspecified</description>
          <headerStructName>RPUQM_UCC_QM_PERIP</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONTROL0</name>
            <description>UCC QM PERIP CONTROL 0</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSQUEUE</name>
                <description>Writing a 1 to this bit causes all queues to be reset to their default stateThis bit is cleared automatically after it has taken effect.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORCLEAR</name>
            <description>UCC QM PERIP ERROR CLEAR</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFLAGCLR</name>
                <description>Writing 1 to this bit clears the UNDERFLOW and OVERFLOW bits in this register.The QM_ERROR event flag will be clear following this action for either state of ERR_FLAG_EN.This bit is cleared automatically after it has taken effect.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORSTATUS</name>
            <description>UCC QM PERIP ERROR STATUS</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRQUEUEID</name>
                <description>The ID number of the queue which caused the least recent error.This field is read-only</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OVERFLOW</name>
                <description>The least recent queue error was an overflow.This field is read-only</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>UNDERFLOW</name>
                <description>The least recent queue error was an underflow.This field is read-only</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG0</name>
            <description>UCC QM PERIP DEBUG 0</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONQUEUEID</name>
                <description>The ID number of the queue to be monitored.Writing any value to this field sets MAX_COUNT to zero.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MONENABLE</name>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DebugMonitorDisabled</name>
                    <description>Debug Monitor disabled (default power saving mode)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DebugMonitorEnabled</name>
                    <description>Debug Monitor enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG1</name>
            <description>UCC QM PERIP DEBUG 1</description>
            <addressOffset>0x10</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONMAXCOUNT</name>
                <description>The maximum value of count seen for queue MON_QUEUE_ID since the last write to the QM_PERIP_DEBUG_0 register</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG2</name>
            <description>UCC QM PERIP DEBUG 2</description>
            <addressOffset>0x14</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONCOUNT</name>
                <description>The value of count for the monitored queue MON_QUEUE_ID</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG3</name>
            <description>UCC QM PERIP DEBUG 3</description>
            <addressOffset>0x18</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONNOTEMPTY</name>
                <description>The NOT_EMPTY flag for the monitored queue MON_QUEUE_ID</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG4</name>
            <description>UCC QM PERIP DEBUG 4</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONNOTFULL</name>
                <description>The NOT_FULL flag for the monitored queue MON_QUEUE_ID</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG5</name>
            <description>UCC QM PERIP DEBUG 5</description>
            <addressOffset>0x20</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONLASTQUEUEID0</name>
                <description>The id of the last queue written</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MONLASTQUEUEID1</name>
                <description>The id of the second queue from the latest written</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG6</name>
            <description>UCC QM PERIP DEBUG 6</description>
            <addressOffset>0x24</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONLASTQUEUEID2</name>
                <description>The id of the third queue from the latest written</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MONLASTQUEUEID3</name>
                <description>The id of the fourth queue from the latest written</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD0</name>
            <description>UCC QM PERIP BUILD 0</description>
            <addressOffset>0x28</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXNUMQUEUES</name>
                <description>The highest queue ID supported by this instance of the Queue Manager. (15 to 255)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>COUNTONLY[%s]</name>
            <description>Description collection: UCC QM PERIP COUNT ONLY</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNTONLY</name>
                <description>The COUNT_ONLY flag for queues N*16 + 15 to N*16</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x100</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HEAD[%s]</name>
            <description>Description collection: UCC QM PERIP HEAD</description>
            <addressOffset>0x400</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HEADDATA</name>
                <description>Reading this register returns the data item at the head of queue [n].Writing any value to this register causes one item to be popped from the head of queue [n].</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x100</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>TAIL[%s]</name>
            <description>Description collection: UCC QM PERIP TAIL</description>
            <addressOffset>0x800</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TAILDATA</name>
                <description>Reading this register returns the value zero.Data written to this register is added to the tail of queue [n].</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
