ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RPUHPQM</name>
      <description>RPUHPQM</description>
      <baseAddress>0x480BF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RPUHPQM</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>UCC_HPQM_SYS</name>
          <description>Unspecified</description>
          <headerStructName>RPUHPQM_UCC_HPQM_SYS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONTROL0</name>
            <description>UCC HPQM SYS CONTROL 0</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSQUEUEID</name>
                <description>The number of the queue to be reset</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>RSQUEUE</name>
                <description>Writing a 1 to this bit causes all queues to be reset to their default stateWriting a 0 to this bit causes queue RS_QUEUE_ID to be reset to its default stateThis bit is cleared automatically after it has taken effect.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL1</name>
            <description>UCC HPQM SYS CONTROL 1</description>
            <addressOffset>0x4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000002</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMD256QUEUES</name>
                <description>Number of depth-256 queues (0 to 4)</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL2</name>
            <description>UCC HPQM SYS CONTROL 2</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMD128QUEUES</name>
                <description>Number of depth-128 queues (0 to 12)</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL3</name>
            <description>UCC HPQM SYS CONTROL 3</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMD64QUEUES</name>
                <description>Number of depth-64 queues (0 to 28)</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL4</name>
            <description>UCC HPQM SYS CONTROL 4</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMD32QUEUES</name>
                <description>Number of depth-32 queues (0 to 60)</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORCLEAR</name>
            <description>UCC HPQM SYS ERROR CLEAR</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFLAGCLR</name>
                <description>Writing 1 to this bit clears the UNDERFLOW and OVERFLOW bits in the UCC_HPQM_SYS_ERROR_STATUS register.The QM_ERROR event flag will be clear following this action for either state of ERR_FLAG_EN.This bit is cleared automatically after it has taken effect.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORSTATUS</name>
            <description>UCC HPQM SYS ERROR STATUS</description>
            <addressOffset>0x18</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRQUEUEID</name>
                <description>The ID number of the queue which caused the least recent error.This field is read-only</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>OVERFLOW</name>
                <description>The least recent queue error was an overflow.This field is read-only</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>UNDERFLOW</name>
                <description>The least recent queue error was an underflow.This field is read-only</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG0</name>
            <description>UCC HPQM SYS DEBUG 0</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONQUEUEID</name>
                <description>The ID number of the queue to be monitored.Writing any value to this field sets MAX_COUNT to zero.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>MONENABLE</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DebugMonitorDisabled</name>
                    <description>Debug Monitor disabled (default power saving mode)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DebugMonitorEnabled</name>
                    <description>Debug Monitor enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG1</name>
            <description>UCC HPQM SYS DEBUG 1</description>
            <addressOffset>0x20</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONMAXCOUNT</name>
                <description>The maximum value of count seen for queue MON_QUEUE_ID since the last write to the QM_SYS_DEBUG_0 register</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG2</name>
            <description>UCC HPQM SYS DEBUG 2</description>
            <addressOffset>0x24</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONCOUNT</name>
                <description>The value of count for the monitored queue MON_QUEUE_ID</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG3</name>
            <description>UCC HPQM SYS DEBUG 3</description>
            <addressOffset>0x28</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONRDPTR</name>
                <description>The value of read_pointer for the monitored queue MON_QUEUE_ID</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG4</name>
            <description>UCC HPQM SYS DEBUG 4</description>
            <addressOffset>0x2C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONNOTEMPTY</name>
                <description>The NOT_EMPTY flag for the monitored queue MON_QUEUE_ID</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUG5</name>
            <description>UCC HPQM SYS DEBUG 5</description>
            <addressOffset>0x30</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MONNOTFULL</name>
                <description>The NOT_FULL flag for the monitored queue MON_QUEUE_ID</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD0</name>
            <description>UCC HPQM SYS BUILD 0</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXD256ID</name>
                <description>The highest queue ID that can support depth-256 operation in this instance of the Host Port Queue Manager. (0 to 3)</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD1</name>
            <description>UCC HPQM SYS BUILD 1</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXD128ID</name>
                <description>The highest queue ID that can support depth-128 operation in this instance of the Host Port Queue Manager. (0 to 11)</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD2</name>
            <description>UCC HPQM SYS BUILD 2</description>
            <addressOffset>0x48</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXD64ID</name>
                <description>The highest queue ID that can support depth-64 operation in this instance of the Host Port Queue Manager. (0 to 27)</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD3</name>
            <description>UCC HPQM SYS BUILD 3</description>
            <addressOffset>0x4C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXD32ID</name>
                <description>The highest queue ID that can support depth-32 operation in this instance of the Host Port Queue Manager. (0 to 59)</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUILD4</name>
            <description>UCC HPQM SYS BUILD 4</description>
            <addressOffset>0x50</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUILDMAXQUEUEID</name>
                <description>The highest queue ID supported by this instance of the Host Port Queue Manager. (3 to 63)</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>QUEUENOTEMPTYLOW</name>
            <description>UCC HPQM SYS QUEUE NOT EMPTY LOW</description>
            <addressOffset>0x60</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QUEUENOTEMPTYLOW</name>
                <description>The lower 32-bits of the NOT_EMPTY flag for all the QUEUES.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>QUEUENOTEMPTYHIGH</name>
            <description>UCC HPQM SYS QUEUE NOT EMPTY HIGH</description>
            <addressOffset>0x64</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QUEUENOTEMPTYHIGH</name>
                <description>The upper 32-bits of the NOT_EMPTY flag for all the QUEUES.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>QUEUENOTFULLLOW</name>
            <description>UCC HPQM SYS QUEUE NOT FULL LOW</description>
            <addressOffset>0x68</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QUEUENOTFULLLOW</name>
                <description>The lower 32-bits of the NOT_FULL flag for all the QUEUES.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>QUEUENOTFULLHIGH</name>
            <description>UCC HPQM SYS QUEUE NOT FULL HIGH</description>
            <addressOffset>0x6C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>QUEUENOTFULLHIGH</name>
                <description>The upper 32-bits of the NOT_FULL flag for all the QUEUES.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>HEAD[%s]</name>
            <description>Description collection: UCC HPQM SYS HEAD</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HEADDATA</name>
                <description>Reading this register returns the data item at the head of queue [n].Writing any value to this register causes one item to be popped from the head of queue [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>TAIL[%s]</name>
            <description>Description collection: UCC HPQM SYS TAIL</description>
            <addressOffset>0x200</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TAILDATA</name>
                <description>Reading this register returns the value zero.Data written to this register is added to the tail of queue [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
