ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="VPRLMAC">
      <name>GLOBAL_VPR120</name>
      <description>VPR peripheral registers 2</description>
      <baseAddress>0x5F8C8000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>VPR120</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_SDCARD</name>
      <description>SD-Card and eMMC</description>
      <baseAddress>0x5F8C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>SDCARD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Enable the SDCARD peripheral</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable SDCARD</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable SDCARD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SDCARD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CORE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SDCARD_CORE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>SDMASAR</name>
            <description>This register is used to configure a 32-bit Block Count or an SDMA System Address based on the Host Version 4 Enable bit in the Host Control 2 register. This register is applicable for both SD and eMMC modes.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLOCKCNTSDMASA</name>
                <description>32-bit Block Count (SDMA System Address)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZER</name>
            <description>This register is used to configure an SDMA buffer boundary and the number of bytes in a data block. This register is applicable for both SD and eMMC modes.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>XFERBLOCKSIZE</name>
                <description>Transfer Block Size</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SDMABUFBDARY</name>
                <description>SDMA Buffer Boundary</description>
                <lsb>12</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BYTES4K</name>
                    <description>4K bytes SDMA Buffer Boundary</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES8K</name>
                    <description>8K bytes SDMA Buffer Boundary</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES16K</name>
                    <description>16K bytes SDMA Buffer Boundary</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES32K</name>
                    <description>32K bytes SDMA Buffer Boundary</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES64K</name>
                    <description>64K bytes SDMA Buffer Boundary</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES128K</name>
                    <description>128K bytes SDMA Buffer Boundary</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES256K</name>
                    <description>256K bytes SDMA Buffer Boundary</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYTES512K</name>
                    <description>512K bytes SDMA Buffer Boundary</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVDBLOCKSIZE15</name>
                <description>This bit of the BLOCKSIZE_R register is reserved. It always returns 0.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>UNTR</name>
            <description>This register is used to configure the number of data blocks. This register is applicable for both SD and eMMC modes.</description>
            <addressOffset>0x006</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>BLOCKCNT</name>
                <description>16-bit Block Count</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ARGUMENTR</name>
            <description>This register is used to configure the SD/eMMC command argument.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ARGUMENT</name>
                <description>Command Argument</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>XFERMODER</name>
            <description>This register is used to control the operation of data transfers for an SD/eMMC mode. The Host driver sets this register before issuing a command that transfers data.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>DMAENABLE</name>
                <description>DMA Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>No data transfer or Non-DMA data transfer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>DMA Data transfer</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BLOCKCOUNTENABLE</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOCMDENABLE</name>
                <description>Auto Command Enable</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AUTOCMDDISABLED</name>
                    <description>Auto Command Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AUTOCMD12ENABLED</name>
                    <description>Auto CMD12 Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AUTOCMD23ENABLED</name>
                    <description>Auto CMD23 Enable</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AUTOCMDAUTOSEL</name>
                    <description>Auto CMD Auto Select</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DATAXFERDIR</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>WRITE</name>
                    <description>Write (Host to Card)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>READ</name>
                    <description>Read (Card to Host)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MULTIBLKSEL</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SINGLE</name>
                    <description>Single Block</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULTI</name>
                    <description>Multiple Block</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESPTYPE</name>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESPR1</name>
                    <description>R1 (Memory)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESPR5</name>
                    <description>R5 (SDIO)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESPERRCHKENABLE</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Response Error Check is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Response Error Check is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESPINTDISABLE</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Response Interrupt is enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Response Interrupt is disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD</name>
                <description>These bits of the XFER_MODE_R register are reserved. They always return 0.</description>
                <lsb>9</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MDR</name>
            <description>This register is used to provide the information related to a command and a response packet. This register is applicable for an SD/eMMC mode.</description>
            <addressOffset>0x00E</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>RESPTYPESELECT</name>
                <description>Response Type Select</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORESP</name>
                    <description>No Response</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESPLEN136</name>
                    <description>Response Length 136</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESPLEN48</name>
                    <description>Response Length 48</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESPLEN48B</name>
                    <description>Response Length 48; Check Busy after response</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUBCMDFLAG</name>
                <description>Sub Command Flag</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MAIN</name>
                    <description>Main Command</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUB</name>
                    <description>Sub Command</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMDCRCCHKENABLE</name>
                <description>Command CRC Check Enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMDIDXCHKENABLE</name>
                <description>Command Index Check Enable</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DATAPRESENTSEL</name>
                <description>Data Present Select</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NODATA</name>
                    <description>No Data Present</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATA</name>
                    <description>Data Present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMDTYPE</name>
                <description>Command Type</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMALCMD</name>
                    <description>Normal</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUSPENDCMD</name>
                    <description>Suspend</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESUMECMD</name>
                    <description>Resume</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ABORTCMD</name>
                    <description>Abort</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMDINDEX</name>
                <description>Command Index</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>RSVD</name>
                <description>These bits of the CMD_R register are reserved. They always return 0.</description>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESP01R</name>
            <description>This register stores 39-08 bits of the Response Field for an SD/eMMC mode.  The response for an SD/eMMC command can be a maximum of 128 bits. These 128 bits are segregated into four 32-bit registers: RESP01_R, RESP23_R, RESP45_R and RESP67_R.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESP01</name>
                <description>Command Response</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESP23R</name>
            <description>This register stores 71-40 bits of the Response Field for an SD/eMMC mode. This register is used to store the response from the cards. The response can be a maximum of 128 bits. These 128 bits are segregated into four 32-bit</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESP23</name>
                <description>Command Response</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESP45R</name>
            <description>This register stores 103-72 bits of the Response Field for an SD/eMMC mode.  The response for SD/eMMC command can be a maximum of 128 bits. These 128 bits are segregated into four 32-bit registers: RESP01_R, RESP23_R, RESP45_R and RESP67_R.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESP45</name>
                <description>Command Response</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESP67R</name>
            <description>This register stores 135-104 bits of the Response Field for an SD/eMMC mode.    The SD/eMMC response can be a maximum of 128 bits. These 128 bits are segregated into four 32-bit registers: RESP01_R, RESP23_R, RESP45_R and RESP67_R.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESP67</name>
                <description>Command Response</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>UFDATAR</name>
            <description>This register is used to access the packet buffer. This register is applicable for an SD/eMMC/UHS-II mode.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUFDATA</name>
                <description>Buffer Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
