ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
            <register>
              <name>RXSAMPLEDELAY</name>
              <description>RX Sample Delay Register</description>
              <addressOffset>0x0F0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RSD</name>
                  <description>Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input port. Each value</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>RSVD0RXSAMPLEDELAY</name>
                  <lsb>8</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SE</name>
                  <description>Receive Data (rxd) Sampling Edge. This register is used to decide the sampling edge for RXD signal with ssi_clk. Then this bit is set to 1 then negative edge of ssi_clk will be used to sample the incoming data, otherwise positive edge will be used for sampling.</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                </field>
                <field>
                  <name>RSVD1RXSAMPLEDELAY</name>
                  <lsb>17</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SPICTRLR0</name>
              <description>SPI_CTRLR0 - SPI Control Register</description>
              <addressOffset>0x0F4</addressOffset>
              <access>read-write</access>
              <resetValue>0x40000200</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Instruction and Address will be sent in Standard SPI Mode.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Instruction will be sent in Standard SPI Mode and Address will be sent in the mode specified by CTRLR0.SPI_FRF.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Both Instruction and Address will be sent in the mode specified by SPI_FRF.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Dual Octal mode, the address and instruction are transferred in octal mode and data is transferred on 16 data lines.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ADDRL</name>
                  <description>This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the FIFO the transfer can begin.</description>
                  <lsb>2</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDRL0</name>
                      <description>No Address</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL4</name>
                      <description>4 bit Address length</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL8</name>
                      <description>8 bit Address length</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL12</name>
                      <description>12 bit Address length</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL16</name>
                      <description>16 bit Address length</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL20</name>
                      <description>20 bit Address length</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL24</name>
                      <description>24 bit Address length</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL28</name>
                      <description>28 bit Address length</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL32</name>
                      <description>32 bit Address length</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL36</name>
                      <description>36 bit Address length</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL40</name>
                      <description>40 bit Address length</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL44</name>
                      <description>44 bit Address length</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL48</name>
                      <description>48 bit Address length</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL52</name>
                      <description>52 bit Address length</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL56</name>
                      <description>56 bit Address length</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDRL60</name>
                      <description>60 bit Address length</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSPICTRLR06</name>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPMDBITEN</name>
                  <description>Mode bits enable in XIP mode. If this bit is set to 1, then in XIP mode of operation QSPI CORE will insert mode bits after the address phase. These bits are set in register XIP_MODE_BITS register.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INSTL</name>
                  <description>Enhanced SPI mode instruction length in bits.</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INSTL0</name>
                      <description>No Instruction</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INSTL4</name>
                      <description>4 bit Instruction length</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INSTL8</name>
                      <description>8 bit Instruction length</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INSTL16</name>
                      <description>16 bit Instruction length</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSPICTRLR010</name>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>WAITCYCLES</name>
                  <description>Wait cycles in Enhanced SPI mode between control frames transmit and data reception. Specified as number of SPI clock cycles.</description>
                  <lsb>11</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>SPIDDREN</name>
                  <description>SPI DDR Enable bit. This will enable Dual-data rate transfers in Enhanced SPI frame formats of SPI.</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INSTDDREN</name>
                  <description>Instruction DDR Enable bit. This will enable Dual-data rate transfer for Instruction phase.</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPIRXDSEN</name>
                  <description>Read data strobe enable bit. Once this bit is set to 1 QSPI CORE will use Read data strobe (rxds) to capture read data.</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPDFSHC</name>
                  <description>Fix DFS for XIP transfers. If this bit is set to 1 then data frame size for XIP transfers will be fixed to the programmed value in CTRLR0.DFS. The number of data frames to fetch will be determined by HSIZE and HBURST signals. If this bit is set to 0 then data frame size and number of data frames to fetch will be determined by HSIZE and HBURST signals</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPINSTEN</name>
                  <description>XIP instruction enable bit. If this bit is set to 1 then XIP transfers will also have instruction phase. The instruction op-codes will be chosen from XIP_INCR_INST or XIP_WRAP_INST registers bases on AHB transfer type.</description>
                  <lsb>20</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SSICXIPCONTXFEREN</name>
                  <description>Enable continuous transfer in XIP mode. If this bit is set to 1 then continuous transfer mode in XIP will be enabled, in this mode QSPI CORE will keep target selected until a non-XIP transfer is detected on the AHB interface.</description>
                  <lsb>21</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR022</name>
                  <lsb>22</lsb>
                  <msb>22</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RXDSVLEN</name>
                  <description>RXDS variable latency enable bit.</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPIDMEN</name>
                  <description>SPI data mask enable bit.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPIRXDSSIGEN</name>
                  <description>Enable rxds signaling during address and command phase of Hyperbus transfer.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPMBL</name>
                  <description>XIP Mode bits length. Sets the length of mode bits in XIP mode of operation. These bits are valid only when SPI_CTRLR0.XIP_MD_BIT_EN is set to 1.</description>
                  <lsb>26</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MBL2</name>
                      <description>Mode bits length equal to 2</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL4</name>
                      <description>Mode bits length equal to 4</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL8</name>
                      <description>Mode bits length equal to 8</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL16</name>
                      <description>Mode bits length equal to 16</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSPICTRLR028</name>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPPREFETCHEN</name>
                  <description>Enables XIP pre-fetch functionality in QSPI CORE.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CLKSTRETCHEN</name>
                  <description>Enables clock stretching capability in SPI transfers.</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR0</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DWCSSIADDRESSBLOCK2</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_QSPI_CORE_DWCSSIADDRESSBLOCK2</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>SPICTRLR1</name>
              <description>SPI Control 1 register</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DYNWS</name>
                  <description>SPI Dynamic Wait states field.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR137</name>
                  <lsb>3</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>MAXWS</name>
                  <description>Maximum wait cycles allowed per transaction.</description>
                  <lsb>8</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR11215</name>
                  <lsb>12</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CSMINHIGH</name>
                  <description>Chip-Select Minimum HIGH period.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR12031</name>
                  <lsb>20</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SPITECR</name>
              <description>SPI Transmit Error Interrupt Clear Register</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SPITECR</name>
                  <description>Clear SPI Transmit Error interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPITECR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>PCGCS</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_QSPI_PCGCS</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n. When FULL_PCP_ZERO feature is not supported, PENALTY[0] address overlaps the PENALTY0 address and register description for PENALTY[0] is not valid.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PENALTY0</name>
            <description>Penalty level for power/clock pair 0. The register description is valid only when FULL_PCP_ZERO feature is not supported</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>PENALTY[%s]</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
