ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P1</name>
      <description>GPIO Port 1</description>
      <baseAddress>0x5F938200</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P2</name>
      <description>GPIO Port 2</description>
      <baseAddress>0x5F938400</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P3</name>
      <description>GPIO Port 3</description>
      <baseAddress>0x5F938600</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P5</name>
      <description>GPIO Port 4</description>
      <baseAddress>0x5F938A00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P6</name>
      <description>GPIO Port 5</description>
      <baseAddress>0x5F938C00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P8</name>
      <description>GPIO Port 6</description>
      <baseAddress>0x5F939000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0">
      <name>GLOBAL_P9</name>
      <description>GPIO Port 7</description>
      <baseAddress>0x5F939200</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_GPIOINTERNAL</name>
      <description>GPIO Internal</description>
      <baseAddress>0x5F939E00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GPIOINTERNAL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>LATCHCLRWAITCNT</name>
          <description>Select the number of wait cycles inserted on the bus when a LATCH register is cleared.</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>LATCHCLRWAITCNT</name>
              <description>Select the number of wait cycles inserted on the bus when a LATCH register is cleared.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCELDETECTLOWCNT</name>
          <description>Select the number of cycles that LDETECT is forced low after clearing a LATCH register.</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <size>0x20</size>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>FORCELDETECTLOWCNT</name>
              <description>Select the number of cycles that LDETECT is forced low after clearing a LATCH register.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET</name>
          <description>Reset all GPIO registers.</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset all GPIO registers.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Trigger reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSECONFIGCHANGECNT</name>
          <description>Selects the number of cycles before the SENSE configuration takes effect when it is changed. Setting this register lower than the reset value can lead to unwanted LATCH set
        when SENSE and INPUT fields (PIN[n].CNF) are changed simultaneously.</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <size>0x20</size>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>SENSECONFIGCHANGECNT</name>
              <description>Selects the number of cycles before the SENSE configuration takes effect when it is changed.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PCGC</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GPIOINTERNAL_PCGC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x160</addressOffset>
          <register>
            <name>TURNOFFAUTOCLOCKSOURCEREQ</name>
            <description>No functionality</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <!--Security securemapping=S-->
          </register>
          <register>
            <dim>0x5</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n</description>
            <addressOffset>0x20</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x5</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
